//计算机基础
export const CS_LIST = [
    //深入浅出计算机组成原理
    {
        id: 'klad1o97mmx',
        type: 'cs',
        cid: '100026001',
        title: '深入浅出计算机组成原理',
        subTitle: '带你掌握计算机体系全貌',
        authorName: '徐文浩',
        authorInfo: 'bothub创始人',
        contents: [
            {
                id: '7ut40znfcng',
                title: '入门篇',
                subList: [
                    {
                        id: 't8zdc85dv5u',
                        title: '开篇词 | 为什么你需要学习计算机组成原理？',
                        src:
                            '深入浅出计算机组成原理/html/__91427__开篇词 _ 为什么你需要学习计算机组成原理？.html',
                        audio: ''
                    },
                    {
                        id: 'yj4rthzvenr',
                        title: '01 | 冯·诺依曼体系结构：计算机组成的金字塔',
                        src:
                            '深入浅出计算机组成原理/html/__91793__01 _ 冯·诺依曼体系结构：计算机组成的金字塔.html',
                        audio: ''
                    },
                    {
                        id: 'o2a301xcpkl',
                        title:
                            '02 | 给你一张知识地图，计算机组成原理应该这么学',
                        src:
                            '深入浅出计算机组成原理/html/__92378__02 _ 给你一张知识地图，计算机组成原理应该这么学.html',
                        audio: ''
                    },
                    {
                        id: '9hmybydlpf0',
                        title:
                            '03 | 通过你的CPU主频，我们来谈谈“性能”究竟是什么？',
                        src:
                            '深入浅出计算机组成原理/html/__92215__03 _ 通过你的CPU主频，我们来谈谈“性能”究竟是什么？.html',
                        audio: ''
                    },
                    {
                        id: 'n3qysljo8iv',
                        title: '04 | 穿越功耗墙，我们该从哪些方面提升“性能”？',
                        src:
                            '深入浅出计算机组成原理/html/__93246__04 _ 穿越功耗墙，我们该从哪些方面提升“性能”？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'r5fy4o7cl3g',
                title: '原理篇：指令和运算',
                subList: [
                    {
                        id: 'd9jdnzcercx',
                        title: '05 | 计算机指令：让我们试试用纸带编程',
                        src:
                            '深入浅出计算机组成原理/html/__93359__05 _ 计算机指令：让我们试试用纸带编程.html',
                        audio: ''
                    },
                    {
                        id: 'rp1o3ad38wq',
                        title: '06 | 指令跳转：原来if...else就是goto',
                        src:
                            '深入浅出计算机组成原理/html/__94075__06 _ 指令跳转：原来if...else就是goto.html',
                        audio: ''
                    },
                    {
                        id: '2yn1h94jdvi',
                        title: '07 | 函数调用：为什么会发生stack overflow？',
                        src:
                            '深入浅出计算机组成原理/html/__94427__07 _ 函数调用：为什么会发生stack overflow？.html',
                        audio: ''
                    },
                    {
                        id: 'zb6n95wo2oe',
                        title:
                            '08 | ELF和静态链接：为什么程序无法同时在Linux和Windows下运行？',
                        src:
                            '深入浅出计算机组成原理/html/__94470__08 _ ELF和静态链接：为什么程序无法同时在Linux和Windows下运行？.html',
                        audio: ''
                    },
                    {
                        id: '84uccdddu3u',
                        title: '09 | 程序装载：“640K内存”真的不够用么？',
                        src:
                            '深入浅出计算机组成原理/html/__95223__09 _ 程序装载：“640K内存”真的不够用么？.html',
                        audio: ''
                    },
                    {
                        id: 'fztcgccx3fe',
                        title: '10 | 动态链接：程序内部的“共享单车”',
                        src:
                            '深入浅出计算机组成原理/html/__95244__10 _ 动态链接：程序内部的“共享单车”.html',
                        audio: ''
                    },
                    {
                        id: '8xs6ko70a84',
                        title:
                            '11 | 二进制编码：“手持两把锟斤拷，口中疾呼烫烫烫”？',
                        src:
                            '深入浅出计算机组成原理/html/__95844__11 _ 二进制编码：“手持两把锟斤拷，口中疾呼烫烫烫”？.html',
                        audio: ''
                    },
                    {
                        id: 'jsob921lc1p',
                        title:
                            '12 | 理解电路：从电报机到门电路，我们如何做到“千里传信”？',
                        src:
                            '深入浅出计算机组成原理/html/__95868__12 _ 理解电路：从电报机到门电路，我们如何做到“千里传信”？.html',
                        audio: ''
                    },
                    {
                        id: '8yvqrs4piv6',
                        title: '13 | 加法器：如何像搭乐高一样搭电路（上）？',
                        src:
                            '深入浅出计算机组成原理/html/__95883__13 _ 加法器：如何像搭乐高一样搭电路（上）？.html',
                        audio: ''
                    },
                    {
                        id: 'iys7u8evc4i',
                        title: '14 | 乘法器：如何像搭乐高一样搭电路（下）？',
                        src:
                            '深入浅出计算机组成原理/html/__97477__14 _ 乘法器：如何像搭乐高一样搭电路（下）？.html',
                        audio: ''
                    },
                    {
                        id: '9oh2ua7hfh6',
                        title:
                            '15 | 浮点数和定点数（上）：怎么用有限的Bit表示尽可能多的信息？',
                        src:
                            '深入浅出计算机组成原理/html/__97866__15 _ 浮点数和定点数（上）：怎么用有限的Bit表示尽可能多的信息？.html',
                        audio: ''
                    },
                    {
                        id: 'nyeagajjt3f',
                        title:
                            '16 | 浮点数和定点数（下）：深入理解浮点数到底有什么用？',
                        src:
                            '深入浅出计算机组成原理/html/__98312__16 _ 浮点数和定点数（下）：深入理解浮点数到底有什么用？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'df7jswbqau5',
                title: '原理篇：处理器',
                subList: [
                    {
                        id: 'xy9h3xepu6i',
                        title: '17 | 建立数据通路（上）：指令+运算=CPU',
                        src:
                            '深入浅出计算机组成原理/html/__98872__17 _ 建立数据通路（上）：指令+运算=CPU.html',
                        audio: ''
                    },
                    {
                        id: '3ddo5xyoh1j',
                        title: '18 | 建立数据通路（中）：指令+运算=CPU',
                        src:
                            '深入浅出计算机组成原理/html/__99092__18 _ 建立数据通路（中）：指令+运算=CPU.html',
                        audio: ''
                    },
                    {
                        id: 'raxtsmeyeah',
                        title: '19 | 建立数据通路（下）：指令+运算=CPU',
                        src:
                            '深入浅出计算机组成原理/html/__99505__19 _ 建立数据通路（下）：指令+运算=CPU.html',
                        audio: ''
                    },
                    {
                        id: 'hq51k2z44ay',
                        title:
                            '20 | 面向流水线的指令设计（上）：一心多用的现代CPU',
                        src:
                            '深入浅出计算机组成原理/html/__99523__20 _ 面向流水线的指令设计（上）：一心多用的现代CPU.html',
                        audio: ''
                    },
                    {
                        id: '9ez9vc97sl6',
                        title:
                            '21 | 面向流水线的指令设计（下）：奔腾4是怎么失败的？',
                        src:
                            '深入浅出计算机组成原理/html/__100554__21 _ 面向流水线的指令设计（下）：奔腾4是怎么失败的？.html',
                        audio: ''
                    },
                    {
                        id: '0ljsoxzi4eh',
                        title: '22 | 冒险和预测（一）：hazard是“危”也是“机”',
                        src:
                            '深入浅出计算机组成原理/html/__100569__22 _ 冒险和预测（一）：hazard是“危”也是“机”.html',
                        audio: ''
                    },
                    {
                        id: 'h4f79xv66qa',
                        title: '23 | 冒险和预测（二）：流水线里的接力赛',
                        src:
                            '深入浅出计算机组成原理/html/__101172__23 _ 冒险和预测（二）：流水线里的接力赛.html',
                        audio: ''
                    },
                    {
                        id: 'fbe5uu76r5o',
                        title: '24 | 冒险和预测（三）：CPU里的“线程池”',
                        src:
                            '深入浅出计算机组成原理/html/__101436__24 _ 冒险和预测（三）：CPU里的“线程池”.html',
                        audio: ''
                    },
                    {
                        id: 'bqgpt93jjzh',
                        title:
                            '25 | 冒险和预测（四）：今天下雨了，明天还会下雨么？',
                        src:
                            '深入浅出计算机组成原理/html/__102166__25 _ 冒险和预测（四）：今天下雨了，明天还会下雨么？.html',
                        audio: ''
                    },
                    {
                        id: 'abf4m45sdx6',
                        title:
                            '26 | Superscalar和VLIW：如何让CPU的吞吐率超过1？',
                        src:
                            '深入浅出计算机组成原理/html/__102888__26 _ Superscalar和VLIW：如何让CPU的吞吐率超过1？.html',
                        audio: ''
                    },
                    {
                        id: 'slkrtwoovpr',
                        title: '27 | SIMD：如何加速矩阵乘法？',
                        src:
                            '深入浅出计算机组成原理/html/__103433__27 _ SIMD：如何加速矩阵乘法？.html',
                        audio: ''
                    },
                    {
                        id: 'f1cb80tqnp3',
                        title: '28 | 异常和中断：程序出错了怎么办？',
                        src:
                            '深入浅出计算机组成原理/html/__103717__28 _ 异常和中断：程序出错了怎么办？.html',
                        audio: ''
                    },
                    {
                        id: 'd8spybnrgkt',
                        title: '29 | CISC和RISC：为什么手机芯片都是ARM？',
                        src:
                            '深入浅出计算机组成原理/html/__104259__29 _ CISC和RISC：为什么手机芯片都是ARM？.html',
                        audio: ''
                    },
                    {
                        id: 'nurssrgwor4',
                        title: '30 | GPU（上）：为什么玩游戏需要使用GPU？',
                        src:
                            '深入浅出计算机组成原理/html/__104747__30 _ GPU（上）：为什么玩游戏需要使用GPU？.html',
                        audio: ''
                    },
                    {
                        id: 'cfyex9wd88j',
                        title: '31 | GPU（下）：为什么深度学习需要使用GPU？',
                        src:
                            '深入浅出计算机组成原理/html/__105401__31 _ GPU（下）：为什么深度学习需要使用GPU？.html',
                        audio: ''
                    },
                    {
                        id: 'ns30ozyi9gy',
                        title: '32 | FPGA和ASIC：计算机体系结构的黄金时代',
                        src:
                            '深入浅出计算机组成原理/html/__105974__32 _ FPGA和ASIC：计算机体系结构的黄金时代.html',
                        audio: ''
                    },
                    {
                        id: '7v5k7b742r5',
                        title: '33 | 解读TPU：设计和拆解一块ASIC芯片',
                        src:
                            '深入浅出计算机组成原理/html/__106476__33 _ 解读TPU：设计和拆解一块ASIC芯片.html',
                        audio: ''
                    },
                    {
                        id: 'j1ghb304hh6',
                        title:
                            '34 | 理解虚拟机：你在云上拿到的计算机是什么样的？',
                        src:
                            '深入浅出计算机组成原理/html/__107183__34 _ 理解虚拟机：你在云上拿到的计算机是什么样的？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'vkzn8tthx23',
                title: '原理篇：存储与I/O系统',
                subList: [
                    {
                        id: 'tur5b7yiga2',
                        title:
                            '35 | 存储器层次结构全景：数据存储的大金字塔长什么样？',
                        src:
                            '深入浅出计算机组成原理/html/__107422__35 _ 存储器层次结构全景：数据存储的大金字塔长什么样？.html',
                        audio: ''
                    },
                    {
                        id: 'r4ik27soikm',
                        title:
                            '36 | 局部性原理：数据库性能跟不上，加个缓存就好了？',
                        src:
                            '深入浅出计算机组成原理/html/__107447__36 _ 局部性原理：数据库性能跟不上，加个缓存就好了？.html',
                        audio: ''
                    },
                    {
                        id: '2aza4wl9lvk',
                        title: '37 | 高速缓存（上）：“4毫秒”究竟值多少钱？',
                        src:
                            '深入浅出计算机组成原理/html/__107477__37 _ 高速缓存（上）：“4毫秒”究竟值多少钱？.html',
                        audio: ''
                    },
                    {
                        id: '3apc4y4rgng',
                        title: '38 | 高速缓存（下）：你确定你的数据更新了么？',
                        src:
                            '深入浅出计算机组成原理/html/__109331__38 _ 高速缓存（下）：你确定你的数据更新了么？.html',
                        audio: ''
                    },
                    {
                        id: '547gcs5ga8y',
                        title:
                            '39 | MESI协议：如何让多核CPU的高速缓存保持一致？',
                        src:
                            '深入浅出计算机组成原理/html/__109874__39 _ MESI协议：如何让多核CPU的高速缓存保持一致？.html',
                        audio: ''
                    },
                    {
                        id: 'v2bhr3sadtn',
                        title:
                            '40 | 理解内存（上）：虚拟内存和内存保护是什么？',
                        src:
                            '深入浅出计算机组成原理/html/__110474__40 _ 理解内存（上）：虚拟内存和内存保护是什么？.html',
                        audio: ''
                    },
                    {
                        id: 'n2b5py6yqjs',
                        title: '41 | 理解内存（下）：解析TLB和内存保护',
                        src:
                            '深入浅出计算机组成原理/html/__111172__41 _ 理解内存（下）：解析TLB和内存保护.html',
                        audio: ''
                    },
                    {
                        id: 'rdu4zowf7n6',
                        title: '42 | 总线：计算机内部的高速公路',
                        src:
                            '深入浅出计算机组成原理/html/__111952__42 _ 总线：计算机内部的高速公路.html',
                        audio: ''
                    },
                    {
                        id: 'e9xyvwmldeg',
                        title:
                            '43 | 输入输出设备：我们并不是只能用灯泡显示“0”和“1”',
                        src:
                            '深入浅出计算机组成原理/html/__113361__43 _ 输入输出设备：我们并不是只能用灯泡显示“0”和“1”.html',
                        audio: ''
                    },
                    {
                        id: 'srix9515159',
                        title: '44 | 理解IO_WAIT：I/O性能到底是怎么回事儿？',
                        src:
                            '深入浅出计算机组成原理/html/__113809__44 _ 理解IO_WAIT：I_O性能到底是怎么回事儿？.html',
                        audio: ''
                    },
                    {
                        id: '4v453afo5fh',
                        title: '45 | 机械硬盘：Google早期用过的“黑科技”',
                        src:
                            '深入浅出计算机组成原理/html/__116104__45 _ 机械硬盘：Google早期用过的“黑科技”.html',
                        audio: ''
                    },
                    {
                        id: 'iufqf618kf1',
                        title: '46 | SSD硬盘（上）：如何完成性能优化的KPI？',
                        src:
                            '深入浅出计算机组成原理/html/__117144__46 _ SSD硬盘（上）：如何完成性能优化的KPI？.html',
                        audio: ''
                    },
                    {
                        id: 'eoujp7e5ls3',
                        title: '47 | SSD硬盘（下）：如何完成性能优化的KPI？',
                        src:
                            '深入浅出计算机组成原理/html/__118191__47 _ SSD硬盘（下）：如何完成性能优化的KPI？.html',
                        audio: ''
                    },
                    {
                        id: 'r5yl8x3bsxw',
                        title: '48 | DMA：为什么Kafka这么快？',
                        src:
                            '深入浅出计算机组成原理/html/__118657__48 _ DMA：为什么Kafka这么快？.html',
                        audio: ''
                    },
                    {
                        id: 'd59s3gu2lqj',
                        title: '49 | 数据完整性（上）：硬件坏了怎么办？',
                        src:
                            '深入浅出计算机组成原理/html/__119901__49 _ 数据完整性（上）：硬件坏了怎么办？.html',
                        audio: ''
                    },
                    {
                        id: '36jgwvg477x',
                        title: '50 | 数据完整性（下）：如何还原犯罪现场？',
                        src:
                            '深入浅出计算机组成原理/html/__123407__50 _ 数据完整性（下）：如何还原犯罪现场？.html',
                        audio: ''
                    },
                    {
                        id: '5kv9abxd6vd',
                        title:
                            '51 | 分布式计算：如果所有人的大脑都联网会怎样？',
                        src:
                            '深入浅出计算机组成原理/html/__128197__51 _ 分布式计算：如果所有人的大脑都联网会怎样？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '0pypnqp7un0',
                title: '应用篇',
                subList: [
                    {
                        id: 'zj7207tvpxx',
                        title:
                            '52 | 设计大型DMP系统（上）：MongoDB并不是什么灵丹妙药',
                        src:
                            '深入浅出计算机组成原理/html/__130507__52 _ 设计大型DMP系统（上）：MongoDB并不是什么灵丹妙药.html',
                        audio: ''
                    },
                    {
                        id: 'k1a1jt3ta9k',
                        title: '53 | 设计大型DMP系统（下）：SSD拯救了所有的DBA',
                        src:
                            '深入浅出计算机组成原理/html/__131720__53 _ 设计大型DMP系统（下）：SSD拯救了所有的DBA.html',
                        audio: ''
                    },
                    {
                        id: '8buze8r48oi',
                        title:
                            '54 | 理解Disruptor（上）：带你体会CPU高速缓存的风驰电掣',
                        src:
                            '深入浅出计算机组成原理/html/__132477__54 _ 理解Disruptor（上）：带你体会CPU高速缓存的风驰电掣.html',
                        audio: ''
                    },
                    {
                        id: 'hdn65wyupmw',
                        title:
                            '55 | 理解Disruptor（下）：不需要换挡和踩刹车的CPU，有多快？',
                        src:
                            '深入浅出计算机组成原理/html/__134020__55 _ 理解Disruptor（下）：不需要换挡和踩刹车的CPU，有多快？.html',
                        audio: ''
                    },
                    {
                        id: 'wvpr46q0r7v',
                        title: '结束语 | 知也无涯，愿你也享受发现的乐趣',
                        src:
                            '深入浅出计算机组成原理/html/__134999__结束语 _ 知也无涯，愿你也享受发现的乐趣.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'xltfnw6m2ct',
                title: '答疑与加餐',
                subList: [
                    {
                        id: '5a669gst64i',
                        title: '特别加餐 | 我在2019年F8大会的两日见闻录',
                        src:
                            '深入浅出计算机组成原理/html/__93720__特别加餐 _ 我在2019年F8大会的两日见闻录.html',
                        audio: ''
                    },
                    {
                        id: '34mmtpr3nu4',
                        title:
                            'FAQ第一期 | 学与不学，知识就在那里，不如就先学好了',
                        src:
                            '深入浅出计算机组成原理/html/__111447__FAQ第一期 _ 学与不学，知识就在那里，不如就先学好了.html',
                        audio: ''
                    },
                    {
                        id: 'vzzhjnisaar',
                        title:
                            '用户故事 | 赵文海：怕什么真理无穷，进一寸有一寸的欢喜',
                        src:
                            '深入浅出计算机组成原理/html/__118482__用户故事 _ 赵文海：怕什么真理无穷，进一寸有一寸的欢喜.html',
                        audio: ''
                    },
                    {
                        id: 'ww57ogy2oi8',
                        title: 'FAQ第二期 | 世界上第一个编程语言是怎么来的？',
                        src:
                            '深入浅出计算机组成原理/html/__120012__FAQ第二期 _ 世界上第一个编程语言是怎么来的？.html',
                        audio: ''
                    },
                    {
                        id: 'okgocem221m',
                        title: '特别加餐 | 我的一天怎么过？',
                        src:
                            '深入浅出计算机组成原理/html/__129197__特别加餐 _ 我的一天怎么过？.html',
                        audio: ''
                    }
                ]
            }
        ]
    },
    //数据结构与算法之美
    {
        title: '数据结构与算法之美',
        id: 'fe99gzh24zw',
        type: 'cs',
        cid: '100017301',
        subTitle: '为工程师量身打造的数据结构与算法私教课',
        authorName: '王争',
        authorInfo: '前Google工程师',
        contents: [
            {
                id: 'lqpfqybk2xo',
                title: '开篇词',
                subList: [
                    {
                        id: 'fc8in2resba',
                        title: '开篇词-从今天起，跨过“数据结构与算法”这道坎',
                        src:
                            './数据结构与算法之美/html/开篇词-从今天起，跨过“数据结构与算法”这道坎.html'
                    }
                ]
            },
            {
                id: 'cnitz0qgj7j',
                title: '入门篇',
                subList: [
                    {
                        id: 'fx6mf9nkjx5',
                        title: '01-为什么要学习数据结构和算法',
                        src:
                            './数据结构与算法之美/html/01-为什么要学习数据结构和算法.html'
                    },
                    {
                        id: 'j3od0ztsggn',
                        title: '02-如何抓住重点，系统高效地学习数据结构与算法',
                        src:
                            './数据结构与算法之美/html/02-如何抓住重点，系统高效地学习数据结构与算法.html'
                    },
                    {
                        id: 'bjvtluuzeyq',
                        title:
                            '03-复杂度分析（上）：如何分析、统计算法的执行效率和资源消耗',
                        src:
                            './数据结构与算法之美/html/03-复杂度分析（上）：如何分析、统计算法的执行效率和资源消耗.html'
                    },
                    {
                        id: '241j62whpt0',
                        title:
                            '04-复杂度分析（下）：浅析最好、最坏、平均、均摊时间复杂度',
                        src:
                            './数据结构与算法之美/html/04-复杂度分析（下）：浅析最好、最坏、平均、均摊时间复杂度.html'
                    }
                ]
            },
            {
                id: '7bi3xjwchj5',
                title: '基础篇',
                subList: [
                    {
                        id: '5ktcuiq6mw6',
                        title: '05-数组：为什么很多编程语言中数组都从0开始编号',
                        src:
                            './数据结构与算法之美/html/05-数组：为什么很多编程语言中数组都从0开始编号.html'
                    },
                    {
                        id: 'jqmiq86jfuv',
                        title: '06-链表（上）：如何实现LRU缓存淘汰算法?',
                        src:
                            './数据结构与算法之美/html/06-链表（上）：如何实现LRU缓存淘汰算法.html'
                    },
                    {
                        id: 'nn15levw2vf',
                        title: '07-链表（下）：如何轻松写出正确的链表代码',
                        src:
                            './数据结构与算法之美/html/07-链表（下）：如何轻松写出正确的链表代码.html'
                    },
                    {
                        id: 'm3431q3yx4p',
                        title: '08-栈：如何实现浏览器的前进和后退功能',
                        src:
                            './数据结构与算法之美/html/08-栈：如何实现浏览器的前进和后退功能.html'
                    },
                    {
                        id: 'tdhe2bqi9yj',
                        title: '09-队列：队列在线程池等有限资源池中的应用',
                        src:
                            './数据结构与算法之美/html/09-队列：队列在线程池等有限资源池中的应用.html'
                    },
                    {
                        id: '1u3efwoofpc',
                        title: '10-递归：如何用三行代码找到“最终推荐人”',
                        src:
                            './数据结构与算法之美/html/10-递归：如何用三行代码找到“最终推荐人”.html'
                    },
                    {
                        id: 'djenllgfzk4',
                        title:
                            '11-排序（上）：为什么插入排序比冒泡排序更受欢迎',
                        src:
                            './数据结构与算法之美/html/11-排序（上）：为什么插入排序比冒泡排序更受欢迎.html'
                    },
                    {
                        id: 'rfgqvxh8x6g',
                        title:
                            '12-排序（下）：如何用快排思想在O(n)内查找第K大元素',
                        src:
                            './数据结构与算法之美/html/12-排序（下）：如何用快排思想在O(n)内查找第K大元素.html'
                    },
                    {
                        id: 'yjz95tdp9u7',
                        title: '13-线性排序：如何根据年龄给100万用户数据排序',
                        src:
                            './数据结构与算法之美/html/13-线性排序：如何根据年龄给100万用户数据排序.html'
                    },
                    {
                        id: '1jvjqmxcryy',
                        title:
                            '14-排序优化：如何实现一个通用的、高性能的排序函数',
                        src:
                            './数据结构与算法之美/html/14-排序优化：如何实现一个通用的、高性能的排序函数.html'
                    },
                    {
                        id: 'ncc1nq6mwp9',
                        title:
                            '15-二分查找（上）：如何用最省内存的方式实现快速查找功能',
                        src:
                            './数据结构与算法之美/html/15-二分查找（上）：如何用最省内存的方式实现快速查找功能.html'
                    },
                    {
                        id: 'ewm4qyqg4zk',
                        title:
                            '16-二分查找（下）：如何快速定位IP对应的省份地址',
                        src:
                            './数据结构与算法之美/html/16-二分查找（下）：如何快速定位IP对应的省份地址.html'
                    },
                    {
                        id: 'ma0947us3xh',
                        title: '17-跳表：为什么Redis一定要用跳表来实现有序集合',
                        src:
                            './数据结构与算法之美/html/17-跳表：为什么Redis一定要用跳表来实现有序集合.html'
                    },
                    {
                        id: 'umyhraz7xt1',
                        title:
                            '18-散列表（上）：Word文档中的单词拼写检查功能是如何实现的',
                        src:
                            './数据结构与算法之美/html/18-散列表（上）：Word文档中的单词拼写检查功能是如何实现的.html'
                    },
                    {
                        id: '3g6rujcucsp',
                        title:
                            '19-散列表（中）：如何打造一个工业级水平的散列表',
                        src:
                            './数据结构与算法之美/html/19-散列表（中）：如何打造一个工业级水平的散列表.html'
                    },
                    {
                        id: '5johh7fyzzu',
                        title:
                            '20-散列表（下）：为什么散列表和链表经常会一起使用',
                        src:
                            './数据结构与算法之美/html/20-散列表（下）：为什么散列表和链表经常会一起使用.html'
                    },
                    {
                        id: 'jnp77g1hsh9',
                        title:
                            '21-哈希算法（上）：如何防止数据库中的用户信息被脱库',
                        src:
                            './数据结构与算法之美/html/21-哈希算法（上）：如何防止数据库中的用户信息被脱库.html'
                    },
                    {
                        id: 'sn3kwuocgk9',
                        title:
                            '22-哈希算法（下）：哈希算法在分布式系统中有哪些应用',
                        src:
                            './数据结构与算法之美/html/22-哈希算法（下）：哈希算法在分布式系统中有哪些应用.html'
                    },
                    {
                        id: '81clhzsmpcn',
                        title:
                            '23-二叉树基础（上）：什么样的二叉树适合用数组来存储',
                        src:
                            './数据结构与算法之美/html/23-二叉树基础（上）：什么样的二叉树适合用数组来存储.html'
                    },
                    {
                        id: 'eva8z1ccjzx',
                        title:
                            '24-二叉树基础（下）：有了如此高效的散列表，为什么还需要二叉树',
                        src:
                            './数据结构与算法之美/html/24-二叉树基础（下）：有了如此高效的散列表，为什么还需要二叉树.html'
                    },
                    {
                        id: '07ft6twpicf',
                        title:
                            '25-红黑树（上）：为什么工程中都用红黑树这种二叉树',
                        src:
                            './数据结构与算法之美/html/25-红黑树（上）：为什么工程中都用红黑树这种二叉树.html'
                    },
                    {
                        id: 'dqgx0m1r3mk',
                        title:
                            '26-红黑树（下）：掌握这些技巧，你也可以实现一个红黑树',
                        src:
                            './数据结构与算法之美/html/26-红黑树（下）：掌握这些技巧，你也可以实现一个红黑树.html'
                    },
                    {
                        id: 'qcp0l12bv7y',
                        title:
                            '27-递归树：如何借助树来求解递归算法的时间复杂度',
                        src:
                            './数据结构与算法之美/html/27-递归树：如何借助树来求解递归算法的时间复杂度.html'
                    },
                    {
                        id: 'wv6n9n7wcwo',
                        title: '28-堆和堆排序：为什么说堆排序没有快速排序快',
                        src:
                            './数据结构与算法之美/html/28-堆和堆排序：为什么说堆排序没有快速排序快.html'
                    },
                    {
                        id: '9ye6uows72b',
                        title:
                            '29-堆的应用：如何快速获取到Top10最热门的搜索关键词',
                        src:
                            './数据结构与算法之美/html/29-堆的应用：如何快速获取到Top10最热门的搜索关键词.html'
                    },
                    {
                        id: 'cyfqbnvhoje',
                        title:
                            '30-图的表示：如何存储微博、微信等社交网络中的好友关系',
                        src:
                            './数据结构与算法之美/html/30-图的表示：如何存储微博、微信等社交网络中的好友关系.html'
                    },
                    {
                        id: '631usvgm5uq',
                        title:
                            '31-深度和广度优先搜索：如何找出社交网络中的三度好友关系',
                        src:
                            './数据结构与算法之美/html/31-深度和广度优先搜索：如何找出社交网络中的三度好友关系.html'
                    },
                    {
                        id: 'dv7boab2pia',
                        title:
                            '32-字符串匹配基础（上）：如何借助哈希算法实现高效字符串匹配',
                        src:
                            './数据结构与算法之美/html/32-字符串匹配基础（上）：如何借助哈希算法实现高效字符串匹配.html'
                    },
                    {
                        id: 'moceebsrhm4',
                        title:
                            '33-字符串匹配基础（中）：如何实现文本编辑器中的查找功能',
                        src:
                            './数据结构与算法之美/html/33-字符串匹配基础（中）：如何实现文本编辑器中的查找功能.html'
                    },
                    {
                        id: '4yc79cdnfcl',
                        title:
                            '34-字符串匹配基础（下）：如何借助BM算法轻松理解KMP算法',
                        src:
                            './数据结构与算法之美/html/34-字符串匹配基础（下）：如何借助BM算法轻松理解KMP算法.html'
                    },
                    {
                        id: 'aih7fujs19m',
                        title:
                            '35-Trie树：如何实现搜索引擎的搜索关键词提示功能',
                        src:
                            './数据结构与算法之美/html/35-Trie树：如何实现搜索引擎的搜索关键词提示功能.html'
                    },
                    {
                        id: 'y3l0mo7uhm1',
                        title:
                            '36-AC自动机：如何用多模式串匹配实现敏感词过滤功能',
                        src:
                            './数据结构与算法之美/html/36-AC自动机：如何用多模式串匹配实现敏感词过滤功能.html'
                    },
                    {
                        id: 'j39fkvhe46h',
                        title: '37-贪心算法：如何用贪心算法实现Huffman压缩编码',
                        src:
                            './数据结构与算法之美/html/37-贪心算法：如何用贪心算法实现Huffman压缩编码.html'
                    },
                    {
                        id: 'cv594pauod6',
                        title:
                            '38-分治算法：谈一谈大规模计算框架MapReduce中的分治思想',
                        src:
                            './数据结构与算法之美/html/38-分治算法：谈一谈大规模计算框架MapReduce中的分治思想.html'
                    },
                    {
                        id: 'q7noihrr9ma',
                        title:
                            '39-回溯算法：从电影《蝴蝶效应》中学习回溯算法的核心思想',
                        src:
                            './数据结构与算法之美/html/39-回溯算法：从电影《蝴蝶效应》中学习回溯算法的核心思想.html'
                    },
                    {
                        id: 'xhk7jil09au',
                        title:
                            '40-初识动态规划：如何巧妙解决“双十一”购物时的凑单问题',
                        src:
                            './数据结构与算法之美/html/40-初识动态规划：如何巧妙解决“双十一”购物时的凑单问题.html'
                    },
                    {
                        id: 'w9w7u1l10pc',
                        title:
                            '41-动态规划理论：一篇文章带你彻底搞懂最优子结构、无后效性和重复子问题',
                        src:
                            './数据结构与算法之美/html/41-动态规划理论：一篇文章带你彻底搞懂最优子结构、无后效性和重复子问题.html'
                    },
                    {
                        id: 'n702gomekmd',
                        title:
                            '42-动态规划实战：如何实现搜索引擎中的拼写纠错功能',
                        src:
                            './数据结构与算法之美/html/42-动态规划实战：如何实现搜索引擎中的拼写纠错功能.html'
                    }
                ]
            },
            {
                id: 'zruv5o46q5e',
                title: '高级篇',
                subList: [
                    {
                        id: '851u70udzxe',
                        title: '43-拓扑排序：如何确定代码源文件的编译依赖关系',
                        src:
                            './数据结构与算法之美/html/43-拓扑排序：如何确定代码源文件的编译依赖关系.html'
                    },
                    {
                        id: 'gzkce6w1zg1',
                        title:
                            '44-最短路径：地图软件是如何计算出最优出行路径的',
                        src:
                            './数据结构与算法之美/html/44-最短路径：地图软件是如何计算出最优出行路径的.html'
                    },
                    {
                        id: 'yaseqv899ql',
                        title: '45-位图：如何实现网页爬虫中的URL去重功能',
                        src:
                            './数据结构与算法之美/html/45-位图：如何实现网页爬虫中的URL去重功能.html'
                    },
                    {
                        id: 'dokgh93bz91',
                        title:
                            '46-概率统计：如何利用朴素贝叶斯算法过滤垃圾短信',
                        src:
                            './数据结构与算法之美/html/46-概率统计：如何利用朴素贝叶斯算法过滤垃圾短信.html'
                    },
                    {
                        id: '1lbip7n515t',
                        title: '47-向量空间：如何实现一个简单的音乐推荐系统',
                        src:
                            './数据结构与算法之美/html/47-向量空间：如何实现一个简单的音乐推荐系统.html'
                    },
                    {
                        id: '1n9rwgfpmiu',
                        title: '48-B+树：MySQL数据库索引是如何实现的',
                        src:
                            './数据结构与算法之美/html/48-B+树：MySQL数据库索引是如何实现的.html'
                    },
                    {
                        id: '1rlopoz1swj',
                        title: '49-搜索：如何用A*搜索算法实现游戏中的寻路功能',
                        src:
                            './数据结构与算法之美/html/49-搜索：如何用A搜索算法实现游戏中的寻路功能.html'
                    },
                    {
                        id: '0fl7ml67ol1',
                        title: '50-索引：如何在海量数据中快速查找某个数据',
                        src:
                            './数据结构与算法之美/html/50-索引：如何在海量数据中快速查找某个数据.html'
                    },
                    {
                        id: 'gzrsbj1pv4b',
                        title:
                            '51-并行算法：如何利用并行处理提高算法的执行效率',
                        src:
                            './数据结构与算法之美/html/51-并行算法：如何利用并行处理提高算法的执行效率.html'
                    }
                ]
            },
            {
                id: 'znudxe2z6k5',
                title: '实战篇',
                subList: [
                    {
                        id: '3pq1jjkany5',
                        title:
                            '52-算法实战（一）：剖析Redis常用数据类型对应的数据结构',
                        src:
                            './数据结构与算法之美/html/52-算法实战（一）：剖析Redis常用数据类型对应的数据结构.html'
                    },
                    {
                        id: 'wn836lz8mjz',
                        title:
                            '53-算法实战（二）：剖析搜索引擎背后的经典数据结构和算法',
                        src:
                            './数据结构与算法之美/html/53-算法实战（二）：剖析搜索引擎背后的经典数据结构和算法.html'
                    },
                    {
                        id: 'a2zr6yxjes7',
                        title:
                            '54-算法实战（三）：剖析高性能队列Disruptor背后的数据结构和算法',
                        src:
                            './数据结构与算法之美/html/54-算法实战（三）：剖析高性能队列Disruptor背后的数据结构和算法.html'
                    },
                    {
                        id: 'rzdyowuujfk',
                        title:
                            '55-算法实战（四）：剖析微服务接口鉴权限流背后的数据结构和算法',
                        src:
                            './数据结构与算法之美/html/55-算法实战（四）：剖析微服务接口鉴权限流背后的数据结构和算法.html'
                    },
                    {
                        id: 'qveetb1uoat',
                        title:
                            '56-算法实战（五）：如何用学过的数据结构和算法实现一个短网址系统',
                        src:
                            './数据结构与算法之美/html/56-算法实战（五）：如何用学过的数据结构和算法实现一个短网址系统.html'
                    }
                ]
            },
            {
                id: '5avsseddcdx',
                title: '加餐：不定期福利',
                subList: [
                    {
                        id: 'muzih11erz0',
                        title: '不定期福利第一期-数据结构与算法学习书单',
                        src:
                            './数据结构与算法之美/html/不定期福利第一期-数据结构与算法学习书单.html'
                    },
                    {
                        id: 'fwj5kpl2t9g',
                        title:
                            '不定期福利第二期-王争：羁绊前行的，不是肆虐的狂风，而是内心的迷茫',
                        src:
                            './数据结构与算法之美/html/不定期福利第二期-王争：羁绊前行的，不是肆虐的狂风，而是内心的迷茫.html'
                    },
                    {
                        id: 'id9btrlvo6n',
                        title: '不定期福利第三期-测一测你的算法阶段学习成果',
                        src:
                            './数据结构与算法之美/html/不定期福利第三期-测一测你的算法阶段学习成果.html'
                    },
                    {
                        id: 'bvisaoz2vep',
                        title:
                            '不定期福利第四期-刘超：我是怎么学习《数据结构与算法之美》的',
                        src:
                            './数据结构与算法之美/html/不定期福利第四期-刘超：我是怎么学习《数据结构与算法之美》的.html'
                    },
                    {
                        id: 't4r39swjdzo',
                        title:
                            '总结课-在实际开发中，如何权衡选择使用哪种数据结构和算法',
                        src:
                            './数据结构与算法之美/html/总结课-在实际开发中，如何权衡选择使用哪种数据结构和算法.html'
                    },
                    {
                        id: '4issi14ts6u',
                        title: '《数据结构与算法之美》学习指导手册',
                        src: ''
                    }
                ]
            },
            {
                id: 'g29njvt177j',
                title: '加餐：春节7天练',
                subList: [
                    {
                        id: 'ubz5yosby2v',
                        title: '春节7天练-Day1：数组和链表',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day1：数组和链表.html'
                    },
                    {
                        id: 'm2f4g2l5owd',
                        title: '春节7天练-Day2：栈、队列和递归',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day2：栈、队列和递归.html'
                    },
                    {
                        id: 'lyjpfxv1ycx',
                        title: '春节7天练-Day3：排序和二分查找',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day3：排序和二分查找.html'
                    },
                    {
                        id: 'mz7v5er9ptv',
                        title: '春节7天练-Day4：散列表和字符串',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day4：散列表和字符串.html'
                    },
                    {
                        id: 'qhkghp4q7ay',
                        title: '春节7天练-Day5：二叉树和堆',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day5：二叉树和堆.html'
                    },
                    {
                        id: 'jugst50ret3',
                        title: '春节7天练-Day6：图',
                        src: './数据结构与算法之美/html/春节7天练-Day6：图.html'
                    },
                    {
                        id: 'v5vee1o1nb4',
                        title: '春节7天练-Day7：贪心、分治、回溯和动态规划',
                        src:
                            './数据结构与算法之美/html/春节7天练-Day7：贪心、分治、回溯和动态规划.html'
                    }
                ]
            },
            {
                id: 'skq5mtzifcs',
                title: '加餐：用户学习故事',
                subList: [
                    {
                        id: 'vrsgz19pgfh',
                        title: '用户故事-Jerry银银：这一年我的脑海里只有算法',
                        src:
                            './数据结构与算法之美/html/用户故事-Jerry银银：这一年我的脑海里只有算法.html'
                    },
                    {
                        id: 'hzw36n6spho',
                        title:
                            '用户故事-zixuan：站在思维的高处，才有足够的视野和能力欣赏“美”',
                        src:
                            './数据结构与算法之美/html/用户故事-zixuan：站在思维的高处，才有足够的视野和能力欣赏“美”.html'
                    }
                ]
            },
            {
                id: 'x4w6x5uimll',
                title: '结束语',
                subList: [
                    {
                        id: '1wepwuyrj52',
                        title: '结束语-送君千里，终须一别',
                        src:
                            './数据结构与算法之美/html/结束语-送君千里，终须一别.html'
                    },
                    {
                        id: 'cyqspz63035',
                        title: '第2季回归-这一次，我们一起拿下设计模式！',
                        src: ''
                    },
                    {
                        id: '2dsfbgmz10v',
                        title: '结课测试｜这些数据结构与算法，你真的掌握了吗',
                        src: ''
                    }
                ]
            },
            {
                id: 'wwqjmjashrg',
                title: '打卡召集令',
                subList: [
                    {
                        id: 'nbv0zrdq6tr',
                        title: '打卡召集令-60天攻克数据结构与算法',
                        src: ''
                    },
                    {
                        id: '299enhm7aj1',
                        title: '打卡召集令-第一阶段知识总结',
                        src: ''
                    },
                    {
                        id: 'ktlqvjs2wca',
                        title: '打卡召集令-第二阶段知识总结',
                        src: ''
                    },
                    {
                        id: 'f2zhxi1eamn',
                        title: '打卡召集令-第三阶段知识总结',
                        src: ''
                    },
                    {
                        id: 'd0xi6q0j165',
                        title: '打卡召集令-第四阶段知识总结',
                        src: ''
                    }
                ]
            }
        ]
    },
    //动态规划面试宝典
    {
        id: 'sgtavymkcfu',
        type: 'cs',
        cid: '347',
        title: '动态规划面试宝典',
        subTitle: '学好动态规划，面试晋升都不怕',
        authorName: '卢誉声',
        authorInfo: 'Autodesk 资深工程师',
        contents: [
            {
                id: '2yl3cilqe9f',
                title: '课前必读',
                subList: [
                    {
                        id: 'egatxs6esvk',
                        title: '开篇词｜为什么大厂都爱考动态规划？',
                        src:
                            '动态规划面试宝典/html/__284937__开篇词｜为什么大厂都爱考动态规划？.html',
                        audio: ''
                    },
                    {
                        id: 'la8mhj64h33',
                        title:
                            '导读｜动态规划问题纷繁复杂，如何系统学习和掌握它？',
                        src:
                            '动态规划面试宝典/html/__285025__导读｜动态规划问题纷繁复杂，如何系统学习和掌握它？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'gu7xz1r82ou',
                title: '初识动态规划',
                subList: [
                    {
                        id: '1v13ld6a4su',
                        title: '01 | 硬币找零问题：从贪心算法说起',
                        src:
                            '动态规划面试宝典/html/__285230__01 _ 硬币找零问题：从贪心算法说起.html',
                        audio: ''
                    },
                    {
                        id: '3u0uf3fi85u',
                        title: '02 | 暴力递归：当贪心失效了怎么办？',
                        src:
                            '动态规划面试宝典/html/__285888__02 _ 暴力递归：当贪心失效了怎么办？.html',
                        audio: ''
                    },
                    {
                        id: 'fco2x78c9uk',
                        title: '03 | 备忘录：如何避免递归中的重复计算？',
                        src:
                            '动态规划面试宝典/html/__287199__03 _ 备忘录：如何避免递归中的重复计算？.html',
                        audio: ''
                    },
                    {
                        id: 'jnrvxxr31u0',
                        title: '04 | 动态规划：完美解决硬币找零',
                        src:
                            '动态规划面试宝典/html/__287406__04 _ 动态规划：完美解决硬币找零.html',
                        audio: ''
                    },
                    {
                        id: 'egpqv5s3ry8',
                        title:
                            '05｜面试即正义第一期：什么样的问题应该使用动态规划？',
                        src:
                            '动态规划面试宝典/html/__289310__05｜面试即正义第一期：什么样的问题应该使用动态规划？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'okl0z9co6c3',
                title: '动态规划的套路',
                subList: [
                    {
                        id: 'dulgdrifdkx',
                        title: '06 | 0-1背包：动态规划的Hello World',
                        src:
                            '动态规划面试宝典/html/__290092__06 _ 0-1背包：动态规划的Hello World.html',
                        audio: ''
                    },
                    {
                        id: 'u67xktqpkim',
                        title: '07｜完全背包：深入理解背包问题',
                        src:
                            '动态规划面试宝典/html/__291638__07｜完全背包：深入理解背包问题.html',
                        audio: ''
                    },
                    {
                        id: 'p615r6wh1o8',
                        title:
                            '08｜子数组问题：从解决动归问题套路到实践解题思路',
                        src:
                            '动态规划面试宝典/html/__292667__08｜子数组问题：从解决动归问题套路到实践解题思路.html',
                        audio: ''
                    },
                    {
                        id: 'hqumyunxyrz',
                        title: '09｜子序列问题：详解重要的一大类动态规划问题',
                        src:
                            '动态规划面试宝典/html/__293232__09｜子序列问题：详解重要的一大类动态规划问题.html',
                        audio: ''
                    },
                    {
                        id: 'xr81qwdj3jv',
                        title: '10｜面试即正义第二期：常见的动态规划面试题串烧',
                        src:
                            '动态规划面试宝典/html/__293536__10｜面试即正义第二期：常见的动态规划面试题串烧.html',
                        audio: ''
                    },
                    {
                        id: 'obngiwrwedd',
                        title: '加餐｜买卖股票：常见且必考的动态规划面试题',
                        src:
                            '动态规划面试宝典/html/__293557__加餐｜买卖股票：常见且必考的动态规划面试题.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '77u8en0k9je',
                title: '举一反三突破套路',
                subList: [
                    {
                        id: 'c8wpfx9jdlg',
                        title: '11｜动态规划新问题1：攻破最长递增子序列问题',
                        src:
                            '动态规划面试宝典/html/__294300__11｜动态规划新问题1：攻破最长递增子序列问题.html',
                        audio: ''
                    },
                    {
                        id: 'uf500wyz4he',
                        title: '12｜动态规划新问题2：攻破最大子数组问题',
                        src:
                            '动态规划面试宝典/html/__295396__12｜动态规划新问题2：攻破最大子数组问题.html',
                        audio: ''
                    },
                    {
                        id: 'arfnsjpnwe0',
                        title:
                            '13｜动态规划算法设计的关键：最优子结构与状态依赖',
                        src:
                            '动态规划面试宝典/html/__295952__13｜动态规划算法设计的关键：最优子结构与状态依赖.html',
                        audio: ''
                    },
                    {
                        id: 'j27d5n7vpxa',
                        title: '14｜面试即正义第三期：刷题指南，熟能生巧',
                        src:
                            '动态规划面试宝典/html/__296625__14｜面试即正义第三期：刷题指南，熟能生巧.html',
                        audio: ''
                    },
                    {
                        id: 'k1wfzl67n01',
                        title: '15｜课程回顾与总结（上）',
                        src:
                            '动态规划面试宝典/html/__297230__15｜课程回顾与总结（上）.html',
                        audio: ''
                    },
                    {
                        id: 'txyw2h3oogf',
                        title: '16｜课程回顾与总结（下）',
                        src:
                            '动态规划面试宝典/html/__297232__16｜课程回顾与总结（下）.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'zx7cshylym5',
                title: '结束语',
                subList: [
                    {
                        id: 'z81akb06xmv',
                        title: '结束语｜在我家的后院养长颈鹿',
                        src:
                            '动态规划面试宝典/html/__299061__结束语｜在我家的后院养长颈鹿.html',
                        audio: ''
                    },
                    {
                        id: 'z8i0t592g6m',
                        title: '有奖征集倒计时3天！你填写毕业问卷了吗？',
                        src:
                            '动态规划面试宝典/html/__305043__有奖征集倒计时3天！你填写毕业问卷了吗？.html',
                        audio: ''
                    },
                    {
                        id: 'veap487yga7',
                        title: '结课问卷获奖用户名单',
                        src:
                            '动态规划面试宝典/html/__309762__结课问卷获奖用户名单.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '0xhawk8sh5a',
                title: '期末测试',
                subList: [
                    {
                        id: 'wfax8kyc7x9',
                        title: '期末测试｜有关动态规划，你掌握了多少呢？',
                        src:
                            '动态规划面试宝典/html/__299068__期末测试｜有关动态规划，你掌握了多少呢？.html',
                        audio: ''
                    }
                ]
            }
        ]
    },
    //趣谈Linux操作系统
    {
        id: '2hb3c13cmva',
        type: 'cs',
        cid: '100024701',
        title: '趣谈Linux操作系统',
        subTitle: '像故事一样的操作系统入门课',
        authorName: '刘超',
        authorInfo: '网易杭州研究院云计算技术部首席架构师',
        contents: [
            {
                id: 's3acll2li7f',
                title: '入门准备篇',
                subList: [
                    {
                        id: '5awsdtzzbdn',
                        title: '开篇词 | 为什么要学习Linux操作系统？',
                        src:
                            './趣谈Linux操作系统/html/开篇词为什么要学习Linux操作系统.html',
                        audio:
                            './趣谈Linux操作系统/audio/开篇词为什么要学习Linux操作系统.mp3'
                    },
                    {
                        id: 'qu7x9uthkaf',
                        title: '01 | 入学测验：你究竟对Linux操作系统了解多少？',
                        src:
                            './趣谈Linux操作系统/html/01入学测验你究竟对Linux操作系统了解多少.html',
                        audio:
                            './趣谈Linux操作系统/audio/01入学测验你究竟对Linux操作系统了解多少.mp3'
                    },
                    {
                        id: '8hifj9zhca2',
                        title:
                            '02 | 学习路径：爬过这六个陡坡，你就能对Linux了如指掌',
                        src:
                            './趣谈Linux操作系统/html/02学习路径爬过这六个陡坡你就能对Linux了如指掌.html',
                        audio:
                            './趣谈Linux操作系统/audio/02学习路径爬过这六个陡坡你就能对Linux了如指掌.mp3'
                    }
                ]
            },
            {
                id: 'l1wre0evmbx',
                title: '核心原理篇：第一部分Linux操作系统综述',
                subList: [
                    {
                        id: '88xzd183mr7',
                        title:
                            '03 | 你可以把Linux内核当成一家软件外包公司的老板',
                        src:
                            './趣谈Linux操作系统/html/03你可以把Linux内核当成一家软件外包公司的老板.html',
                        audio:
                            './趣谈Linux操作系统/audio/03你可以把Linux内核当成一家软件外包公司的老板.mp3'
                    },
                    {
                        id: 'o01g5bm6ii1',
                        title:
                            '04 | 快速上手几个Linux命令：每家公司都有自己的黑话',
                        src:
                            './趣谈Linux操作系统/html/04快速上手几个Linux命令每家公司都有自己的黑话.html',
                        audio:
                            './趣谈Linux操作系统/audio/04快速上手几个Linux命令每家公司都有自己的黑话.mp3'
                    },
                    {
                        id: 'hk36hjy5bth',
                        title:
                            '05 | 学会几个系统调用：咱们公司能接哪些类型的项目？',
                        src:
                            './趣谈Linux操作系统/html/05学会几个系统调用咱们公司能接哪些类型的项目.html',
                        audio:
                            './趣谈Linux操作系统/audio/05学会几个系统调用咱们公司能接哪些类型的项目.mp3'
                    }
                ]
            },
            {
                id: '6d5cv4tf7z0',
                title: '核心原理篇：第二部分系统初始化',
                subList: [
                    {
                        id: 'fe7svy5ew2s',
                        title:
                            '06 | x86架构：有了开放的架构，才能打造开放的营商环境',
                        src:
                            './趣谈Linux操作系统/html/06x86架构有了开放的架构才能打造开放的营商环境.html',
                        audio:
                            './趣谈Linux操作系统/audio/06x86架构有了开放的架构才能打造开放的营商环境.mp3'
                    },
                    {
                        id: '94aqkwa4kj9',
                        title:
                            '07 | 从BIOS到bootloader：创业伊始，有活儿老板自己上',
                        src:
                            './趣谈Linux操作系统/html/07从BIOS到bootloader创业伊始有活儿老板自己上.html',
                        audio:
                            './趣谈Linux操作系统/audio/07从BIOS到bootloader创业伊始有活儿老板自己上.mp3'
                    },
                    {
                        id: 'f29u2z41lhn',
                        title: '08 | 内核初始化：生意做大了就得成立公司',
                        src:
                            './趣谈Linux操作系统/html/08内核初始化生意做大了就得成立公司.html',
                        audio:
                            './趣谈Linux操作系统/audio/08内核初始化生意做大了就得成立公司.mp3'
                    },
                    {
                        id: 'a4un1buovvc',
                        title: '09 | 系统调用：公司成立好了就要开始接项目',
                        src:
                            './趣谈Linux操作系统/html/09系统调用公司成立好了就要开始接项目.html',
                        audio:
                            './趣谈Linux操作系统/audio/09系统调用公司成立好了就要开始接项目.mp3'
                    }
                ]
            },
            {
                id: 'hd9gl5kbuv1',
                title: '核心原理篇：第三部分进程管理',
                subList: [
                    {
                        id: 'snm75h4wzqb',
                        title: '10 | 进程：公司接这么多项目，如何管？',
                        src:
                            './趣谈Linux操作系统/html/10进程公司接这么多项目如何管.html',
                        audio:
                            './趣谈Linux操作系统/audio/10进程公司接这么多项目如何管.mp3'
                    },
                    {
                        id: 'kkdsrees4m6',
                        title: '11 | 线程：如何让复杂的项目并行执行？',
                        src:
                            './趣谈Linux操作系统/html/11线程如何让复杂的项目并行执行.html',
                        audio:
                            './趣谈Linux操作系统/audio/11线程如何让复杂的项目并行执行.mp3'
                    },
                    {
                        id: 'bpkgmj6vghh',
                        title:
                            '12 | 进程数据结构（上）：项目多了就需要项目管理系统',
                        src:
                            './趣谈Linux操作系统/html/12进程数据结构上项目多了就需要项目管理系统.html',
                        audio:
                            './趣谈Linux操作系统/audio/12进程数据结构上项目多了就需要项目管理系统.mp3'
                    },
                    {
                        id: 'i4jkizoo7qz',
                        title:
                            '13 | 进程数据结构（中）：项目多了就需要项目管理系统',
                        src:
                            './趣谈Linux操作系统/html/13进程数据结构中项目多了就需要项目管理系统.html',
                        audio:
                            './趣谈Linux操作系统/audio/13进程数据结构中项目多了就需要项目管理系统.mp3'
                    },
                    {
                        id: 'qskdh6yib69',
                        title:
                            '14 | 进程数据结构（下）：项目多了就需要项目管理系统',
                        src:
                            './趣谈Linux操作系统/html/14进程数据结构下项目多了就需要项目管理系统.html',
                        audio:
                            './趣谈Linux操作系统/audio/14进程数据结构下项目多了就需要项目管理系统.mp3'
                    },
                    {
                        id: '3d3wo2dlyq1',
                        title: '15 | 调度（上）：如何制定项目管理流程？',
                        src:
                            './趣谈Linux操作系统/html/15调度上如何制定项目管理流程.html',
                        audio:
                            './趣谈Linux操作系统/audio/15调度上如何制定项目管理流程.mp3'
                    },
                    {
                        id: 'l8svhiu4drd',
                        title: '16 | 调度（中）：主动调度是如何发生的？',
                        src:
                            './趣谈Linux操作系统/html/16调度中主动调度是如何发生的.html',
                        audio:
                            './趣谈Linux操作系统/audio/16调度中主动调度是如何发生的.mp3'
                    },
                    {
                        id: 'nazr9dvsrla',
                        title: '17 | 调度（下）：抢占式调度是如何发生的？',
                        src:
                            './趣谈Linux操作系统/html/17调度下抢占式调度是如何发生的.html',
                        audio:
                            './趣谈Linux操作系统/audio/17调度下抢占式调度是如何发生的.mp3'
                    },
                    {
                        id: 'zli4ngb5enr',
                        title: '18 | 进程的创建：如何发起一个新项目？',
                        src:
                            './趣谈Linux操作系统/html/18进程的创建如何发起一个新项目.html',
                        audio:
                            './趣谈Linux操作系统/audio/18进程的创建如何发起一个新项目.mp3'
                    },
                    {
                        id: '1cey0svaiki',
                        title: '19 | 线程的创建：如何执行一个新子项目？',
                        src:
                            './趣谈Linux操作系统/html/19线程的创建如何执行一个新子项目.html',
                        audio:
                            './趣谈Linux操作系统/audio/19线程的创建如何执行一个新子项目.mp3'
                    }
                ]
            },
            {
                id: 'xm0a0453cci',
                title: '核心原理篇：第四部分内存管理',
                subList: [
                    {
                        id: '1hk1tae3t8p',
                        title:
                            '20 | 内存管理（上）：为客户保密，规划进程内存空间布局',
                        src:
                            './趣谈Linux操作系统/html/20内存管理上为客户保密规划进程内存空间布局.html',
                        audio:
                            './趣谈Linux操作系统/audio/20内存管理上为客户保密规划进程内存空间布局.mp3'
                    },
                    {
                        id: 'jq8zisr7oo9',
                        title:
                            '21 | 内存管理（下）：为客户保密，项目组独享会议室封闭开发',
                        src:
                            './趣谈Linux操作系统/html/21内存管理下为客户保密项目组独享会议室封闭开发.html',
                        audio:
                            './趣谈Linux操作系统/audio/21内存管理下为客户保密项目组独享会议室封闭开发.mp3'
                    },
                    {
                        id: '4ooyqqrkktk',
                        title: '22 | 进程空间管理：项目组还可以自行布置会议室',
                        src:
                            './趣谈Linux操作系统/html/22进程空间管理项目组还可以自行布置会议室.html',
                        audio:
                            './趣谈Linux操作系统/audio/22进程空间管理项目组还可以自行布置会议室.mp3'
                    },
                    {
                        id: '34jvxkdx1jw',
                        title:
                            '23 | 物理内存管理（上）：会议室管理员如何分配会议室？',
                        src:
                            './趣谈Linux操作系统/html/23物理内存管理上会议室管理员如何分配会议室.html',
                        audio:
                            './趣谈Linux操作系统/audio/23物理内存管理上会议室管理员如何分配会议室.mp3'
                    },
                    {
                        id: 'vzu218kjdk3',
                        title:
                            '24 | 物理内存管理（下）：会议室管理员如何分配会议室？',
                        src:
                            './趣谈Linux操作系统/html/24物理内存管理下会议室管理员如何分配会议室.html',
                        audio:
                            './趣谈Linux操作系统/audio/24物理内存管理下会议室管理员如何分配会议室.mp3'
                    },
                    {
                        id: 'vdx8x4klvuk',
                        title: '25 | 用户态内存映射：如何找到正确的会议室？',
                        src:
                            './趣谈Linux操作系统/html/25用户态内存映射如何找到正确的会议室.html',
                        audio:
                            './趣谈Linux操作系统/audio/25用户态内存映射如何找到正确的会议室.mp3'
                    },
                    {
                        id: '7c82t93umh1',
                        title: '26 | 内核态内存映射：如何找到正确的会议室？',
                        src:
                            './趣谈Linux操作系统/html/26内核态内存映射如何找到正确的会议室.html',
                        audio:
                            './趣谈Linux操作系统/audio/26内核态内存映射如何找到正确的会议室.mp3'
                    }
                ]
            },
            {
                id: 'gbddm936uja',
                title: '核心原理篇：第五部分文件系统',
                subList: [
                    {
                        id: 'j9cit68c5e8',
                        title:
                            '27 | 文件系统：项目成果要归档，我们就需要档案库',
                        src:
                            './趣谈Linux操作系统/html/27文件系统项目成果要归档我们就需要档案库.html',
                        audio:
                            './趣谈Linux操作系统/audio/27文件系统项目成果要归档我们就需要档案库.mp3'
                    },
                    {
                        id: '9ed256g5afj',
                        title:
                            '28 | 硬盘文件系统：如何最合理地组织档案库的文档？',
                        src:
                            './趣谈Linux操作系统/html/28硬盘文件系统如何最合理地组织档案库的文档.html',
                        audio:
                            './趣谈Linux操作系统/audio/28硬盘文件系统如何最合理地组织档案库的文档.mp3'
                    },
                    {
                        id: 'y9mh45pafk2',
                        title: '29 | 虚拟文件系统：文件多了就需要档案管理系统',
                        src:
                            './趣谈Linux操作系统/html/29虚拟文件系统文件多了就需要档案管理系统.html',
                        audio:
                            './趣谈Linux操作系统/audio/29虚拟文件系统文件多了就需要档案管理系统.mp3'
                    },
                    {
                        id: 'anrdbkrlcrg',
                        title: '30 | 文件缓存：常用文档应该放在触手可得的地方',
                        src:
                            './趣谈Linux操作系统/html/30文件缓存常用文档应该放在触手可得的地方.html',
                        audio:
                            './趣谈Linux操作系统/audio/30文件缓存常用文档应该放在触手可得的地方.mp3'
                    }
                ]
            },
            {
                id: 'ql3wov4wpig',
                title: '核心原理篇：第六部分输入输出系统',
                subList: [
                    {
                        id: 'n3azyv1gc30',
                        title: '31 | 输入与输出：如何建立售前售后生态体系？',
                        src:
                            './趣谈Linux操作系统/html/31输入与输出如何建立售前售后生态体系.html',
                        audio:
                            './趣谈Linux操作系统/audio/31输入与输出如何建立售前售后生态体系.mp3'
                    },
                    {
                        id: '59ytyra7o9k',
                        title: '32 | 字符设备（上）：如何建立直销模式？',
                        src:
                            './趣谈Linux操作系统/html/32字符设备上如何建立直销模式.html',
                        audio:
                            './趣谈Linux操作系统/audio/32字符设备上如何建立直销模式.mp3'
                    },
                    {
                        id: 'qf6g8pt01mu',
                        title: '33 | 字符设备（下）：如何建立直销模式？',
                        src:
                            './趣谈Linux操作系统/html/33字符设备下如何建立直销模式.html',
                        audio:
                            './趣谈Linux操作系统/audio/33字符设备下如何建立直销模式.mp3'
                    },
                    {
                        id: 'g2adkfnjvik',
                        title: '34 | 块设备（上）：如何建立代理商销售模式？',
                        src:
                            './趣谈Linux操作系统/html/34块设备上如何建立代理商销售模式.html',
                        audio:
                            './趣谈Linux操作系统/audio/34块设备上如何建立代理商销售模式.mp3'
                    },
                    {
                        id: '6zt1m96xzfn',
                        title: '35 | 块设备（下）：如何建立代理商销售模式？',
                        src:
                            './趣谈Linux操作系统/html/35块设备下如何建立代理商销售模式.html',
                        audio:
                            './趣谈Linux操作系统/audio/35块设备下如何建立代理商销售模式.mp3'
                    }
                ]
            },
            {
                id: '46kr8f4xjfu',
                title: '核心原理篇：第七部分进程间通信',
                subList: [
                    {
                        id: 'lubbs47b05u',
                        title:
                            '36 | 进程间通信：遇到大项目需要项目组之间的合作才行',
                        src:
                            './趣谈Linux操作系统/html/36进程间通信遇到大项目需要项目组之间的合作才行.html',
                        audio:
                            './趣谈Linux操作系统/audio/36进程间通信遇到大项目需要项目组之间的合作才行.mp3'
                    },
                    {
                        id: 'xfjwrww493c',
                        title:
                            '37 | 信号（上）：项目组A完成了，如何及时通知项目组B？',
                        src:
                            './趣谈Linux操作系统/html/37信号上项目组A完成了如何及时通知项目组B.html',
                        audio:
                            './趣谈Linux操作系统/audio/37信号上项目组A完成了如何及时通知项目组B.mp3'
                    },
                    {
                        id: '62o71rf5t7p',
                        title:
                            '38 | 信号（下）：项目组A完成了，如何及时通知项目组B？',
                        src:
                            './趣谈Linux操作系统/html/38信号下项目组A完成了如何及时通知项目组B.html',
                        audio:
                            './趣谈Linux操作系统/audio/38信号下项目组A完成了如何及时通知项目组B.mp3'
                    },
                    {
                        id: 'glm85tv2m04',
                        title: '39 | 管道：项目组A完成了，如何交接给项目组B？',
                        src:
                            './趣谈Linux操作系统/html/39管道项目组A完成了如何交接给项目组B.html',
                        audio:
                            './趣谈Linux操作系统/audio/39管道项目组A完成了如何交接给项目组B.mp3'
                    },
                    {
                        id: '8mkgr31ex5z',
                        title:
                            '40 | IPC（上）：不同项目组之间抢资源，如何协调？',
                        src:
                            './趣谈Linux操作系统/html/40IPC上不同项目组之间抢资源如何协调.html',
                        audio:
                            './趣谈Linux操作系统/audio/40IPC上不同项目组之间抢资源如何协调.mp3'
                    },
                    {
                        id: 'giygvgt08o5',
                        title:
                            '41 | IPC（中）：不同项目组之间抢资源，如何协调？',
                        src:
                            './趣谈Linux操作系统/html/41IPC中不同项目组之间抢资源如何协调.html',
                        audio:
                            './趣谈Linux操作系统/audio/41IPC中不同项目组之间抢资源如何协调.mp3'
                    },
                    {
                        id: 'jrpgvsupfg9',
                        title:
                            '42 | IPC（下）：不同项目组之间抢资源，如何协调？',
                        src:
                            './趣谈Linux操作系统/html/42IPC下不同项目组之间抢资源如何协调.html',
                        audio:
                            './趣谈Linux操作系统/audio/42IPC下不同项目组之间抢资源如何协调.mp3'
                    }
                ]
            },
            {
                id: 'i2dhobgbgsc',
                title: '核心原理篇：第八部分网络系统',
                subList: [
                    {
                        id: 'odkvdwvk906',
                        title: '43 预习 | Socket通信之网络协议基本原理',
                        src:
                            './趣谈Linux操作系统/html/43·预习Socket通信之网络协议基本原理.html',
                        audio:
                            './趣谈Linux操作系统/audio/43·预习Socket通信之网络协议基本原理.mp3'
                    },
                    {
                        id: '9utbc1hk3d1',
                        title:
                            '43 | Socket通信：遇上特大项目，要学会和其他公司合作',
                        src:
                            './趣谈Linux操作系统/html/43Socket通信遇上特大项目要学会和其他公司合作.html',
                        audio:
                            './趣谈Linux操作系统/audio/43Socket通信遇上特大项目要学会和其他公司合作.mp3'
                    },
                    {
                        id: 'zrvx4785ism',
                        title:
                            '44 | Socket内核数据结构：如何成立特大项目合作部？',
                        src:
                            './趣谈Linux操作系统/html/44Socket内核数据结构如何成立特大项目合作部.html',
                        audio:
                            './趣谈Linux操作系统/audio/44Socket内核数据结构如何成立特大项目合作部.mp3'
                    },
                    {
                        id: 'lsa5pkxhjzr',
                        title:
                            '45 | 发送网络包（上）：如何表达我们想让合作伙伴做什么？',
                        src:
                            './趣谈Linux操作系统/html/45发送网络包上如何表达我们想让合作伙伴做什么.html',
                        audio:
                            './趣谈Linux操作系统/audio/45发送网络包上如何表达我们想让合作伙伴做什么.mp3'
                    },
                    {
                        id: 'cbkgqaw90nl',
                        title:
                            '46 | 发送网络包（下）：如何表达我们想让合作伙伴做什么？',
                        src:
                            './趣谈Linux操作系统/html/46发送网络包下如何表达我们想让合作伙伴做什么.html',
                        audio:
                            './趣谈Linux操作系统/audio/46发送网络包下如何表达我们想让合作伙伴做什么.mp3'
                    },
                    {
                        id: '85ytbuwkby1',
                        title:
                            '47 | 接收网络包（上）：如何搞明白合作伙伴让我们做什么？',
                        src:
                            './趣谈Linux操作系统/html/47接收网络包上如何搞明白合作伙伴让我们做什么.html',
                        audio:
                            './趣谈Linux操作系统/audio/47接收网络包上如何搞明白合作伙伴让我们做什么.mp3'
                    },
                    {
                        id: 'd7qqwtudqba',
                        title:
                            '48 | 接收网络包（下）：如何搞明白合作伙伴让我们做什么？',
                        src:
                            './趣谈Linux操作系统/html/48接收网络包下如何搞明白合作伙伴让我们做什么.html',
                        audio:
                            './趣谈Linux操作系统/audio/48接收网络包下如何搞明白合作伙伴让我们做什么.mp3'
                    }
                ]
            },
            {
                id: 'kblvladftp5',
                title: '核心原理篇：第九部分虚拟化',
                subList: [
                    {
                        id: '0p1bw4xlarc',
                        title: '49 | 虚拟机：如何成立子公司，让公司变集团？',
                        src:
                            './趣谈Linux操作系统/html/49虚拟机如何成立子公司让公司变集团.html',
                        audio:
                            './趣谈Linux操作系统/audio/49虚拟机如何成立子公司让公司变集团.mp3'
                    },
                    {
                        id: 'jxnsr50l3gn',
                        title:
                            '50 | 计算虚拟化之CPU（上）：如何复用集团的人力资源？',
                        src:
                            './趣谈Linux操作系统/html/50计算虚拟化之CPU上如何复用集团的人力资源.html',
                        audio:
                            './趣谈Linux操作系统/audio/50计算虚拟化之CPU上如何复用集团的人力资源.mp3'
                    },
                    {
                        id: '9l8j1wjqtfx',
                        title:
                            '51 | 计算虚拟化之CPU（下）：如何复用集团的人力资源？',
                        src:
                            './趣谈Linux操作系统/html/51计算虚拟化之CPU下如何复用集团的人力资源.html',
                        audio:
                            './趣谈Linux操作系统/audio/51计算虚拟化之CPU下如何复用集团的人力资源.mp3'
                    },
                    {
                        id: 'h8bs2ab4436',
                        title: '52 | 计算虚拟化之内存：如何建立独立的办公室？',
                        src:
                            './趣谈Linux操作系统/html/52计算虚拟化之内存如何建立独立的办公室.html',
                        audio:
                            './趣谈Linux操作系统/audio/52计算虚拟化之内存如何建立独立的办公室.mp3'
                    },
                    {
                        id: 'fma6o2sr4v3',
                        title:
                            '53 | 存储虚拟化（上）：如何建立自己保管的单独档案库？',
                        src:
                            './趣谈Linux操作系统/html/53存储虚拟化上如何建立自己保管的单独档案库.html',
                        audio:
                            './趣谈Linux操作系统/audio/53存储虚拟化上如何建立自己保管的单独档案库.mp3'
                    },
                    {
                        id: 'bear5i9ajd8',
                        title:
                            '54 | 存储虚拟化（下）：如何建立自己保管的单独档案库？',
                        src:
                            './趣谈Linux操作系统/html/54存储虚拟化下如何建立自己保管的单独档案库.html',
                        audio:
                            './趣谈Linux操作系统/audio/54存储虚拟化下如何建立自己保管的单独档案库.mp3'
                    },
                    {
                        id: 'zs3j8cjgjns',
                        title: '55 | 网络虚拟化：如何成立独立的合作部？',
                        src:
                            './趣谈Linux操作系统/html/55网络虚拟化如何成立独立的合作部.html',
                        audio:
                            './趣谈Linux操作系统/audio/55网络虚拟化如何成立独立的合作部.mp3'
                    }
                ]
            },
            {
                id: '9ih01p5osb2',
                title: '核心原理篇：第十部分容器化',
                subList: [
                    {
                        id: 'rwaqthcwrb3',
                        title: '56 | 容器：大公司为保持创新，鼓励内部创业',
                        src:
                            './趣谈Linux操作系统/html/56容器大公司为保持创新鼓励内部创业.html',
                        audio:
                            './趣谈Linux操作系统/audio/56容器大公司为保持创新鼓励内部创业.mp3'
                    },
                    {
                        id: 'daumq3e1l6a',
                        title: '57 | Namespace技术：内部创业公司应该独立运营',
                        src:
                            './趣谈Linux操作系统/html/57Namespace技术内部创业公司应该独立运营.html',
                        audio:
                            './趣谈Linux操作系统/audio/57Namespace技术内部创业公司应该独立运营.mp3'
                    },
                    {
                        id: 'l52lijfnabq',
                        title: '58 | cgroup技术：内部创业公司应该独立核算成本',
                        src: '',
                        audio: ''
                    },
                    {
                        id: 'z1qn1sme7jf',
                        title: '59 | 数据中心操作系统：上市敲钟',
                        src:
                            './趣谈Linux操作系统/html/59数据中心操作系统上市敲钟.html',
                        audio:
                            './趣谈Linux操作系统/audio/59数据中心操作系统上市敲钟.mp3'
                    }
                ]
            },
            {
                id: 'v1n5e80yc2e',
                title: '实战串讲篇',
                subList: [
                    {
                        id: 'yr17s85ta5g',
                        title:
                            '60 | 搭建操作系统实验环境（上）：授人以鱼不如授人以渔',
                        src:
                            './趣谈Linux操作系统/html/60搭建操作系统实验环境上授人以鱼不如授人以渔.html',
                        audio:
                            './趣谈Linux操作系统/audio/60搭建操作系统实验环境上授人以鱼不如授人以渔.mp3'
                    },
                    {
                        id: 'bcjjmba8go8',
                        title:
                            '61 | 搭建操作系统实验环境（下）：授人以鱼不如授人以渔',
                        src:
                            './趣谈Linux操作系统/html/61搭建操作系统实验环境下授人以鱼不如授人以渔.html',
                        audio:
                            './趣谈Linux操作系统/audio/61搭建操作系统实验环境下授人以鱼不如授人以渔.mp3'
                    },
                    {
                        id: 'k5zpiiph9ze',
                        title:
                            '62 | 知识串讲：用一个创业故事串起操作系统原理（一）',
                        src:
                            './趣谈Linux操作系统/html/62知识串讲用一个创业故事串起操作系统原理一.html',
                        audio:
                            './趣谈Linux操作系统/audio/62知识串讲用一个创业故事串起操作系统原理一.mp3'
                    },
                    {
                        id: 'vdt8o5el61t',
                        title:
                            '63 | 知识串讲：用一个创业故事串起操作系统原理（二）',
                        src:
                            './趣谈Linux操作系统/html/63知识串讲用一个创业故事串起操作系统原理二.html',
                        audio:
                            './趣谈Linux操作系统/audio/63知识串讲用一个创业故事串起操作系统原理二.mp3'
                    },
                    {
                        id: 'sapnpf7mbth',
                        title:
                            '64 | 知识串讲：用一个创业故事串起操作系统原理（三）',
                        src:
                            './趣谈Linux操作系统/html/64知识串讲用一个创业故事串起操作系统原理三.html',
                        audio:
                            './趣谈Linux操作系统/audio/64知识串讲用一个创业故事串起操作系统原理三.mp3'
                    },
                    {
                        id: 't4bovn5f545',
                        title:
                            '65 | 知识串讲：用一个创业故事串起操作系统原理（四）',
                        src:
                            './趣谈Linux操作系统/html/65知识串讲用一个创业故事串起操作系统原理四.html',
                        audio:
                            './趣谈Linux操作系统/audio/65知识串讲用一个创业故事串起操作系统原理四.mp3'
                    },
                    {
                        id: 'jzp48uasbc5',
                        title:
                            '66 | 知识串讲：用一个创业故事串起操作系统原理（五）',
                        src:
                            './趣谈Linux操作系统/html/66知识串讲用一个创业故事串起操作系统原理五.html',
                        audio:
                            './趣谈Linux操作系统/audio/66知识串讲用一个创业故事串起操作系统原理五.mp3'
                    },
                    {
                        id: 'ezh25knok8x',
                        title: '期末测试 | 这些操作系统问题，你真的掌握了吗？',
                        src:
                            './趣谈Linux操作系统/html/67期末测试这些操作系统问题你真的掌握了吗.html',
                        audio:
                            './趣谈Linux操作系统/audio/67期末测试这些操作系统问题你真的掌握了吗.mp3'
                    },
                    {
                        id: 'zx02vzd9h2s',
                        title: '结束语 | 永远别轻视任何技术，也永远别轻视自己',
                        src:
                            './趣谈Linux操作系统/html/结束语永远别轻视任何技术也永远别轻视自己.html',
                        audio:
                            './趣谈Linux操作系统/audio/结束语永远别轻视任何技术也永远别轻视自己.mp3'
                    }
                ]
            },
            {
                id: 'r0s0ppm3quh',
                title: '专栏加餐',
                subList: [
                    {
                        id: 'ud9xgywgrpm',
                        title:
                            '学习攻略（一）：学好操作系统，需要掌握哪些前置知识？',
                        src:
                            './趣谈Linux操作系统/html/学习攻略一学好操作系统需要掌握哪些前置知识.html',
                        audio:
                            './趣谈Linux操作系统/audio/学习攻略一学好操作系统需要掌握哪些前置知识.mp3'
                    },
                    {
                        id: 'mbto0926uqv',
                        title: '“趣谈Linux操作系统”食用指南',
                        src: '',
                        audio: ''
                    }
                ]
            },
            {
                id: 'meg0udah00g',
                title: '结课测试',
                subList: []
            }
        ]
    },
    //操作系统
    {
        id: '3tztuk6bhcf',
        type: 'cs',
        cid: '411',
        resource: 'https://gitee.com/lmos/cosmos',
        title: '操作系统实战45讲',
        subTitle: '从0到1，实现自己的操作系统',
        authorName: '彭东',
        authorInfo: '网名 LMOS，Intel 傲腾项目关键开发者',
        contents: [
            {
                id: 'konwl5q93g0',
                title: '开篇词',
                subList: [
                    {
                        id: 'buy0agxlwr2',
                        title: '开篇词 | 为什么要学写一个操作系统？',
                        src:
                            '操作系统实战45讲/html/__372018__开篇词 _ 为什么要学写一个操作系统？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'g723egm1y4w',
                title: '尝尝鲜：从一个Hello到另一个Hello',
                subList: [
                    {
                        id: 'skyj3zcs6fq',
                        title: '01 | 程序的运行过程：从代码到机器运行',
                        src:
                            '操作系统实战45讲/html/__369457__01 _ 程序的运行过程：从代码到机器运行.html',
                        audio: ''
                    },
                    {
                        id: 'f1wxxauavyr',
                        title: '02 | 几行汇编几行C：实现一个最简单的内核',
                        src:
                            '操作系统实战45讲/html/__369502__02 _ 几行汇编几行C：实现一个最简单的内核.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'oki6d3t5w8s',
                title: '心有蓝图：设计',
                subList: [
                    {
                        id: 'jl87f1pqltz',
                        title: '03 | 黑盒之中有什么：内核结构与设计',
                        src:
                            '操作系统实战45讲/html/__372609__03 _ 黑盒之中有什么：内核结构与设计.html',
                        audio: ''
                    },
                    {
                        id: '6w0mg6908qz',
                        title:
                            '04 | 震撼的Linux全景图：业界成熟的内核架构长什么样？',
                        src:
                            '操作系统实战45讲/html/__374474__04 _ 震撼的Linux全景图：业界成熟的内核架构长什么样？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'g2m1wukmkfi',
                title: '程序的基石：硬件',
                subList: [
                    {
                        id: '89e7xedtl88',
                        title: '05 | CPU工作模式：执行程序的三种模式',
                        src:
                            '操作系统实战45讲/html/__375278__05 _ CPU工作模式：执行程序的三种模式.html',
                        audio: ''
                    },
                    {
                        id: 'g8c0ms4qett',
                        title: '06 | 虚幻与真实：程序中的地址如何转换？',
                        src:
                            '操作系统实战45讲/html/__376064__06 _ 虚幻与真实：程序中的地址如何转换？.html',
                        audio: ''
                    },
                    {
                        id: '46uqs5abnk9',
                        title: '07 | Cache与内存：程序放在哪儿？',
                        src:
                            '操作系统实战45讲/html/__376711__07 _ Cache与内存：程序放在哪儿？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '3m1r7sochfg',
                title: '基本法：同步原语',
                subList: [
                    {
                        id: '3g4kft7bzzc',
                        title: '08 | 锁：并发操作中，解决数据同步的四种方法',
                        src:
                            '操作系统实战45讲/html/__377913__08 _ 锁：并发操作中，解决数据同步的四种方法.html',
                        audio: ''
                    },
                    {
                        id: '6cz4mssdusl',
                        title:
                            '09 | 瞧一瞧Linux：Linux的自旋锁和信号量如何实现？',
                        src:
                            '操作系统实战45讲/html/__378870__09 _ 瞧一瞧Linux：Linux的自旋锁和信号量如何实现？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'zaeoh2xlve0',
                title: '夺权：启动初始化',
                subList: [
                    {
                        id: 'r460xpb0qca',
                        title: '10 | 设置工作模式与环境（上）：建立计算机',
                        src:
                            '操作系统实战45讲/html/__379291__10 _ 设置工作模式与环境（上）：建立计算机.html',
                        audio: ''
                    },
                    {
                        id: '8na214hicuk',
                        title: '11 | 设置工作模式与环境（中）：建造二级引导器',
                        src:
                            '操作系统实战45讲/html/__380507__11 _ 设置工作模式与环境（中）：建造二级引导器.html',
                        audio: ''
                    },
                    {
                        id: 'o3yvmtupquf',
                        title: '12 | 设置工作模式与环境（下）：探查和收集信息',
                        src:
                            '操作系统实战45讲/html/__381157__12 _ 设置工作模式与环境（下）：探查和收集信息.html',
                        audio: ''
                    },
                    {
                        id: '6hvwvkgyiud',
                        title: '13 | 第一个C函数：如何实现板级初始化？',
                        src:
                            '操作系统实战45讲/html/__381810__13 _ 第一个C函数：如何实现板级初始化？.html',
                        audio: ''
                    },
                    {
                        id: 'rp3145ivqhu',
                        title: '14 | Linux初始化（上）：GRUB与vmlinuz的结构',
                        src:
                            '操作系统实战45讲/html/__382733__14 _ Linux初始化（上）：GRUB与vmlinuz的结构.html',
                        audio: ''
                    },
                    {
                        id: '9k5twgvn3yr',
                        title: '15 | Linux初始化（下）：从_start到第一个进程',
                        src:
                            '操作系统实战45讲/html/__383611__15 _ Linux初始化（下）：从_start到第一个进程.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '88rrzt8zcnw',
                title: '土地革命：内存',
                subList: [
                    {
                        id: 'ffrqrc5tqyx',
                        title: '16 | 划分土地（上）：如何划分与组织内存？',
                        src:
                            '操作系统实战45讲/html/__384366__16 _ 划分土地（上）：如何划分与组织内存？.html',
                        audio: ''
                    },
                    {
                        id: '6d9o4fxh99k',
                        title: '17 | 划分土地（中）：如何实现内存页面初始化？',
                        src:
                            '操作系统实战45讲/html/__384772__17 _ 划分土地（中）：如何实现内存页面初始化？.html',
                        audio: ''
                    },
                    {
                        id: 'izcywgytmz1',
                        title:
                            '18 | 划分土地（下）：如何实现内存页的分配与释放？',
                        src:
                            '操作系统实战45讲/html/__385628__18 _ 划分土地（下）：如何实现内存页的分配与释放？.html',
                        audio: ''
                    },
                    {
                        id: 'ry5cordtf6c',
                        title: '19 | 土地不能浪费：如何管理内存对象？',
                        src:
                            '操作系统实战45讲/html/__386400__19 _ 土地不能浪费：如何管理内存对象？.html',
                        audio: ''
                    },
                    {
                        id: 'r2dpot9x7sw',
                        title: '20 | 土地需求扩大与保障：如何表示虚拟内存？',
                        src:
                            '操作系统实战45讲/html/__387258__20 _ 土地需求扩大与保障：如何表示虚拟内存？.html',
                        audio: ''
                    },
                    {
                        id: 'yxfooaru6vn',
                        title:
                            '21 | 土地需求扩大与保障：如何分配和释放虚拟内存？',
                        src:
                            '操作系统实战45讲/html/__388167__21 _ 土地需求扩大与保障：如何分配和释放虚拟内存？.html',
                        audio: ''
                    },
                    {
                        id: '6jdppntu31c',
                        title: '22 | 瞧一瞧Linux：伙伴系统如何分配内存？',
                        src:
                            '操作系统实战45讲/html/__389123__22 _ 瞧一瞧Linux：伙伴系统如何分配内存？.html',
                        audio: ''
                    },
                    {
                        id: '8dksrrjctsp',
                        title: '23 | 瞧一瞧Linux：SLAB如何分配内存？',
                        src:
                            '操作系统实战45讲/html/__389880__23 _ 瞧一瞧Linux：SLAB如何分配内存？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '2osfy9mk0kv',
                title: '活动实体：进程',
                subList: [
                    {
                        id: '2if7yf05fg3',
                        title: '24 | 活动的描述：到底什么是进程？',
                        src:
                            '操作系统实战45讲/html/__390674__24 _ 活动的描述：到底什么是进程？.html',
                        audio: ''
                    },
                    {
                        id: 'qtyxtgwreih',
                        title: '25 | 多个活动要安排（上）：多进程如何调度？',
                        src:
                            '操作系统实战45讲/html/__391222__25 _ 多个活动要安排（上）：多进程如何调度？.html',
                        audio: ''
                    },
                    {
                        id: 'o56ioagc6p3',
                        title:
                            '26 | 多个活动要安排（下）：如何实现进程的等待与唤醒机制？',
                        src:
                            '操作系统实战45讲/html/__392198__26 _ 多个活动要安排（下）：如何实现进程的等待与唤醒机制？.html',
                        audio: ''
                    },
                    {
                        id: '0idy4w0adwu',
                        title: '27 | 瞧一瞧Linux：Linux如何实现进程与进程调度?',
                        src:
                            '操作系统实战45讲/html/__393350__27 _ 瞧一瞧Linux：Linux如何实现进程与进程调度_.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'ofd59858afy',
                title: '下属部门：设备I/O',
                subList: [
                    {
                        id: 'a2hh4v1m2ps',
                        title: '28 | 部门分类：如何表示设备类型与设备驱动？',
                        src:
                            '操作系统实战45讲/html/__394084__28 _ 部门分类：如何表示设备类型与设备驱动？.html',
                        audio: ''
                    },
                    {
                        id: 'gk9f69ef1gb',
                        title: '29 | 部门建立：如何在内核中注册设备？',
                        src:
                            '操作系统实战45讲/html/__394875__29 _ 部门建立：如何在内核中注册设备？.html',
                        audio: ''
                    },
                    {
                        id: 'hr4c0ucmvkb',
                        title: '30 | 部门响应：设备如何处理内核I/O包？',
                        src:
                            '操作系统实战45讲/html/__395772__30 _ 部门响应：设备如何处理内核I_O包？.html',
                        audio: ''
                    },
                    {
                        id: '9u7maobm3ub',
                        title: '31 | 瞧一瞧Linux：如何获取所有设备信息？',
                        src:
                            '操作系统实战45讲/html/__396896__31 _ 瞧一瞧Linux：如何获取所有设备信息？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 's76ylwcjweb',
                title: '银行仓库：文件系统',
                subList: [
                    {
                        id: '0s6l25yvdff',
                        title: '32 | 仓库结构：如何组织文件?',
                        src:
                            '操作系统实战45讲/html/__397594__32 _ 仓库结构：如何组织文件_.html',
                        audio: ''
                    },
                    {
                        id: 'rxpg9ua1fwj',
                        title: '33 | 仓库划分：文件系统的格式化操作',
                        src:
                            '操作系统实战45讲/html/__398697__33 _ 仓库划分：文件系统的格式化操作.html',
                        audio: ''
                    },
                    {
                        id: 'e1osmc1zd4f',
                        title: '34 | 仓库管理：如何实现文件的六大基本操作？',
                        src:
                            '操作系统实战45讲/html/__399700__34 _ 仓库管理：如何实现文件的六大基本操作？.html',
                        audio: ''
                    },
                    {
                        id: 'c16jgpbdb0w',
                        title: '35 | 瞧一瞧Linux：虚拟文件系统如何管理文件？',
                        src:
                            '操作系统实战45讲/html/__400424__35 _ 瞧一瞧Linux：虚拟文件系统如何管理文件？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'z3kuinnihv2',
                title: '通信部：网络',
                subList: [
                    {
                        id: '3g1qfvwz3mq',
                        title: '36 | 从URL到网卡：如何全局观察网络数据流动？',
                        src:
                            '操作系统实战45讲/html/__401467__36 _ 从URL到网卡：如何全局观察网络数据流动？.html',
                        audio: ''
                    },
                    {
                        id: '8j3p2705gj5',
                        title: '37 | 从内核到应用：网络数据在内核中如何流转',
                        src:
                            '操作系统实战45讲/html/__402840__37 _ 从内核到应用：网络数据在内核中如何流转.html',
                        audio: ''
                    },
                    {
                        id: 'cb519h0k1gy',
                        title: '38 | 从单排到团战：详解操作系统的宏观网络架构',
                        src:
                            '操作系统实战45讲/html/__404013__38 _ 从单排到团战：详解操作系统的宏观网络架构.html',
                        audio: ''
                    },
                    {
                        id: '93eg678znvj',
                        title: '39 | 瞧一瞧Linux：详解socket实现与网络编程接口',
                        src:
                            '操作系统实战45讲/html/__404724__39 _ 瞧一瞧Linux：详解socket实现与网络编程接口.html',
                        audio: ''
                    },
                    {
                        id: 'fpitfksnbyo',
                        title: '40 | 瞧一瞧Linux：详解socket的接口实现',
                        src:
                            '操作系统实战45讲/html/__405781__40 _ 瞧一瞧Linux：详解socket的接口实现.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'fcqx7ywon8x',
                title: '服务交接：接口',
                subList: [
                    {
                        id: 'i07s3z3mqmh',
                        title: '41 | 服务接口：如何搭建沟通桥梁？',
                        src:
                            '操作系统实战45讲/html/__406633__41 _ 服务接口：如何搭建沟通桥梁？.html',
                        audio: ''
                    },
                    {
                        id: 'oqdsbh4u27d',
                        title: '42 | 瞧一瞧Linux：如何实现系统API？',
                        src:
                            '操作系统实战45讲/html/__407343__42 _ 瞧一瞧Linux：如何实现系统API？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '77fk7jgo76u',
                title: '番外篇：虚化的世界',
                subList: [
                    {
                        id: '5nnn42c1i0n',
                        title: '43 | 虚拟机内核：KVM是什么？',
                        src:
                            '操作系统实战45讲/html/__408124__43 _ 虚拟机内核：KVM是什么？.html',
                        audio: ''
                    },
                    {
                        id: 'mrehm3tqdr2',
                        title: '44 | 容器：如何理解容器的实现机制？',
                        src:
                            '操作系统实战45讲/html/__408927__44 _ 容器：如何理解容器的实现机制？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'euvj921q9w3',
                title: '特别放送',
                subList: [
                    {
                        id: 'fjtmlmj3pko',
                        title: '用户故事 | 成为面向“知识库”的工程师',
                        src:
                            '操作系统实战45讲/html/__396020__用户故事 _ 成为面向“知识库”的工程师.html',
                        audio: ''
                    }
                ]
            }
        ]
    },
    //趣谈网络协议
    {
        title: '趣谈网络协议',
        id: 'r5pnzf6jb5j',
        type: 'cs',
        cid: '100007101',
        subTitle: '像小说一样的网络协议入门课',
        authorName: '刘超',
        authorInfo: '网易研究院云计算技术部首席架构师',
        contents: [
            {
                id: 'bmtj8fhmxxj',
                title: '第一模块通信协议综述',
                subList: [
                    {
                        id: 'qcxr0dh88sm',
                        title: '第1讲-为什么要学习网络协议？',
                        src:
                            './趣谈网络协议/html/第1讲-为什么要学习网络协议？.html'
                    },
                    {
                        id: '3ip6t92mcxd',
                        title: '第2讲-网络分层的真实含义是什么？',
                        src:
                            './趣谈网络协议/html/第2讲-网络分层的真实含义是什么？.html'
                    },
                    {
                        id: 'elu7t2prdqg',
                        title: '第3讲-ifconfig：最熟悉又陌生的命令行',
                        src:
                            './趣谈网络协议/html/第3讲-ifconfig：最熟悉又陌生的命令行.html'
                    },
                    {
                        id: '89set0yzk4c',
                        title: '第4讲-DHCP与PXE：IP是怎么来的，又是怎么没的？',
                        src:
                            './趣谈网络协议/html/第4讲-DHCP与PXE：IP是怎么来的，又是怎么没的？.html'
                    }
                ]
            },
            {
                id: 'gshwbxt1com',
                title: '第二模块底层网络知识详解：从二层到三层',
                subList: [
                    {
                        id: 'ovyj7dzvp77',
                        title:
                            '第5讲-从物理层到MAC层：如何在宿舍里自己组网玩联机游戏？',
                        src:
                            './趣谈网络协议/html/第5讲-从物理层到MAC层：如何在宿舍里自己组网玩联机游戏？.html'
                    },
                    {
                        id: 'ym0753vaq5v',
                        title: '第6讲-交换机与VLAN：办公室太复杂，我要回学校',
                        src:
                            './趣谈网络协议/html/第6讲-交换机与VLAN：办公室太复杂，我要回学校.html'
                    },
                    {
                        id: 'x5ea375mry3',
                        title: '第7讲-ICMP与ping：投石问路的侦察兵',
                        src:
                            './趣谈网络协议/html/第7讲-ICMP与ping：投石问路的侦察兵.html'
                    },
                    {
                        id: 'jl8t3i8u38x',
                        title:
                            '第8讲-世界这么大，我想出网关：欧洲十国游与玄奘西行',
                        src:
                            './趣谈网络协议/html/第8讲-世界这么大，我想出网关：欧洲十国游与玄奘西行.html'
                    },
                    {
                        id: 'jtbglsjqbbu',
                        title: '第9讲-路由协议：西出网关无故人，敢问路在何方',
                        src:
                            './趣谈网络协议/html/第9讲-路由协议：西出网关无故人，敢问路在何方.html'
                    }
                ]
            },
            {
                id: 'eqwtp3sl4ui',
                title: '第二模块底层网络知识详解：最重要的传输层',
                subList: [
                    {
                        id: '0vaciq9pqv1',
                        title: '第10讲-UDP协议：因性善而简单，难免碰到“城会玩”',
                        src:
                            './趣谈网络协议/html/第10讲-UDP协议：因性善而简单，难免碰到“城会玩”.html'
                    },
                    {
                        id: 'kjife5qwp6g',
                        title:
                            '第11讲-TCP协议（上）：因性恶而复杂，先恶后善反轻松',
                        src:
                            './趣谈网络协议/html/第11讲-TCP协议（上）：因性恶而复杂，先恶后善反轻松.html'
                    },
                    {
                        id: '89afutmo6p4',
                        title:
                            '第12讲-TCP协议（下）：西行必定多妖孽，恒心智慧消磨难',
                        src:
                            './趣谈网络协议/html/第12讲-TCP协议（下）：西行必定多妖孽，恒心智慧消磨难.html'
                    },
                    {
                        id: 'w593hmtdc76',
                        title: '第13讲-套接字Socket：Talkischeap,showmethecode',
                        src:
                            './趣谈网络协议/html/第13讲-套接字Socket：Talkischeap,showmethecode.html'
                    }
                ]
            },
            {
                id: 'fg39bgblef5',
                title: '第二模块底层网络知识详解：最常用的应用层',
                subList: [
                    {
                        id: '1njcugmyhav',
                        title: '第14讲-HTTP协议：看个新闻原来这么麻烦',
                        src:
                            './趣谈网络协议/html/第14讲-HTTP协议：看个新闻原来这么麻烦.html'
                    },
                    {
                        id: 'kuujkm6t1cj',
                        title: '第15讲-HTTPS协议：点外卖的过程原来这么复杂',
                        src:
                            './趣谈网络协议/html/第15讲-HTTPS协议：点外卖的过程原来这么复杂.html'
                    },
                    {
                        id: 'wb54x81b43c',
                        title: '第16讲-流媒体协议：如何在直播里看到美女帅哥？',
                        src:
                            './趣谈网络协议/html/第16讲-流媒体协议：如何在直播里看到美女帅哥？.html'
                    },
                    {
                        id: '2w856dn3kqt',
                        title: '第17讲-P2P协议：我下小电影，99%急死你',
                        src: './趣谈网络协议/html/p2p.html'
                    }
                ]
            },
            {
                id: 'kz4n0bz5gv6',
                title: '第二模块底层网络知识详解：陌生的数据中心',
                subList: [
                    {
                        id: 'np6ox0n4ibf',
                        title: '第18讲-DNS协议：网络世界的地址簿',
                        src:
                            './趣谈网络协议/html/第18讲-DNS协议：网络世界的地址簿.html'
                    },
                    {
                        id: 'onynblhdn0b',
                        title: '第19讲-HttpDNS：网络世界的地址簿也会指错路',
                        src:
                            './趣谈网络协议/html/第19讲-HTTPDNS：网络世界的地址簿也会指错路.html'
                    },
                    {
                        id: 'wsuoewqghes',
                        title: '第20讲-CDN：你去小卖部取过快递么？',
                        src:
                            './趣谈网络协议/html/第20讲-CDN：你去小卖部取过快递么？.html'
                    },
                    {
                        id: 'h6swtc3c6rt',
                        title: '第21讲-数据中心：我是开发商，自己拿地盖别墅',
                        src:
                            './趣谈网络协议/html/第21讲-数据中心：我是开发商，自己拿地盖别墅.html'
                    },
                    {
                        id: 'c7sdovuv66j',
                        title: '第22讲-VPN：朝中有人好做官',
                        src:
                            './趣谈网络协议/html/第22讲-VPN：朝中有人好做官.html'
                    },
                    {
                        id: '8ugf4ynitxj',
                        title: '第23讲-移动网络：去巴塞罗那，手机也上不了脸书',
                        src:
                            './趣谈网络协议/html/第23讲-移动网络：去巴塞罗那，手机也上不了脸书.html'
                    }
                ]
            },
            {
                id: 'ebkdsoed8p3',
                title: '第三模块热门技术中的应用：云计算中的网络',
                subList: [
                    {
                        id: '8xkbqozolcc',
                        title:
                            '第24讲-云中网络：自己拿地成本高，购买公寓更灵活',
                        src:
                            './趣谈网络协议/html/第24讲-云中网络：自己拿地成本高，购买公寓更灵活.html'
                    },
                    {
                        id: '5eo0utuxuxl',
                        title:
                            '第25讲-软件定义网络：共享基础设施的小区物业管理办法',
                        src:
                            './趣谈网络协议/html/第25讲-软件定义网络：共享基础设施的小区物业管理办法.html'
                    },
                    {
                        id: '9dbxeows1hr',
                        title:
                            '第26讲-云中的网络安全：虽然不是土豪，也需要基本安全和保障',
                        src:
                            './趣谈网络协议/html/第26讲-云中的网络安全：虽然不是土豪，也需要基本安全和保障.html'
                    },
                    {
                        id: 'lbks2m8kfq9',
                        title:
                            '第27讲-云中的网络QoS：邻居疯狂下电影，我该怎么办？',
                        src:
                            './趣谈网络协议/html/第27讲-云中的网络QoS：邻居疯狂下电影，我该怎么办？.html'
                    },
                    {
                        id: 'hif6m5tpbt2',
                        title:
                            '第28讲-云中网络的隔离GRE、VXLAN：虽然住一个小区，也要保护隐私',
                        src:
                            './趣谈网络协议/html/第28讲-云中网络的隔离GRE、VXLAN：虽然住一个小区，也要保护隐私.html'
                    }
                ]
            },
            {
                id: '78ed3hsgwei',
                title: '第三模块热门技术中的应用：容器技术中的网络',
                subList: [
                    {
                        id: 'n44wrpxzjcb',
                        title:
                            '第29讲-容器网络：来去自由的日子，不买公寓去合租',
                        src:
                            './趣谈网络协议/html/第29讲-容器网络：来去自由的日子，不买公寓去合租.html'
                    },
                    {
                        id: 'beddmje01f6',
                        title: '第30讲-容器网络之Flannel：每人一亩三分地',
                        src:
                            './趣谈网络协议/html/第30讲-容器网络之Flannel：每人一亩三分地.html'
                    },
                    {
                        id: 'p9ej9hfxj9i',
                        title: '第31讲-容器网络之Calico：为高效说出善意的谎言',
                        src:
                            './趣谈网络协议/html/第31讲-容器网络之Calico：为高效说出善意的谎言.html'
                    }
                ]
            },
            {
                id: 'vsdmez9jzbv',
                title: '第三模块热门技术中的应用：微服务相关协议',
                subList: [
                    {
                        id: 'epqjep625h0',
                        title: '第32讲-RPC协议综述：远在天边，近在眼前',
                        src:
                            './趣谈网络协议/html/第32讲-RPC协议综述：远在天边，近在眼前.html'
                    },
                    {
                        id: 'yxdjy4hpwcr',
                        title:
                            '第33讲-基于XML的SOAP协议：不要说NBA，请说美国职业篮球联赛',
                        src:
                            './趣谈网络协议/html/第33讲-基于XML的SOAP协议：不要说NBA，请说美国职业篮球联赛.html'
                    },
                    {
                        id: 'azyq2mcm450',
                        title:
                            '第34讲-基于JSON的RESTful接口协议：我不关心过程，请给我结果',
                        src:
                            './趣谈网络协议/html/第34讲-基于JSON的RESTful接口协议：我不关心过程，请给我结果.html'
                    },
                    {
                        id: 'jd6nkq32hbp',
                        title:
                            '第35讲-二进制类RPC协议：还是叫NBA吧，总说全称多费劲',
                        src:
                            './趣谈网络协议/html/第35讲-二进制类RPC协议：还是叫NBA吧，总说全称多费劲.html'
                    },
                    {
                        id: 'bwb9sern9ps',
                        title:
                            '第36讲-跨语言类RPC协议：交流之前，双方先来个专业术语表',
                        src:
                            './趣谈网络协议/html/第36讲-跨语言类RPC协议：交流之前，双方先来个专业术语表.html'
                    }
                ]
            },
            {
                id: 't2rr4utg2r8',
                title: '第四模块网络协议知识串讲',
                subList: [
                    {
                        id: 'k061e6hs8sm',
                        title:
                            '第37讲-知识串讲：用双十一的故事串起碎片的网络协议（上）',
                        src:
                            './趣谈网络协议/html/第37讲-知识串讲：用双十一的故事串起碎片的网络协议（上）.html'
                    },
                    {
                        id: 'g6v3l289mnv',
                        title:
                            '第38讲-知识串讲：用双十一的故事串起碎片的网络协议（中）',
                        src:
                            './趣谈网络协议/html/第38讲-知识串讲：用双十一的故事串起碎片的网络协议（中）.html'
                    },
                    {
                        id: '1vc65y8gxj2',
                        title:
                            '第39讲-知识串讲：用双十一的故事串起碎片的网络协议（下）',
                        src:
                            './趣谈网络协议/html/第39讲-知识串讲：用双十一的故事串起碎片的网络协议（下）.html'
                    },
                    {
                        id: 'gnhvg7iqt8g',
                        title:
                            '第40讲-搭建一个网络实验环境：授人以鱼不如授人以渔',
                        src:
                            './趣谈网络协议/html/第40讲-搭建一个网络实验环境：授人以鱼不如授人以渔.html'
                    }
                ]
            },
            {
                id: 'i9d3rvtsd8p',
                title: '答疑与加餐',
                subList: [
                    {
                        id: '7j9slwn99mv',
                        title: '协议专栏特别福利-答疑解惑第一期',
                        src: ''
                    },
                    {
                        id: 'mabdt37dgb6',
                        title: '协议专栏特别福利-答疑解惑第二期',
                        src: ''
                    },
                    {
                        id: 'yoky2hlxjox',
                        title: '协议专栏特别福利-答疑解惑第三期',
                        src: ''
                    },
                    {
                        id: 'lghjtn52vs3',
                        title: '协议专栏特别福利-答疑解惑第四期',
                        src: ''
                    },
                    {
                        id: 'rxb7ejgz2q4',
                        title: '协议专栏特别福利-答疑解惑第五期',
                        src: ''
                    },
                    {
                        id: 'd25lg5mn7yz',
                        title: '加餐1-测一测：这些网络协议你都掌握了吗？',
                        src: ''
                    },
                    {
                        id: 'k01xzcqt4l0',
                        title:
                            '加餐2-创作故事：我是如何创作“趣谈网络协议”专栏的？',
                        src: ''
                    },
                    {
                        id: 'u7nn8w6fg1v',
                        title: '加餐3-“趣谈网络协议”专栏食用指南',
                        src: ''
                    },
                    {
                        id: 'naik3afrqzq',
                        title: '第2季回归-这次我们来“趣谈Linux操作系统”',
                        src: ''
                    }
                ]
            },
            {
                id: '32q2jr237s4',
                title: '结束语',
                subList: [
                    {
                        id: 'btes9wpl13w',
                        title:
                            '结束语-放弃完美主义，执行力就是限时限量认真完成',
                        src: ''
                    }
                ]
            }
        ]
    },
    //透视HTTP协议
    {
        title: '透视HTTP协议',
        id: 'mxprfcgr030',
        type: 'cs',
        cid: '100029001',
        subTitle: '深入理解HTTP协议本质与应用',
        authorName: '罗剑锋（Chrono）',
        authorInfo: '奇虎360技术专家，Nginx/OpenResty开源项目贡献者',
        contents: [
            {
                id: 'pig49ddwg0u',
                title: '开篇词',
                subList: [
                    {
                        id: 'cndvu2wd5h9',
                        title: '开篇词｜To Be a HTTP Hero',
                        src: './透视HTTP协议/html/开篇词ToBeaHTTPHero.html'
                    }
                ]
            },
            {
                id: 'xf6i6awjbpj',
                title: '破冰篇',
                subList: [
                    {
                        id: 'ftsi2xsicgq',
                        title: '01 | 时势与英雄：HTTP的前世今生',
                        src:
                            './透视HTTP协议/html/01时势与英雄HTTP的前世今生.html'
                    },
                    {
                        id: 'tmqvd3zd44p',
                        title: '02 | HTTP是什么？HTTP又不是什么？',
                        src:
                            './透视HTTP协议/html/02HTTP是什么HTTP又不是什么.html'
                    },
                    {
                        id: 'ahwq95u7x3p',
                        title: '03 | HTTP世界全览（上）：与HTTP相关的各种概念',
                        src:
                            './透视HTTP协议/html/03HTTP世界全览上与HTTP相关的各种概念.html'
                    },
                    {
                        id: 'qz7ic0lxfgk',
                        title: '04 | HTTP世界全览（下）：与HTTP相关的各种协议',
                        src:
                            './透视HTTP协议/html/04HTTP世界全览下与HTTP相关的各种协议.html'
                    },
                    {
                        id: '6wbj6m5ih89',
                        title:
                            '05 | 常说的“四层”和“七层”到底是什么？“五层”“六层”哪去了？',
                        src:
                            './透视HTTP协议/html/05常说的四层和七层到底是什么五层六层哪去了.html'
                    },
                    {
                        id: 'eaymrox43no',
                        title: '06 | 域名里有哪些门道？',
                        src: './透视HTTP协议/html/06域名里有哪些门道.html'
                    },
                    {
                        id: '6mu6rxpwpoc',
                        title: '07 | 自己动手，搭建HTTP实验环境',
                        src:
                            './透视HTTP协议/html/07自己动手搭建HTTP实验环境.html'
                    }
                ]
            },
            {
                id: 'bor6o0y5i26',
                title: '基础篇',
                subList: [
                    {
                        id: 'kvaawhgbba0',
                        title: '08 | 键入网址再按下回车，后面究竟发生了什么？',
                        src:
                            './透视HTTP协议/html/08键入网址再按下回车后面究竟发生了什么.html'
                    },
                    {
                        id: '0v1afj2udrq',
                        title: '09 | HTTP报文是什么样子的？',
                        src: './透视HTTP协议/html/09HTTP报文是什么样子的.html'
                    },
                    {
                        id: 'wf1lld6lf9u',
                        title: '10 | 应该如何理解请求方法？',
                        src: './透视HTTP协议/html/10应该如何理解请求方法.html'
                    },
                    {
                        id: 'zi2k634ynhz',
                        title: '11 | 你能写出正确的网址吗？',
                        src: './透视HTTP协议/html/11你能写出正确的网址吗.html'
                    },
                    {
                        id: '69w1a134ulz',
                        title: '12 | 响应状态码该怎么用？',
                        src: './透视HTTP协议/html/12响应状态码该怎么用.html'
                    },
                    {
                        id: '4vwl5l41afs',
                        title: '13 | HTTP有哪些特点？',
                        src: './透视HTTP协议/html/13HTTP有哪些特点.html'
                    },
                    {
                        id: '39pd6rii0zr',
                        title: '14 | HTTP有哪些优点？又有哪些缺点？',
                        src:
                            './透视HTTP协议/html/14HTTP有哪些优点又有哪些缺点.html'
                    }
                ]
            },
            {
                id: 'fb9bb7e3678',
                title: '进阶篇',
                subList: [
                    {
                        id: '5lzme9g1841',
                        title: '15 | 海纳百川：HTTP的实体数据',
                        src: './透视HTTP协议/html/15海纳百川HTTP的实体数据.html'
                    },
                    {
                        id: 'tr4nyceyx2z',
                        title: '16 | 把大象装进冰箱：HTTP传输大文件的方法',
                        src:
                            './透视HTTP协议/html/16把大象装进冰箱HTTP传输大文件的方法.html'
                    },
                    {
                        id: 'j4ad2ikr2ao',
                        title: '17 | 排队也要讲效率：HTTP的连接管理',
                        src:
                            './透视HTTP协议/html/17排队也要讲效率HTTP的连接管理.html'
                    },
                    {
                        id: 'ru0jffp4mrt',
                        title: '18 | 四通八达：HTTP的重定向和跳转',
                        src:
                            './透视HTTP协议/html/18四通八达HTTP的重定向和跳转.html'
                    },
                    {
                        id: 'adrtb5266ez',
                        title: '19 | 让我知道你是谁：HTTP的Cookie机制',
                        src:
                            './透视HTTP协议/html/19让我知道你是谁HTTP的Cookie机制.html'
                    },
                    {
                        id: 'jzpqgnelm4m',
                        title: '20 | 生鲜速递：HTTP的缓存控制',
                        src: './透视HTTP协议/html/20生鲜速递HTTP的缓存控制.html'
                    },
                    {
                        id: 't1q9rn410q7',
                        title: '21 | 良心中间商：HTTP的代理服务',
                        src:
                            './透视HTTP协议/html/21良心中间商HTTP的代理服务.html'
                    },
                    {
                        id: 'w2kvc573k01',
                        title: '22 | 冷链周转：HTTP的缓存代理',
                        src: './透视HTTP协议/html/22冷链周转HTTP的缓存代理.html'
                    }
                ]
            },
            {
                id: '7s2wqn57pru',
                title: '安全篇',
                subList: [
                    {
                        id: '1g4fo3e5slv',
                        title: '23 | HTTPS是什么？SSL/TLS又是什么？',
                        src:
                            './透视HTTP协议/html/23HTTPS是什么SSLTLS又是什么.html'
                    },
                    {
                        id: 'blfp4zvlqz4',
                        title:
                            '24 | 固若金汤的根本（上）：对称加密与非对称加密',
                        src:
                            './透视HTTP协议/html/24固若金汤的根本上对称加密与非对称加密.html'
                    },
                    {
                        id: 'mcd4xmjs0ne',
                        title: '25 | 固若金汤的根本（下）：数字签名与证书',
                        src:
                            './透视HTTP协议/html/25固若金汤的根本下数字签名与证书.html'
                    },
                    {
                        id: 'e3qhfqgjkkr',
                        title: '26 | 信任始于握手：TLS1.2连接过程解析',
                        src:
                            './透视HTTP协议/html/26信任始于握手TLS1.2连接过程解析.html'
                    },
                    {
                        id: '3yvb2iwpd14',
                        title: '27 | 更好更快的握手：TLS1.3特性解析',
                        src:
                            './透视HTTP协议/html/27更好更快的握手TLS1.3特性解析.html'
                    },
                    {
                        id: 'juddhigmtrl',
                        title: '28 | 连接太慢该怎么办：HTTPS的优化',
                        src:
                            './透视HTTP协议/html/28连接太慢该怎么办HTTPS的优化.html'
                    },
                    {
                        id: 'b6xho3btsxu',
                        title: '29 | 我应该迁移到HTTPS吗？',
                        src: './透视HTTP协议/html/29我应该迁移到HTTPS吗.html'
                    }
                ]
            },
            {
                id: 'vs2q8fxvlui',
                title: '飞翔篇',
                subList: [
                    {
                        id: 'ttu3z2e59xj',
                        title: '30 | 时代之风（上）：HTTP/2特性概览',
                        src:
                            './透视HTTP协议/html/30时代之风上HTTP2特性概览.html'
                    },
                    {
                        id: 'mtnbbm39cuo',
                        title: '31 | 时代之风（下）：HTTP/2内核剖析',
                        src:
                            './透视HTTP协议/html/31时代之风下HTTP2内核剖析.html'
                    },
                    {
                        id: 'c96j1ihsgap',
                        title: '32 | 未来之路：HTTP/3展望',
                        src: './透视HTTP协议/html/32未来之路HTTP3展望.html'
                    },
                    {
                        id: '5t6rzgq4cky',
                        title: '33 | 我应该迁移到HTTP/2吗？',
                        src: './透视HTTP协议/html/33我应该迁移到HTTP2吗.html'
                    }
                ]
            },
            {
                id: '99fuwo533oe',
                title: '探索篇',
                subList: [
                    {
                        id: 'q5uvbe0abh6',
                        title: '34 | Nginx：高性能的Web服务器',
                        src: './透视HTTP协议/html/34Nginx高性能的Web服务器.html'
                    },
                    {
                        id: 'qfs94zigawq',
                        title: '35 | OpenResty：更灵活的Web服务器',
                        src:
                            './透视HTTP协议/html/35OpenResty更灵活的Web服务器.html'
                    },
                    {
                        id: 'xarfeihmjto',
                        title: '36 | WAF：保护我们的网络服务',
                        src: './透视HTTP协议/html/36WAF保护我们的网络服务.html'
                    },
                    {
                        id: 'gwdny8w4znw',
                        title: '37 | CDN：加速我们的网络服务',
                        src: './透视HTTP协议/html/37CDN加速我们的网络服务.html'
                    },
                    {
                        id: 'ir3kw07tmln',
                        title: '38 | WebSocket：沙盒里的TCP',
                        src: './透视HTTP协议/html/38WebSocket沙盒里的TCP.html'
                    }
                ]
            },
            {
                id: '2fwiszvo6ex',
                title: '总结篇',
                subList: [
                    {
                        id: 'hh2ho0mlwgn',
                        title: '39 | HTTP性能优化面面观（上）',
                        src: './透视HTTP协议/html/39HTTP性能优化面面观上.html'
                    },
                    {
                        id: '5w92ybgf5nn',
                        title: '40 | HTTP性能优化面面观（下）',
                        src: './透视HTTP协议/html/40HTTP性能优化面面观下.html'
                    }
                ]
            },
            {
                id: 'oqefne7dw6e',
                title: '答疑篇',
                subList: [
                    {
                        id: 'ohz74zqwd7i',
                        title: '41 | Linux/Mac实验环境搭建与URI查询参数',
                        src: ''
                    },
                    {
                        id: 'hscutx43pml',
                        title: '42 | DHE/ECDHE算法的原理',
                        src: ''
                    }
                ]
            },
            {
                id: 'uh073j17v7u',
                title: '结束语',
                subList: [
                    {
                        id: 'yr7f983s7su',
                        title: '结束语 | 做兴趣使然的Hero',
                        src: './透视HTTP协议/html/结束语做兴趣使然的Hero.html'
                    },
                    {
                        id: 'yd72ezgomum',
                        title: '结课测试 | 这些HTTP协议知识，你真的掌握了吗？',
                        src: ''
                    }
                ]
            }
        ]
    },
    //程序员的数学基础课
    {
        id: '5wlk783n892',
        type: 'cs',
        cid: '143',
        title: '程序员的数学基础课',
        subTitle: '在实战中重新理解数学',
        authorName: '黄申',
        authorInfo: 'LinkedIn资深数据科学家',
        contents: [
            {
                id: 's54zxzrnxh6',
                title: '开篇词',
                subList: [
                    {
                        id: 'kr8bdi568h5',
                        title: '开篇词 | 作为程序员，为什么你应该学好数学？',
                        src:
                            '程序员的数学基础课/html/__70844__开篇词 _ 作为程序员，为什么你应该学好数学？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'xm6hkv2jpin',
                title: '导读',
                subList: [
                    {
                        id: 'c7f4k1akfij',
                        title: '导读：程序员应该怎么学数学？',
                        src:
                            '程序员的数学基础课/html/__71139__导读：程序员应该怎么学数学？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'iynk0vcheen',
                title: '基础思想篇',
                subList: [
                    {
                        id: 'yttktlfmbhd',
                        title: '01 | 二进制：不了解计算机的源头，你学什么编程',
                        src:
                            '程序员的数学基础课/html/__71840__01 _ 二进制：不了解计算机的源头，你学什么编程.html',
                        audio: ''
                    },
                    {
                        id: '5rac8omxcge',
                        title: '02 | 余数：原来取余操作本身就是个哈希函数',
                        src:
                            '程序员的数学基础课/html/__72163__02 _ 余数：原来取余操作本身就是个哈希函数.html',
                        audio: ''
                    },
                    {
                        id: 'is3bad7257d',
                        title:
                            '03 | 迭代法：不用编程语言的自带函数，你会如何计算平方根？',
                        src:
                            '程序员的数学基础课/html/__72243__03 _ 迭代法：不用编程语言的自带函数，你会如何计算平方根？.html',
                        audio: ''
                    },
                    {
                        id: 'mg1svjjoo80',
                        title:
                            '04 | 数学归纳法：如何用数学归纳提升代码的运行效率？',
                        src:
                            '程序员的数学基础课/html/__73036__04 _ 数学归纳法：如何用数学归纳提升代码的运行效率？.html',
                        audio: ''
                    },
                    {
                        id: '9xodlggnduq',
                        title:
                            '05 | 递归（上）：泛化数学归纳，如何将复杂问题简单化？',
                        src:
                            '程序员的数学基础课/html/__73511__05 _ 递归（上）：泛化数学归纳，如何将复杂问题简单化？.html',
                        audio: ''
                    },
                    {
                        id: 'ng0rydxal0o',
                        title:
                            '06 | 递归（下）：分而治之，从归并排序到MapReduce',
                        src:
                            '程序员的数学基础课/html/__73834__06 _ 递归（下）：分而治之，从归并排序到MapReduce.html',
                        audio: ''
                    },
                    {
                        id: 'cdp21za4tap',
                        title: '07 | 排列：如何让计算机学会“田忌赛马”？',
                        src:
                            '程序员的数学基础课/html/__75129__07 _ 排列：如何让计算机学会“田忌赛马”？.html',
                        audio: ''
                    },
                    {
                        id: 'rozlnko2h4k',
                        title: '08 | 组合：如何让计算机安排世界杯的赛程？',
                        src:
                            '程序员的数学基础课/html/__75662__08 _ 组合：如何让计算机安排世界杯的赛程？.html',
                        audio: ''
                    },
                    {
                        id: 'oryemvgwz4l',
                        title:
                            '09 | 动态规划（上）：如何实现基于编辑距离的查询推荐？',
                        src:
                            '程序员的数学基础课/html/__75807__09 _ 动态规划（上）：如何实现基于编辑距离的查询推荐？.html',
                        audio: ''
                    },
                    {
                        id: '30ma5getnam',
                        title:
                            '10 | 动态规划（下）：如何求得状态转移方程并进行编程实现？',
                        src:
                            '程序员的数学基础课/html/__76183__10 _ 动态规划（下）：如何求得状态转移方程并进行编程实现？.html',
                        audio: ''
                    },
                    {
                        id: 'pxnalciaqsv',
                        title:
                            '11 | 树的深度优先搜索（上）：如何才能高效率地查字典？',
                        src:
                            '程序员的数学基础课/html/__76481__11 _ 树的深度优先搜索（上）：如何才能高效率地查字典？.html',
                        audio: ''
                    },
                    {
                        id: 'wqd2o8ysk14',
                        title:
                            '12 | 树的深度优先搜索（下）：如何才能高效率地查字典？',
                        src:
                            '程序员的数学基础课/html/__76822__12 _ 树的深度优先搜索（下）：如何才能高效率地查字典？.html',
                        audio: ''
                    },
                    {
                        id: 'rn5r4qz1xpa',
                        title:
                            '13 | 树的广度优先搜索（上）：人际关系的六度理论是真的吗？',
                        src:
                            '程序员的数学基础课/html/__77129__13 _ 树的广度优先搜索（上）：人际关系的六度理论是真的吗？.html',
                        audio: ''
                    },
                    {
                        id: 'k7wqcb9runm',
                        title:
                            '14 | 树的广度优先搜索（下）：为什么双向广度优先搜索的效率更高？',
                        src:
                            '程序员的数学基础课/html/__77474__14 _ 树的广度优先搜索（下）：为什么双向广度优先搜索的效率更高？.html',
                        audio: ''
                    },
                    {
                        id: 'm1ka6jhw5v8',
                        title: '15 | 从树到图：如何让计算机学会看地图？',
                        src:
                            '程序员的数学基础课/html/__77849__15 _ 从树到图：如何让计算机学会看地图？.html',
                        audio: ''
                    },
                    {
                        id: '5gk52k81qnv',
                        title:
                            '16 | 时间和空间复杂度（上）：优化性能是否只是“纸上谈兵”？',
                        src:
                            '程序员的数学基础课/html/__78186__16 _ 时间和空间复杂度（上）：优化性能是否只是“纸上谈兵”？.html',
                        audio: ''
                    },
                    {
                        id: 'mqu7dnjbyr5',
                        title:
                            '17 | 时间和空间复杂度（下）：如何使用六个法则进行复杂度分析？',
                        src:
                            '程序员的数学基础课/html/__78457__17 _ 时间和空间复杂度（下）：如何使用六个法则进行复杂度分析？.html',
                        audio: ''
                    },
                    {
                        id: '2y0wfy9tgtd',
                        title:
                            '18 | 总结课：数据结构、编程语句和基础算法体现了哪些数学思想？',
                        src:
                            '程序员的数学基础课/html/__78790__18 _ 总结课：数据结构、编程语句和基础算法体现了哪些数学思想？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '1itmvehrt66',
                title: '概率统计篇',
                subList: [
                    {
                        id: 'rlepnd3adnv',
                        title: '19 | 概率和统计：编程为什么需要概率和统计？',
                        src:
                            '程序员的数学基础课/html/__79441__19 _ 概率和统计：编程为什么需要概率和统计？.html',
                        audio: ''
                    },
                    {
                        id: '1xnltgx7akt',
                        title:
                            '20 | 概率基础（上）：一篇文章帮你理解随机变量、概率分布和期望值',
                        src:
                            '程序员的数学基础课/html/__79915__20 _ 概率基础（上）：一篇文章帮你理解随机变量、概率分布和期望值.html',
                        audio: ''
                    },
                    {
                        id: '9la2xmovo6h',
                        title:
                            '21 | 概率基础（下）：联合概率、条件概率和贝叶斯法则，这些概率公式究竟能做什么？',
                        src:
                            '程序员的数学基础课/html/__80393__21 _ 概率基础（下）：联合概率、条件概率和贝叶斯法则，这些概率公式究竟能做什么？.html',
                        audio: ''
                    },
                    {
                        id: '2qwlwdtfx07',
                        title: '22 | 朴素贝叶斯：如何让计算机学会自动分类？',
                        src:
                            '程序员的数学基础课/html/__80868__22 _ 朴素贝叶斯：如何让计算机学会自动分类？.html',
                        audio: ''
                    },
                    {
                        id: 'wg7be367vpz',
                        title: '23 | 文本分类：如何区分特定类型的新闻？',
                        src:
                            '程序员的数学基础课/html/__81009__23 _ 文本分类：如何区分特定类型的新闻？.html',
                        audio: ''
                    },
                    {
                        id: 'a9qe23w532i',
                        title:
                            '24 | 语言模型：如何使用链式法则和马尔科夫假设简化概率模型？',
                        src:
                            '程序员的数学基础课/html/__81105__24 _ 语言模型：如何使用链式法则和马尔科夫假设简化概率模型？.html',
                        audio: ''
                    },
                    {
                        id: 'po1ksebhezo',
                        title:
                            '25 | 马尔科夫模型：从PageRank到语音识别，背后是什么模型在支撑？',
                        src:
                            '程序员的数学基础课/html/__81374__25 _ 马尔科夫模型：从PageRank到语音识别，背后是什么模型在支撑？.html',
                        audio: ''
                    },
                    {
                        id: '857pimvloc8',
                        title:
                            '26 | 信息熵：如何通过几个问题，测出你对应的武侠人物？',
                        src:
                            '程序员的数学基础课/html/__81673__26 _ 信息熵：如何通过几个问题，测出你对应的武侠人物？.html',
                        audio: ''
                    },
                    {
                        id: 'eeahnoqdopd',
                        title:
                            '27 | 决策树：信息增益、增益比率和基尼指数的运用',
                        src:
                            '程序员的数学基础课/html/__81941__27 _ 决策树：信息增益、增益比率和基尼指数的运用.html',
                        audio: ''
                    },
                    {
                        id: 'j0avau59cxu',
                        title: '28 | 熵、信息增益和卡方：如何寻找关键特征？',
                        src:
                            '程序员的数学基础课/html/__82296__28 _ 熵、信息增益和卡方：如何寻找关键特征？.html',
                        audio: ''
                    },
                    {
                        id: 'uc6x2cxafcc',
                        title:
                            '29 | 归一化和标准化：各种特征如何综合才是最合理的？',
                        src:
                            '程序员的数学基础课/html/__82661__29 _ 归一化和标准化：各种特征如何综合才是最合理的？.html',
                        audio: ''
                    },
                    {
                        id: 'vlupaxoljxt',
                        title:
                            '30 | 统计意义（上）：如何通过显著性检验，判断你的A/B测试结果是不是巧合？',
                        src:
                            '程序员的数学基础课/html/__82919__30 _ 统计意义（上）：如何通过显著性检验，判断你的A_B测试结果是不是巧合？.html',
                        audio: ''
                    },
                    {
                        id: '36zig89fqt8',
                        title:
                            '31 | 统计意义（下）：如何通过显著性检验，判断你的A/B测试结果是不是巧合？',
                        src:
                            '程序员的数学基础课/html/__83200__31 _ 统计意义（下）：如何通过显著性检验，判断你的A_B测试结果是不是巧合？.html',
                        audio: ''
                    },
                    {
                        id: 'h4szfflsnns',
                        title:
                            '32 | 概率统计篇答疑和总结：为什么会有欠拟合和过拟合？',
                        src:
                            '程序员的数学基础课/html/__83593__32 _ 概率统计篇答疑和总结：为什么会有欠拟合和过拟合？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '71e3585xmik',
                title: '线性代数篇',
                subList: [
                    {
                        id: '3i8icrxzoij',
                        title: '33 | 线性代数：线性代数到底都讲了些什么？',
                        src:
                            '程序员的数学基础课/html/__83948__33 _ 线性代数：线性代数到底都讲了些什么？.html',
                        audio: ''
                    },
                    {
                        id: 'x0bm5543eff',
                        title:
                            '34 | 向量空间模型：如何让计算机理解现实事物之间的关系？',
                        src:
                            '程序员的数学基础课/html/__84292__34 _ 向量空间模型：如何让计算机理解现实事物之间的关系？.html',
                        audio: ''
                    },
                    {
                        id: 'onnmrodwevn',
                        title: '35 | 文本检索：如何让计算机处理自然语言？',
                        src:
                            '程序员的数学基础课/html/__84575__35 _ 文本检索：如何让计算机处理自然语言？.html',
                        audio: ''
                    },
                    {
                        id: 'ijurm9kg4s0',
                        title: '36 | 文本聚类：如何过滤冗余的新闻？',
                        src:
                            '程序员的数学基础课/html/__84949__36 _ 文本聚类：如何过滤冗余的新闻？.html',
                        audio: ''
                    },
                    {
                        id: 't4019zoxooh',
                        title:
                            '37 | 矩阵（上）：如何使用矩阵操作进行PageRank计算？',
                        src:
                            '程序员的数学基础课/html/__85194__37 _ 矩阵（上）：如何使用矩阵操作进行PageRank计算？.html',
                        audio: ''
                    },
                    {
                        id: 'oi909ratl1h',
                        title:
                            '38 | 矩阵（下）：如何使用矩阵操作进行协同过滤推荐？',
                        src:
                            '程序员的数学基础课/html/__85562__38 _ 矩阵（下）：如何使用矩阵操作进行协同过滤推荐？.html',
                        audio: ''
                    },
                    {
                        id: 'qqskn06xs50',
                        title:
                            '39 | 线性回归（上）：如何使用高斯消元求解线性方程组？',
                        src:
                            '程序员的数学基础课/html/__86014__39 _ 线性回归（上）：如何使用高斯消元求解线性方程组？.html',
                        audio: ''
                    },
                    {
                        id: 'iikt64qk43j',
                        title:
                            '40 | 线性回归（中）：如何使用最小二乘法进行直线拟合？',
                        src:
                            '程序员的数学基础课/html/__86326__40 _ 线性回归（中）：如何使用最小二乘法进行直线拟合？.html',
                        audio: ''
                    },
                    {
                        id: 'njgkytcvyw9',
                        title:
                            '41 | 线性回归（下）：如何使用最小二乘法进行效果验证？',
                        src:
                            '程序员的数学基础课/html/__86766__41 _ 线性回归（下）：如何使用最小二乘法进行效果验证？.html',
                        audio: ''
                    },
                    {
                        id: 'aox4n0bj3xo',
                        title:
                            '42 | PCA主成分分析（上）：如何利用协方差矩阵来降维？',
                        src:
                            '程序员的数学基础课/html/__87097__42 _ PCA主成分分析（上）：如何利用协方差矩阵来降维？.html',
                        audio: ''
                    },
                    {
                        id: 'y5gz17knhmm',
                        title:
                            '43 | PCA主成分分析（下）：为什么要计算协方差矩阵的特征值和特征向量？',
                        src:
                            '程序员的数学基础课/html/__87337__43 _ PCA主成分分析（下）：为什么要计算协方差矩阵的特征值和特征向量？.html',
                        audio: ''
                    },
                    {
                        id: 'bshdue85brn',
                        title: '44 | 奇异值分解：如何挖掘潜在的语义关系？',
                        src:
                            '程序员的数学基础课/html/__87657__44 _ 奇异值分解：如何挖掘潜在的语义关系？.html',
                        audio: ''
                    },
                    {
                        id: 'gpx8ebid0q7',
                        title:
                            '45 | 线性代数篇答疑和总结：矩阵乘法的几何意义是什么？',
                        src:
                            '程序员的数学基础课/html/__88078__45 _ 线性代数篇答疑和总结：矩阵乘法的几何意义是什么？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '8jaihl1jbk7',
                title: '综合应用篇',
                subList: [
                    {
                        id: 'mgtdo4t41zu',
                        title:
                            '46 | 缓存系统：如何通过哈希表和队列实现高效访问？',
                        src:
                            '程序员的数学基础课/html/__88408__46 _ 缓存系统：如何通过哈希表和队列实现高效访问？.html',
                        audio: ''
                    },
                    {
                        id: 'n793stcxxey',
                        title:
                            '47 | 搜索引擎（上）：如何通过倒排索引和向量空间模型，打造一个简单的搜索引擎？',
                        src:
                            '程序员的数学基础课/html/__88774__47 _ 搜索引擎（上）：如何通过倒排索引和向量空间模型，打造一个简单的搜索引擎？.html',
                        audio: ''
                    },
                    {
                        id: 'fqn8043y8gp',
                        title:
                            '48 | 搜索引擎（下）：如何通过查询的分类，让电商平台的搜索结果更相关？',
                        src:
                            '程序员的数学基础课/html/__89279__48 _ 搜索引擎（下）：如何通过查询的分类，让电商平台的搜索结果更相关？.html',
                        audio: ''
                    },
                    {
                        id: '45vxkauf501',
                        title:
                            '49 | 推荐系统（上）：如何实现基于相似度的协同过滤？',
                        src:
                            '程序员的数学基础课/html/__89431__49 _ 推荐系统（上）：如何实现基于相似度的协同过滤？.html',
                        audio: ''
                    },
                    {
                        id: 'sxcq4starhi',
                        title:
                            '50 | 推荐系统（下）：如何通过SVD分析用户和物品的矩阵？',
                        src:
                            '程序员的数学基础课/html/__89745__50 _ 推荐系统（下）：如何通过SVD分析用户和物品的矩阵？.html',
                        audio: ''
                    },
                    {
                        id: 'hb1nysp3dhb',
                        title:
                            '51 | 综合应用篇答疑和总结：如何进行个性化用户画像的设计？',
                        src:
                            '程序员的数学基础课/html/__90112__51 _ 综合应用篇答疑和总结：如何进行个性化用户画像的设计？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 's94isecll0c',
                title: '加餐',
                subList: [
                    {
                        id: 'cskus14jvtd',
                        title:
                            '数学专栏课外加餐（一） | 我们为什么需要反码和补码？',
                        src:
                            '程序员的数学基础课/html/__74296__数学专栏课外加餐（一） _ 我们为什么需要反码和补码？.html',
                        audio: ''
                    },
                    {
                        id: '0xfq8pijjy6',
                        title: '数学专栏课外加餐（二） | 位操作的三个应用实例',
                        src:
                            '程序员的数学基础课/html/__74717__数学专栏课外加餐（二） _ 位操作的三个应用实例.html',
                        audio: ''
                    },
                    {
                        id: 'fbzc6k8r2qf',
                        title:
                            '数学专栏课外加餐（三）：程序员需要读哪些数学书？',
                        src:
                            '程序员的数学基础课/html/__79048__数学专栏课外加餐（三）：程序员需要读哪些数学书？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '1orvm18m373',
                title: '结束语',
                subList: [
                    {
                        id: 'vn5nfc0p35w',
                        title: '结束语 | 从数学到编程，本身就是一个很长的链条',
                        src:
                            '程序员的数学基础课/html/__90384__结束语 _ 从数学到编程，本身就是一个很长的链条.html',
                        audio: ''
                    },
                    {
                        id: 'jdhf2pmehx6',
                        title: '结课测试 | 这些数学知识你都掌握了吗？',
                        src:
                            '程序员的数学基础课/html/__224543__结课测试 _ 这些数学知识你都掌握了吗？.html',
                        audio: ''
                    }
                ]
            }
        ]
    },
    //重学线性代数
    {
        id: '7wruzyq4m8q',
        type: 'cs',
        cid: '327',
        title: '重学线性代数',
        subTitle: '掌握工程应用中的线代知识',
        authorName: '朱维刚',
        authorInfo: '前阿里云资深技术专家，日世集团数字化事业部总经理',
        contents: [
            {
                id: 'vzq2nznoj00',
                title: '开篇词',
                subList: [
                    {
                        id: 'hhbvlwqeluq',
                        title: '开篇词 | 从今天起，学会线性代数',
                        src:
                            '重学线性代数/html/__265230__开篇词 _ 从今天起，学会线性代数.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'zv37xrugizb',
                title: '基础篇',
                subList: [
                    {
                        id: 'wsk1miifds0',
                        title: '01 | 导读：如何在机器学习中运用线性代数工具？',
                        src:
                            '重学线性代数/html/__265757__01 _ 导读：如何在机器学习中运用线性代数工具？.html',
                        audio: ''
                    },
                    {
                        id: 'n0phm1uzqqt',
                        title: '02 | 基本概念：线性代数研究的到底是什么问题？',
                        src:
                            '重学线性代数/html/__265296__02 _ 基本概念：线性代数研究的到底是什么问题？.html',
                        audio: ''
                    },
                    {
                        id: 't3ogvn7g1b5',
                        title:
                            '03 | 矩阵：为什么说矩阵是线性方程组的另一种表达？',
                        src:
                            '重学线性代数/html/__268296__03 _ 矩阵：为什么说矩阵是线性方程组的另一种表达？.html',
                        audio: ''
                    },
                    {
                        id: '71x08eiqjyc',
                        title:
                            '04 | 解线性方程组：为什么用矩阵求解的效率这么高？',
                        src:
                            '重学线性代数/html/__269448__04 _ 解线性方程组：为什么用矩阵求解的效率这么高？.html',
                        audio: ''
                    },
                    {
                        id: 'ymqq2gkpuis',
                        title:
                            '05 | 线性空间：如何通过向量的结构化空间在机器学习中做降维处理？',
                        src:
                            '重学线性代数/html/__270329__05 _ 线性空间：如何通过向量的结构化空间在机器学习中做降维处理？.html',
                        audio: ''
                    },
                    {
                        id: 'l66sepkrl8v',
                        title:
                            '06 | 线性无关：如何理解向量在N维空间的几何意义？',
                        src:
                            '重学线性代数/html/__270884__06 _ 线性无关：如何理解向量在N维空间的几何意义？.html',
                        audio: ''
                    },
                    {
                        id: 'm6jvo57vo6l',
                        title:
                            '07 | 基和秩：为什么说它表达了向量空间中“有用”的向量个数？',
                        src:
                            '重学线性代数/html/__271943__07 _ 基和秩：为什么说它表达了向量空间中“有用”的向量个数？.html',
                        audio: ''
                    },
                    {
                        id: 'vj4xkkn53sh',
                        title:
                            '08 | 线性映射：如何从坐标系角度理解两个向量空间之间的函数？',
                        src:
                            '重学线性代数/html/__272815__08 _ 线性映射：如何从坐标系角度理解两个向量空间之间的函数？.html',
                        audio: ''
                    },
                    {
                        id: '3s3cx50j821',
                        title:
                            '09 | 仿射空间：如何在图形的平移操作中大显身手？',
                        src:
                            '重学线性代数/html/__274222__09 _ 仿射空间：如何在图形的平移操作中大显身手？.html',
                        audio: ''
                    },
                    {
                        id: 's4rz91oedb3',
                        title:
                            '10 | 解析几何：为什么说它是向量从抽象到具象的表达？',
                        src:
                            '重学线性代数/html/__274958__10 _ 解析几何：为什么说它是向量从抽象到具象的表达？.html',
                        audio: ''
                    },
                    {
                        id: 'evwi5wauh6i',
                        title: '基础通关 | 线性代数5道典型例题及解析',
                        src:
                            '重学线性代数/html/__275700__基础通关 _ 线性代数5道典型例题及解析.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '0s6kdervcvi',
                title: '应用篇',
                subList: [
                    {
                        id: 'rjd1xn4oj5k',
                        title: '11 | 如何运用线性代数方法解决图论问题？',
                        src:
                            '重学线性代数/html/__276274__11 _ 如何运用线性代数方法解决图论问题？.html',
                        audio: ''
                    },
                    {
                        id: 'm7ohyb4hsrq',
                        title:
                            '12 | 如何通过矩阵转换让3D图形显示到二维屏幕上？',
                        src:
                            '重学线性代数/html/__277606__12 _ 如何通过矩阵转换让3D图形显示到二维屏幕上？.html',
                        audio: ''
                    },
                    {
                        id: 'd2qn7rnaqfj',
                        title:
                            '13 | 如何通过有限向量空间加持的希尔密码，提高密码被破译的难度？',
                        src:
                            '重学线性代数/html/__278373__13 _ 如何通过有限向量空间加持的希尔密码，提高密码被破译的难度？.html',
                        audio: ''
                    },
                    {
                        id: 'akfwq4msjc5',
                        title:
                            '14 | 如何在深度学习中运用数值代数的迭代法做训练？',
                        src:
                            '重学线性代数/html/__279476__14 _ 如何在深度学习中运用数值代数的迭代法做训练？.html',
                        audio: ''
                    },
                    {
                        id: 'td3muab32ma',
                        title: '15 | 如何从计算机的角度来理解线性代数？',
                        src:
                            '重学线性代数/html/__280657__15 _ 如何从计算机的角度来理解线性代数？.html',
                        audio: ''
                    },
                    {
                        id: 'kzdjepo8ho9',
                        title: '强化通关 | 线性代数水平测试20题',
                        src:
                            '重学线性代数/html/__281200__强化通关 _ 线性代数水平测试20题.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '23xwzubrkq8',
                title: '结束语',
                subList: [
                    {
                        id: 'hwitagrf8bg',
                        title: '结束语 | 和数学打交道这么多年，我的三点感悟',
                        src:
                            '重学线性代数/html/__281646__结束语 _ 和数学打交道这么多年，我的三点感悟.html',
                        audio: ''
                    }
                ]
            }
        ]
    },

    //编译原理之美
    {
        title: '编译原理之美',
        id: 'whis7d21y7r',
        type: 'cs',
        cid: '100034101',
        subTitle: '手把手教你实现一个编译器',
        authorName: '宫文学',
        authorInfo: '北京物演科技CEO',
        divided: true,
        contents: [
            {
                id: 't2lqg21gdt3',
                title: '开篇词',
                subList: [
                    {
                        id: 'fen94n4wxdg',
                        title: '开篇词-为什么你要学习编译原理？',
                        src:
                            './编译原理之美/html/开篇词-为什么你要学习编译原理？.html'
                    }
                ]
            },
            {
                id: 'r05efu7xwyg',
                title: '实现一门脚本语言·原理篇',
                subList: [
                    {
                        id: 'mosr9aon3cu',
                        title: '01-理解代码：编译器的前端技术',
                        src:
                            './编译原理之美/html/01-理解代码：编译器的前端技术.html'
                    },
                    {
                        id: 'yyql8uhwjdv',
                        title: '02-正则文法和有限自动机：纯手工打造词法分析器',
                        src:
                            './编译原理之美/html/02-正则文法和有限自动机：纯手工打造词法分析器.html'
                    },
                    {
                        id: '62lshm4ra3c',
                        title: '03-语法分析（一）：纯手工打造公式计算器',
                        src:
                            './编译原理之美/html/03-语法分析（一）：纯手工打造公式计算器.html'
                    },
                    {
                        id: 'dk5ljsfan1y',
                        title: '04-语法分析（二）：解决二元表达式中的难点',
                        src:
                            './编译原理之美/html/04-语法分析（二）：解决二元表达式中的难点.html'
                    },
                    {
                        id: '2yp81yoo61f',
                        title: '05-语法分析（三）：实现一门简单的脚本语言',
                        src:
                            './编译原理之美/html/05-语法分析（三）：实现一门简单的脚本语言.html'
                    },
                    {
                        id: 'ozyrnxwjsx0',
                        title:
                            '06-编译器前端工具（一）：用Antlr生成词法、语法分析器',
                        src:
                            './编译原理之美/html/06-编译器前端工具（一）：用Antlr生成词法、语法分析器.html'
                    },
                    {
                        id: '0dwzvn6nmah',
                        title: '07-编译器前端工具（二）：用Antlr重构脚本语言',
                        src:
                            './编译原理之美/html/07-编译器前端工具（二）：用Antlr重构脚本语言.html'
                    },
                    {
                        id: '9tpxtyw60yw',
                        title: '08-作用域和生存期：实现块作用域和函数',
                        src:
                            './编译原理之美/html/08-作用域和生存期：实现块作用域和函数.html'
                    },
                    {
                        id: 'ef0i102kyhl',
                        title: '09-面向对象：实现数据和方法的封装',
                        src:
                            './编译原理之美/html/09-面向对象：实现数据和方法的封装.html'
                    },
                    {
                        id: '4bd1ehnrh0z',
                        title: '10-闭包：理解了原理，它就不反直觉了',
                        src:
                            './编译原理之美/html/10-闭包：理解了原理，它就不反直觉了.html'
                    },
                    {
                        id: 'cgpyfwpyold',
                        title:
                            '11-语义分析（上）：如何建立一个完善的类型系统？',
                        src:
                            './编译原理之美/html/11-语义分析（上）：如何建立一个完善的类型系统？.html'
                    },
                    {
                        id: 'oxz43zl0o7n',
                        title:
                            '12-语义分析（下）：如何做上下文相关情况的处理？',
                        src:
                            './编译原理之美/html/12-语义分析（下）：如何做上下文相关情况的处理？.html'
                    },
                    {
                        id: 'mwy9dlqd9y4',
                        title: '13-继承和多态：面向对象运行期的动态特性',
                        src:
                            './编译原理之美/html/13-继承和多态：面向对象运行期的动态特性.html'
                    }
                ]
            },
            {
                id: 'rtztyca07j4',
                title: '实现一门脚本语言·应用篇',
                subList: [
                    {
                        id: 'hizc7mapive',
                        title:
                            '14-前端技术应用（一）：如何透明地支持数据库分库分表？',
                        src:
                            './编译原理之美/html/14-前端技术应用（一）：如何透明地支持数据库分库分表？.html'
                    },
                    {
                        id: 'k6v9tqnalsq',
                        title: '15-前端技术应用（二）：如何设计一个报表工具？',
                        src:
                            './编译原理之美/html/15-前端技术应用（二）：如何设计一个报表工具？.html'
                    }
                ]
            },
            {
                id: 'cpsg5ebdta7',
                title: '实现一门脚本语言·算法篇',
                subList: [
                    {
                        id: 'bsjdym368ca',
                        title: '16-NFA和DFA：如何自己实现一个正则表达式工具？',
                        src:
                            './编译原理之美/html/16-NFA和DFA：如何自己实现一个正则表达式工具？.html'
                    },
                    {
                        id: 'fjtd1xsgeoj',
                        title: '17-First和Follow集合：用LL算法推演一个实例',
                        src:
                            './编译原理之美/html/17-First和Follow集合：用LL算法推演一个实例.html'
                    },
                    {
                        id: 'oe6wuqtrus2',
                        title: '18-移进和规约：用LR算法推演一个实例',
                        src:
                            './编译原理之美/html/18-移进和规约：用LR算法推演一个实例.html'
                    }
                ]
            },
            {
                id: 'szhlmhdz7av',
                title: '实现一门脚本语言·热点答疑与用户故事',
                subList: [
                    {
                        id: 'v2jqvs79lgi',
                        title:
                            '19-案例总结与热点问题答疑：对于左递归的语法，为什么我的推导不是左递归的？',
                        src:
                            './编译原理之美/html/19-案例总结与热点问题答疑：对于左递归的语法，为什么我的推导不是左递归的？.html'
                    },
                    {
                        id: 'dp2uxermj7i',
                        title: '用户故事-因为热爱，所以坚持',
                        src:
                            './编译原理之美/html/用户故事-因为热爱，所以坚持.html'
                    }
                ]
            },
            {
                id: '15nsby9j4pt',
                title: '编译原理·期中考试周',
                subList: [
                    {
                        id: 'mymx0bti7d4',
                        title: '期中考试-来赴一场100分的约定吧！',
                        src:
                            './编译原理之美/html/期中考试-来赴一场100分的约定吧！.html'
                    }
                ]
            },
            {
                id: '4dnjc0xujxu',
                title: '实现一门编译型语言·原理篇',
                subList: [
                    {
                        id: 'ad6v1cr3ln4',
                        title: '20-高效运行：编译器的后端技术',
                        src:
                            './编译原理之美/html/20-高效运行：编译器的后端技术.html'
                    },
                    {
                        id: 'gv89es2ehkg',
                        title:
                            '21-运行时机制：突破现象看本质，透过语法看运行时',
                        src:
                            './编译原理之美/html/21-运行时机制：突破现象看本质，透过语法看运行时.html'
                    },
                    {
                        id: 'dxlu0xiv447',
                        title: '22-生成汇编代码（一）：汇编语言其实不难学',
                        src:
                            './编译原理之美/html/22-生成汇编代码（一）：汇编语言其实不难学.html'
                    },
                    {
                        id: 'izpix3gsn4y',
                        title: '加餐-汇编代码编程与栈帧管理',
                        src:
                            './编译原理之美/html/加餐-汇编代码编程与栈帧管理.html'
                    },
                    {
                        id: 'z66ixh21lw9',
                        title: '23-生成汇编代码（二）：把脚本编译成可执行文件',
                        src:
                            './编译原理之美/html/23-生成汇编代码（二）：把脚本编译成可执行文件.html'
                    },
                    {
                        id: 'q0jwt4a9igo',
                        title: '24-中间代码：兼容不同的语言和硬件',
                        src:
                            './编译原理之美/html/24-中间代码：兼容不同的语言和硬件.html'
                    },
                    {
                        id: 'pu6gyn9s8o2',
                        title: '25-后端技术的重用：LLVM不仅仅让你高效',
                        src:
                            './编译原理之美/html/25-后端技术的重用：LLVM不仅仅让你高效.html'
                    },
                    {
                        id: 'nui9r5iouic',
                        title: '26-生成IR：实现静态编译的语言',
                        src:
                            './编译原理之美/html/26-生成IR：实现静态编译的语言.html'
                    },
                    {
                        id: 'irel5xmuf2i',
                        title: '27-代码优化：为什么你的代码比他的更高效？',
                        src:
                            './编译原理之美/html/27-代码优化：为什么你的代码比他的更高效？.html'
                    },
                    {
                        id: 'rjeip37a91v',
                        title: '28-数据流分析：你写的程序，它更懂',
                        src:
                            './编译原理之美/html/28-数据流分析：你写的程序，它更懂.html'
                    },
                    {
                        id: 'm38avsbu7aq',
                        title:
                            '29-目标代码的生成和优化（一）：如何适应各种硬件架构？',
                        src:
                            './编译原理之美/html/29-目标代码的生成和优化（一）：如何适应各种硬件架构？.html'
                    },
                    {
                        id: 'ptr63wme0mf',
                        title:
                            '30-目标代码的生成和优化（二）：如何适应各种硬件架构？',
                        src:
                            './编译原理之美/html/30-目标代码的生成和优化（二）：如何适应各种硬件架构？.html'
                    }
                ]
            },
            {
                id: '9aopiqp2378',
                title: '实现一门编译型语言·应用篇',
                subList: [
                    {
                        id: 'nxcnqcvm9h6',
                        title:
                            '31-内存计算：对海量数据做计算，到底可以有多快？',
                        src:
                            './编译原理之美/html/31-内存计算：对海量数据做计算，到底可以有多快？.html'
                    },
                    {
                        id: 'd07uh0sjtiq',
                        title: '32-字节码生成：为什么Spring技术很强大？',
                        src:
                            './编译原理之美/html/32-字节码生成：为什么Spring技术很强大？.html'
                    }
                ]
            },
            {
                id: '6auy91mnf0l',
                title: '实现一门编译型语言·扩展篇',
                subList: [
                    {
                        id: 'h4jvqs97an5',
                        title: '33-垃圾收集：能否不停下整个世界？',
                        src:
                            './编译原理之美/html/33-垃圾收集：能否不停下整个世界？.html'
                    },
                    {
                        id: 'ih92oo56lgs',
                        title: '34-运行时优化：即时编译的原理和作用',
                        src:
                            './编译原理之美/html/34-运行时优化：即时编译的原理和作用.html'
                    },
                    {
                        id: 'pmj5mqm0acl',
                        title:
                            '35-案例总结与热点问题答疑：后端部分真的比前端部分难吗？',
                        src:
                            './编译原理之美/html/35-案例总结与热点问题答疑：后端部分真的比前端部分难吗？.html'
                    }
                ]
            },
            {
                id: 'qmn1iisqdlx',
                title: '面向未来的编程语言',
                subList: [
                    {
                        id: 'plm6jw7nz05',
                        title: '36-当前技术的发展趋势以及其对编译技术的影响',
                        src:
                            './编译原理之美/html/36-当前技术的发展趋势以及其对编译技术的影响.html'
                    },
                    {
                        id: 'qc3f421qmsr',
                        title: '37-云编程：云计算会如何改变编程模式？',
                        src:
                            './编译原理之美/html/37-云编程：云计算会如何改变编程模式？.html'
                    },
                    {
                        id: 'nvuxd9eisjb',
                        title: '38-元编程：一边写程序，一边写语言',
                        src:
                            './编译原理之美/html/38-元编程：一边写程序，一边写语言.html'
                    }
                ]
            },
            {
                id: 'k3n9rokwzdx',
                title: '结束语',
                subList: [
                    {
                        id: 'z3327sz3q2e',
                        title: '结束语-用程序语言，推动这个世界的演化',
                        src: ''
                    }
                ]
            }
        ]
    },
    //编译原理实战课
    {
        id: '70o67t2312u',
        type: 'cs',
        cid: '314',
        title: '编译原理实战课',
        subTitle: '带你吃透编译技术核心概念与算法',
        authorName: '宫文学',
        authorInfo: '北京原点代码CEO',
        contents: [
            {
                id: '93ua3ojhx40',
                title: '课前必读',
                subList: [
                    {
                        id: 'w1wp3bwnr27',
                        title: '开篇词 | 在真实世界的编译器中游历',
                        src:
                            '编译原理实战课/html/__242308__开篇词 _ 在真实世界的编译器中游历.html',
                        audio: ''
                    },
                    {
                        id: 't3e2mwxgadf',
                        title: '学习指南 | 如何学习这门编译原理实战课？',
                        src:
                            '编译原理实战课/html/__242577__学习指南 _ 如何学习这门编译原理实战课？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'bt76f0l3yl4',
                title: '预备知识篇',
                subList: [
                    {
                        id: '8p649v8bq7m',
                        title: '01 | 编译的全过程都悄悄做了哪些事情？',
                        src:
                            '编译原理实战课/html/__242479__01 _ 编译的全过程都悄悄做了哪些事情？.html',
                        audio: ''
                    },
                    {
                        id: 'iksuu5xcf4u',
                        title: '02 | 词法分析：用两种方式构造有限自动机',
                        src:
                            '编译原理实战课/html/__243685__02 _ 词法分析：用两种方式构造有限自动机.html',
                        audio: ''
                    },
                    {
                        id: 'wu2raf2ec3h',
                        title: '03 | 语法分析：两个基本功和两种算法思路',
                        src:
                            '编译原理实战课/html/__244906__03 _ 语法分析：两个基本功和两种算法思路.html',
                        audio: ''
                    },
                    {
                        id: 'jfwz9x7onk6',
                        title: '04 | 语义分析：让程序符合语义规则',
                        src:
                            '编译原理实战课/html/__245754__04 _ 语义分析：让程序符合语义规则.html',
                        audio: ''
                    },
                    {
                        id: 'ome6kcegr8c',
                        title: '05 | 运行时机制：程序如何运行，你有发言权',
                        src:
                            '编译原理实战课/html/__246281__05 _ 运行时机制：程序如何运行，你有发言权.html',
                        audio: ''
                    },
                    {
                        id: '6nz1abd4wmx',
                        title: '06 | 中间代码：不是只有一副面孔',
                        src:
                            '编译原理实战课/html/__247700__06 _ 中间代码：不是只有一副面孔.html',
                        audio: ''
                    },
                    {
                        id: 'ny9v9n7izt3',
                        title:
                            '07 | 代码优化：跟编译器做朋友，让你的代码飞起来',
                        src:
                            '编译原理实战课/html/__248770__07 _ 代码优化：跟编译器做朋友，让你的代码飞起来.html',
                        audio: ''
                    },
                    {
                        id: 'dycco3uotew',
                        title: '08 | 代码生成：如何实现机器相关的优化？',
                        src:
                            '编译原理实战课/html/__249261__08 _ 代码生成：如何实现机器相关的优化？.html',
                        audio: ''
                    },
                    {
                        id: 'x71k65hrjcs',
                        title: '知识地图 | 一起来复习编译技术核心概念与算法',
                        src:
                            '编译原理实战课/html/__250604__知识地图 _ 一起来复习编译技术核心概念与算法.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'j9pk9k5xb12',
                title: '真实编译器解析篇',
                subList: [
                    {
                        id: 'lzrqbui3pnt',
                        title:
                            '09 | Java编译器（一）：手写的编译器有什么优势？',
                        src:
                            '编译原理实战课/html/__251937__09 _ Java编译器（一）：手写的编译器有什么优势？.html',
                        audio: ''
                    },
                    {
                        id: '9tfyuokgapq',
                        title:
                            '10 | Java编译器（二）：语法分析之后，还要做些什么？',
                        src:
                            '编译原理实战课/html/__252828__10 _ Java编译器（二）：语法分析之后，还要做些什么？.html',
                        audio: ''
                    },
                    {
                        id: 'rmec3z2lyfw',
                        title: '11 | Java编译器（三）：属性分析和数据流分析',
                        src:
                            '编译原理实战课/html/__253750__11 _ Java编译器（三）：属性分析和数据流分析.html',
                        audio: ''
                    },
                    {
                        id: 'll7zdpv6dso',
                        title: '12 | Java编译器（四）：去除语法糖和生成字节码',
                        src:
                            '编译原理实战课/html/__255034__12 _ Java编译器（四）：去除语法糖和生成字节码.html',
                        audio: ''
                    },
                    {
                        id: 'fcifggzedeg',
                        title: '13 | Java JIT编译器（一）：动手修改Graal编译器',
                        src:
                            '编译原理实战课/html/__255730__13 _ Java JIT编译器（一）：动手修改Graal编译器.html',
                        audio: ''
                    },
                    {
                        id: 'rqdcktkqh07',
                        title:
                            '14 | Java JIT编译器（二）：Sea of Nodes为何如此强大？',
                        src:
                            '编译原理实战课/html/__256914__14 _ Java JIT编译器（二）：Sea of Nodes为何如此强大？.html',
                        audio: ''
                    },
                    {
                        id: 'qswu0gc697w',
                        title:
                            '15 | Java JIT编译器（三）：探究内联和逃逸分析的算法原理',
                        src:
                            '编译原理实战课/html/__257504__15 _ Java JIT编译器（三）：探究内联和逃逸分析的算法原理.html',
                        audio: ''
                    },
                    {
                        id: 'aql8jjxhar8',
                        title:
                            '16 | Java JIT编译器（四）：Graal的后端是如何工作的？',
                        src:
                            '编译原理实战课/html/__258162__16 _ Java JIT编译器（四）：Graal的后端是如何工作的？.html',
                        audio: ''
                    },
                    {
                        id: 'ts9j5ebbk2i',
                        title:
                            '17 | Python编译器（一）：如何用工具生成编译器？',
                        src:
                            '编译原理实战课/html/__259465__17 _ Python编译器（一）：如何用工具生成编译器？.html',
                        audio: ''
                    },
                    {
                        id: '4lpeeb1noka',
                        title: '18 | Python编译器（二）：从AST到字节码',
                        src:
                            '编译原理实战课/html/__260354__18 _ Python编译器（二）：从AST到字节码.html',
                        audio: ''
                    },
                    {
                        id: 'oxxi5n4rc4k',
                        title: '19 | Python编译器（三）：运行时机制',
                        src:
                            '编译原理实战课/html/__261063__19 _ Python编译器（三）：运行时机制.html',
                        audio: ''
                    },
                    {
                        id: 'qcmqjxbu25w',
                        title:
                            '20 | JavaScript编译器（一）：V8的解析和编译过程',
                        src:
                            '编译原理实战课/html/__262041__20 _ JavaScript编译器（一）：V8的解析和编译过程.html',
                        audio: ''
                    },
                    {
                        id: 'uoyh5tybi56',
                        title:
                            '21 | JavaScript编译器（二）：V8的解释器和优化编译器',
                        src:
                            '编译原理实战课/html/__263523__21 _ JavaScript编译器（二）：V8的解释器和优化编译器.html',
                        audio: ''
                    },
                    {
                        id: '855eo9mwtn6',
                        title:
                            '22 | Julia编译器（一）：如何让动态语言性能很高？',
                        src:
                            '编译原理实战课/html/__264333__22 _ Julia编译器（一）：如何让动态语言性能很高？.html',
                        audio: ''
                    },
                    {
                        id: 'keyzpkbaraq',
                        title:
                            '23 | Julia编译器（二）：如何利用LLVM的优化和后端功能？',
                        src:
                            '编译原理实战课/html/__264643__23 _ Julia编译器（二）：如何利用LLVM的优化和后端功能？.html',
                        audio: ''
                    },
                    {
                        id: 'eq4ql1gproc',
                        title: '24 | Go语言编译器：把它当作教科书吧',
                        src:
                            '编译原理实战课/html/__266379__24 _ Go语言编译器：把它当作教科书吧.html',
                        audio: ''
                    },
                    {
                        id: 'fg8asuu0u7h',
                        title:
                            '25 | MySQL编译器（一）：解析一条SQL语句的执行过程',
                        src:
                            '编译原理实战课/html/__266790__25 _ MySQL编译器（一）：解析一条SQL语句的执行过程.html',
                        audio: ''
                    },
                    {
                        id: '9ra09y8o64c',
                        title:
                            '26 | MySQL编译器（二）：编译技术如何帮你提升数据库性能？',
                        src:
                            '编译原理实战课/html/__267917__26 _ MySQL编译器（二）：编译技术如何帮你提升数据库性能？.html',
                        audio: ''
                    },
                    {
                        id: 'u3aqj377p12',
                        title: '热点问题答疑 | 如何吃透7种真实的编译器？',
                        src:
                            '编译原理实战课/html/__268852__热点问题答疑 _ 如何吃透7种真实的编译器？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'idwla10eei6',
                title: '期中复习周',
                subList: [
                    {
                        id: '7j47ae1xrlp',
                        title: '划重点 | 7种编译器的核心概念与算法',
                        src:
                            '编译原理实战课/html/__270368__划重点 _ 7种编译器的核心概念与算法.html',
                        audio: ''
                    },
                    {
                        id: 'cupzeburs4r',
                        title: '期中考试 | 这些编译原理知识，你都掌握了吗？',
                        src:
                            '编译原理实战课/html/__270456__期中考试 _ 这些编译原理知识，你都掌握了吗？.html',
                        audio: ''
                    },
                    {
                        id: 'pga655anwi0',
                        title:
                            '用户故事 | 易昊：程序员不止有Bug和加班，还有诗和远方',
                        src:
                            '编译原理实战课/html/__270504__用户故事 _ 易昊：程序员不止有Bug和加班，还有诗和远方.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'rwihfr8i579',
                title: '现代语言设计篇',
                subList: [
                    {
                        id: '3g7hjr2n4qn',
                        title: '27 | 课前导读：学习现代语言设计的正确姿势',
                        src:
                            '编译原理实战课/html/__273094__27 _ 课前导读：学习现代语言设计的正确姿势.html',
                        audio: ''
                    },
                    {
                        id: '5tif11p88d4',
                        title: '28 | 前端总结：语言设计也有人机工程学',
                        src:
                            '编译原理实战课/html/__273418__28 _ 前端总结：语言设计也有人机工程学.html',
                        audio: ''
                    },
                    {
                        id: '2naw4lcgzxg',
                        title: '29 | 中端总结：不遗余力地进行代码优化',
                        src:
                            '编译原理实战课/html/__273433__29 _ 中端总结：不遗余力地进行代码优化.html',
                        audio: ''
                    },
                    {
                        id: 'x6lqglpvrgf',
                        title: '30 | 后端总结：充分发挥硬件的能力',
                        src:
                            '编译原理实战课/html/__274909__30 _ 后端总结：充分发挥硬件的能力.html',
                        audio: ''
                    },
                    {
                        id: '2kuj4ws8ljo',
                        title: '31 | 运行时（一）：从0到语言级的虚拟化',
                        src:
                            '编译原理实战课/html/__275601__31 _ 运行时（一）：从0到语言级的虚拟化.html',
                        audio: ''
                    },
                    {
                        id: 'o9fqvkno3a2',
                        title:
                            '32 | 运行时（二）：垃圾收集与语言的特性有关吗？',
                        src:
                            '编译原理实战课/html/__277707__32 _ 运行时（二）：垃圾收集与语言的特性有关吗？.html',
                        audio: ''
                    },
                    {
                        id: '5mry6jactnt',
                        title:
                            '33 | 并发中的编译技术（一）：如何从语言层面支持线程？',
                        src:
                            '编译原理实战课/html/__279019__33 _ 并发中的编译技术（一）：如何从语言层面支持线程？.html',
                        audio: ''
                    },
                    {
                        id: 'gx4cxpoq7q4',
                        title:
                            '34 | 并发中的编译技术（二）：如何从语言层面支持协程？',
                        src:
                            '编译原理实战课/html/__280269__34 _ 并发中的编译技术（二）：如何从语言层面支持协程？.html',
                        audio: ''
                    },
                    {
                        id: 't20wacxcgye',
                        title:
                            '35 | 并发中的编译技术（三）：Erlang语言厉害在哪里？',
                        src:
                            '编译原理实战课/html/__280663__35 _ 并发中的编译技术（三）：Erlang语言厉害在哪里？.html',
                        audio: ''
                    },
                    {
                        id: 'lj59wj89qc8',
                        title: '36 | 高级特性（一）：揭秘元编程的实现机制',
                        src:
                            '编译原理实战课/html/__282919__36 _ 高级特性（一）：揭秘元编程的实现机制.html',
                        audio: ''
                    },
                    {
                        id: 'z00o1dqeqxm',
                        title: '37 | 高级特性（二）：揭秘泛型编程的实现机制',
                        src:
                            '编译原理实战课/html/__283229__37 _ 高级特性（二）：揭秘泛型编程的实现机制.html',
                        audio: ''
                    },
                    {
                        id: '4vnaqrhhmva',
                        title: '38 | 综合实现（一）：如何实现面向对象编程？',
                        src:
                            '编译原理实战课/html/__284443__38 _ 综合实现（一）：如何实现面向对象编程？.html',
                        audio: ''
                    },
                    {
                        id: '6s92xefb2dk',
                        title: '39 | 综合实现（二）：如何实现函数式编程？',
                        src:
                            '编译原理实战课/html/__285636__39 _ 综合实现（二）：如何实现函数式编程？.html',
                        audio: ''
                    },
                    {
                        id: 'lsl869u1m3f',
                        title: '40 | 成果检验：方舟编译器的优势在哪里？',
                        src:
                            '编译原理实战课/html/__286097__40 _ 成果检验：方舟编译器的优势在哪里？.html',
                        audio: ''
                    },
                    {
                        id: 'lrc6zb1hdxa',
                        title: '期末答疑与总结 | 再次审视学习编译原理的作用',
                        src:
                            '编译原理实战课/html/__286931__期末答疑与总结 _ 再次审视学习编译原理的作用.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'ot0eaf9lb57',
                title: '结束语',
                subList: [
                    {
                        id: '342m14vox4s',
                        title: '结束语 | 实战是唯一标准！',
                        src:
                            '编译原理实战课/html/__289262__结束语 _ 实战是唯一标准！.html',
                        audio: ''
                    },
                    {
                        id: 'o4ut1b79n9k',
                        title:
                            '期末考试 | “编译原理实战课”100分试卷等你来挑战！',
                        src:
                            '编译原理实战课/html/__289675__期末考试 _ “编译原理实战课”100分试卷等你来挑战！.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'qbcsfzo1qio',
                title: '不定期加餐',
                subList: [
                    {
                        id: 'd0rdtavu9ce',
                        title:
                            '不定期加餐1 | 远程办公，需要你我具备什么样的素质？',
                        src:
                            '编译原理实战课/html/__251164__不定期加餐1 _ 远程办公，需要你我具备什么样的素质？.html',
                        audio: ''
                    },
                    {
                        id: 'wzt4e14n341',
                        title:
                            '不定期加餐2 | 学习技术的过程，其实是训练心理素质的过程',
                        src:
                            '编译原理实战课/html/__269322__不定期加餐2 _ 学习技术的过程，其实是训练心理素质的过程.html',
                        audio: ''
                    },
                    {
                        id: 'kao3w2em0cx',
                        title: '不定期加餐3 | 这几年，打动我的两本好书',
                        src:
                            '编译原理实战课/html/__281269__不定期加餐3 _ 这几年，打动我的两本好书.html',
                        audio: ''
                    },
                    {
                        id: 'esipd4vp0w3',
                        title:
                            '不定期加餐4 | 从身边的牛人身上，我学到的一些优秀品质',
                        src:
                            '编译原理实战课/html/__288798__不定期加餐4 _ 从身边的牛人身上，我学到的一些优秀品质.html',
                        audio: ''
                    },
                    {
                        id: '1dzqvvk56xd',
                        title:
                            '不定期加餐5 | 借助实例，探究C++编译器的内部机制',
                        src:
                            '编译原理实战课/html/__309549__不定期加餐5 _ 借助实例，探究C++编译器的内部机制.html',
                        audio: ''
                    }
                ]
            }
        ]
    },

    //软件工程之美
    {
        id: 'bgnr51757dh',
        type: 'cs',
        cid: '100023701',
        title: '软件工程之美',
        subTitle: '重新理解软件工程',
        authorName: '宝玉',
        authorInfo: 'Groupon资深工程师，微软最有价值专家',
        contents: [
            {
                id: 'lwamfygwyto',
                title: '课前必读',
                subList: [
                    {
                        id: '05zy21140b8',
                        title: '开篇词 | 你为什么应该学好软件工程？',
                        src:
                            './软件工程之美/html/00开篇词你为什么应该学好软件工程.html',
                        audio:
                            './软件工程之美/audio/00开篇词你为什么应该学好软件工程.mp3'
                    },
                    {
                        id: 'im8o77lpyn0',
                        title:
                            '特别放送 | 从软件工程的角度解读任正非的新年公开信',
                        src:
                            './软件工程之美/html/特别放送从软件工程的角度解读任正非的新年公开信.html',
                        audio:
                            './软件工程之美/audio/特别放送从软件工程的角度解读任正非的新年公开信.mp3'
                    },
                    {
                        id: 'zijzs17erfk',
                        title: '学习攻略 | 怎样学好软件工程？',
                        src:
                            './软件工程之美/html/学习攻略怎样学好软件工程.html',
                        audio:
                            './软件工程之美/audio/学习攻略怎样学好软件工程.mp3'
                    }
                ]
            },
            {
                id: 'pmz8q4bo2tg',
                title: '基础理论',
                subList: [
                    {
                        id: '71hii914zej',
                        title: '01 | 到底应该怎样理解软件工程？',
                        src:
                            './软件工程之美/html/01到底应该怎样理解软件工程.html',
                        audio:
                            './软件工程之美/audio/01到底应该怎样理解软件工程.mp3'
                    },
                    {
                        id: 'tazerh10l0q',
                        title: '02 | 工程思维：把每件事都当作一个项目来推进',
                        src:
                            './软件工程之美/html/02工程思维把每件事都当作一个项目来推进.html',
                        audio:
                            './软件工程之美/audio/02工程思维把每件事都当作一个项目来推进.mp3'
                    },
                    {
                        id: '6s04ofqo3ef',
                        title:
                            '03 | 瀑布模型：像工厂流水线一样把软件开发分层化',
                        src:
                            './软件工程之美/html/03瀑布模型像工厂流水线一样把软件开发分层化.html',
                        audio:
                            './软件工程之美/audio/03瀑布模型像工厂流水线一样把软件开发分层化.mp3'
                    },
                    {
                        id: 'rcspmj679kk',
                        title: '04 | 瀑布模型之外，还有哪些开发模型？',
                        src:
                            './软件工程之美/html/04瀑布模型之外还有哪些开发模型.html',
                        audio:
                            './软件工程之美/audio/04瀑布模型之外还有哪些开发模型.mp3'
                    },
                    {
                        id: 'bw2tukt66vp',
                        title: '05 | 敏捷开发到底是想解决什么问题？',
                        src:
                            './软件工程之美/html/05敏捷开发到底是想解决什么问题.html',
                        audio:
                            './软件工程之美/audio/05敏捷开发到底是想解决什么问题.mp3'
                    },
                    {
                        id: '1umjtns5wiq',
                        title: '06 | 大厂都在用哪些敏捷方法？（上）',
                        src:
                            './软件工程之美/html/06大厂都在用哪些敏捷方法上.html',
                        audio:
                            './软件工程之美/audio/06大厂都在用哪些敏捷方法上.mp3'
                    },
                    {
                        id: 'nv3t95wwryk',
                        title: '07 | 大厂都在用哪些敏捷方法？（下）',
                        src:
                            './软件工程之美/html/07大厂都在用哪些敏捷方法下.html',
                        audio:
                            './软件工程之美/audio/07大厂都在用哪些敏捷方法下.mp3'
                    },
                    {
                        id: '4q5grjx945y',
                        title: '08 | 怎样平衡软件质量与时间成本范围的关系？',
                        src:
                            './软件工程之美/html/08怎样平衡软件质量与时间成本范围的关系.html',
                        audio:
                            './软件工程之美/audio/08怎样平衡软件质量与时间成本范围的关系.mp3'
                    },
                    {
                        id: 'fe579fcj2iu',
                        title: '“一问一答”第1期 | 30个软件开发常见问题解决策略',
                        src:
                            './软件工程之美/html/一问一答第1期30个软件开发常见问题解决策略.html',
                        audio:
                            './软件工程之美/audio/一问一答第1期30个软件开发常见问题解决策略.mp3'
                    }
                ]
            },
            {
                id: '82l8hann9gy',
                title: '项目规划篇',
                subList: [
                    {
                        id: 'rzkncmz3o6f',
                        title: '09 | 为什么软件工程项目普遍不重视可行性分析？',
                        src:
                            './软件工程之美/html/09为什么软件工程项目普遍不重视可行性分析.html',
                        audio:
                            './软件工程之美/audio/09为什么软件工程项目普遍不重视可行性分析.mp3'
                    },
                    {
                        id: 'shme5hn5o6w',
                        title: '10 | 如果你想技术转管理，先来试试管好一个项目',
                        src:
                            './软件工程之美/html/10如果你想技术转管理先来试试管好一个项目.html',
                        audio:
                            './软件工程之美/audio/10如果你想技术转管理先来试试管好一个项目.mp3'
                    },
                    {
                        id: '5mllt458a9l',
                        title: '11 | 项目计划：代码未动，计划先行',
                        src:
                            './软件工程之美/html/11项目计划代码未动计划先行.html',
                        audio:
                            './软件工程之美/audio/11项目计划代码未动计划先行.mp3'
                    },
                    {
                        id: 'dsdl12x25wq',
                        title:
                            '12 | 流程和规范：红绿灯不是约束，而是用来提高效率',
                        src:
                            './软件工程之美/html/12流程和规范红绿灯不是约束而是用来提高效率.html',
                        audio:
                            './软件工程之美/audio/12流程和规范红绿灯不是约束而是用来提高效率.mp3'
                    },
                    {
                        id: 'n52l80czkdp',
                        title: '13 | 白天开会，加班写代码的节奏怎么破？',
                        src:
                            './软件工程之美/html/13白天开会加班写代码的节奏怎么破.html',
                        audio:
                            './软件工程之美/audio/13白天开会加班写代码的节奏怎么破.mp3'
                    },
                    {
                        id: 'tv2ih6f84pg',
                        title:
                            '14 | 项目管理工具：一切管理问题，都应思考能否通过工具解决',
                        src:
                            './软件工程之美/html/14项目管理工具一切管理问题都应思考能否通过工具解决.html',
                        audio:
                            './软件工程之美/audio/14项目管理工具一切管理问题都应思考能否通过工具解决.mp3'
                    },
                    {
                        id: '341alg8u5p7',
                        title: '15 | 风险管理：不能盲目乐观，凡事都应该有B计划',
                        src:
                            './软件工程之美/html/15风险管理不能盲目乐观凡事都应该有B计划.html',
                        audio:
                            './软件工程之美/audio/15风险管理不能盲目乐观凡事都应该有B计划.mp3'
                    },
                    {
                        id: '1zpdvjloxse',
                        title: '16 | 怎样才能写好项目文档？',
                        src: './软件工程之美/html/16怎样才能写好项目文档.html',
                        audio: './软件工程之美/audio/16怎样才能写好项目文档.mp3'
                    }
                ]
            },
            {
                id: 'vdjbding4g7',
                title: '需求分析篇',
                subList: [
                    {
                        id: 'lnmbdkfqdlt',
                        title: '17 | 需求分析到底要分析什么？怎么分析？',
                        src:
                            './软件工程之美/html/17需求分析到底要分析什么怎么分析.html',
                        audio:
                            './软件工程之美/audio/17需求分析到底要分析什么怎么分析.mp3'
                    },
                    {
                        id: 'mkk59bns6np',
                        title: '18 | 原型设计：如何用最小的代价完成产品特性？',
                        src:
                            './软件工程之美/html/18原型设计如何用最小的代价完成产品特性.html',
                        audio:
                            './软件工程之美/audio/18原型设计如何用最小的代价完成产品特性.mp3'
                    },
                    {
                        id: 'jgnr1usd4gz',
                        title: '19 | 作为程序员，你应该有产品意识',
                        src:
                            './软件工程之美/html/19作为程序员你应该有产品意识.html',
                        audio:
                            './软件工程之美/audio/19作为程序员你应该有产品意识.mp3'
                    },
                    {
                        id: '3dcesto4htz',
                        title: '20 | 如何应对让人头疼的需求变更问题？',
                        src:
                            './软件工程之美/html/20如何应对让人头疼的需求变更问题.html',
                        audio:
                            './软件工程之美/audio/20如何应对让人头疼的需求变更问题.mp3'
                    },
                    {
                        id: 'q6mjykws80e',
                        title: '“一问一答”第2期 | 30个软件开发常见问题解决策略',
                        src:
                            './软件工程之美/html/一问一答第2期30个软件开发常见问题解决策略.html',
                        audio:
                            './软件工程之美/audio/一问一答第2期30个软件开发常见问题解决策略.mp3'
                    }
                ]
            },
            {
                id: 'n97urlujitt',
                title: '系统设计篇',
                subList: [
                    {
                        id: '5c2l1sy1s7q',
                        title: '21 | 架构设计：普通程序员也能实现复杂系统？',
                        src:
                            './软件工程之美/html/21架构设计普通程序员也能实现复杂系统.html',
                        audio:
                            './软件工程之美/audio/21架构设计普通程序员也能实现复杂系统.mp3'
                    },
                    {
                        id: 'iri94jr3ndi',
                        title: '22 | 如何为项目做好技术选型？',
                        src:
                            './软件工程之美/html/22如何为项目做好技术选型.html',
                        audio:
                            './软件工程之美/audio/22如何为项目做好技术选型.mp3'
                    },
                    {
                        id: 'e764es767mq',
                        title: '23 | 架构师：不想当架构师的程序员不是好程序员',
                        src:
                            './软件工程之美/html/23架构师不想当架构师的程序员不是好程序员.html',
                        audio:
                            './软件工程之美/audio/23架构师不想当架构师的程序员不是好程序员.mp3'
                    },
                    {
                        id: 'lb9n76y7hau',
                        title:
                            '24 | 技术债务：是继续修修补补凑合着用，还是推翻重来？',
                        src:
                            './软件工程之美/html/24技术债务是继续修修补补凑合着用还是推翻重来.html',
                        audio:
                            './软件工程之美/audio/24技术债务是继续修修补补凑合着用还是推翻重来.mp3'
                    }
                ]
            },
            {
                id: '1gj9jknl8oy',
                title: '开发编码篇',
                subList: [
                    {
                        id: 'hv63em5ndr5',
                        title: '25 | 有哪些方法可以提高开发效率？',
                        src:
                            './软件工程之美/html/25有哪些方法可以提高开发效率.html',
                        audio:
                            './软件工程之美/audio/25有哪些方法可以提高开发效率.mp3'
                    },
                    {
                        id: 'arai6u5mpjg',
                        title:
                            '26 | 持续交付：如何做到随时发布新版本到生产环境？',
                        src:
                            './软件工程之美/html/26持续交付如何做到随时发布新版本到生产环境.html',
                        audio:
                            './软件工程之美/audio/26持续交付如何做到随时发布新版本到生产环境.mp3'
                    },
                    {
                        id: 'o1wdq1pf4qd',
                        title: '27 | 软件工程师的核心竞争力是什么？（上）',
                        src:
                            './软件工程之美/html/27软件工程师的核心竞争力是什么上.html',
                        audio:
                            './软件工程之美/audio/27软件工程师的核心竞争力是什么上.mp3'
                    },
                    {
                        id: 'c8o94ha50pe',
                        title: '28 | 软件工程师的核心竞争力是什么？（下）',
                        src:
                            './软件工程之美/html/28软件工程师的核心竞争力是什么下.html',
                        audio:
                            './软件工程之美/audio/28软件工程师的核心竞争力是什么下.mp3'
                    },
                    {
                        id: 'z96l43b6ncy',
                        title: '29 | 自动化测试：如何把Bug杀死在摇篮里？',
                        src:
                            './软件工程之美/html/29自动化测试如何把Bug杀死在摇篮里.html',
                        audio:
                            './软件工程之美/audio/29自动化测试如何把Bug杀死在摇篮里.mp3'
                    },
                    {
                        id: 'qbmjij3u4fp',
                        title: '30 | 用好源代码管理工具，让你的协作更高效',
                        src:
                            './软件工程之美/html/30用好源代码管理工具让你的协作更高效.html',
                        audio:
                            './软件工程之美/audio/30用好源代码管理工具让你的协作更高效.mp3'
                    },
                    {
                        id: 'uq86fmy92qr',
                        title: '“一问一答”第3期 | 18个软件开发常见问题解决策略',
                        src:
                            './软件工程之美/html/一问一答第3期18个软件开发常见问题解决策略.html',
                        audio:
                            './软件工程之美/audio/一问一答第3期18个软件开发常见问题解决策略.mp3'
                    }
                ]
            },
            {
                id: 'fsqq7vt5hzm',
                title: '软件测试篇',
                subList: [
                    {
                        id: 'tgyygkxpux3',
                        title: '31 | 软件测试要为产品质量负责吗？',
                        src:
                            './软件工程之美/html/31软件测试要为产品质量负责吗.html',
                        audio:
                            './软件工程之美/audio/31软件测试要为产品质量负责吗.mp3'
                    },
                    {
                        id: 'f6hnw5hyfqf',
                        title: '32 | 软件测试：什么样的公司需要专职测试？',
                        src:
                            './软件工程之美/html/32软件测试什么样的公司需要专职测试.html',
                        audio:
                            './软件工程之美/audio/32软件测试什么样的公司需要专职测试.mp3'
                    },
                    {
                        id: '7hgezbdnqc4',
                        title:
                            '33 | 测试工具：为什么不应该通过QQ/微信/邮件报Bug？',
                        src:
                            './软件工程之美/html/33测试工具为什么不应该通过QQ微信邮件报Bug.html',
                        audio:
                            './软件工程之美/audio/33测试工具为什么不应该通过QQ微信邮件报Bug.mp3'
                    },
                    {
                        id: '6fb9ywvrk7c',
                        title: '34 | 账号密码泄露成灾，应该怎样预防？',
                        src:
                            './软件工程之美/html/34账号密码泄露成灾应该怎样预防.html',
                        audio:
                            './软件工程之美/audio/账号密码泄露成灾应该怎样预防.mp3'
                    }
                ]
            },
            {
                id: 'ks4swp6awao',
                title: '运行维护篇',
                subList: [
                    {
                        id: 'hdvseus8yg5',
                        title: '35 | 版本发布：软件上线只是新的开始',
                        src:
                            './软件工程之美/html/35版本发布软件上线只是新的开始.html',
                        audio:
                            './软件工程之美/audio/35版本发布软件上线只是新的开始.mp3'
                    },
                    {
                        id: '1w710r1185a',
                        title: '36 | DevOps工程师到底要做什么事情？',
                        src:
                            './软件工程之美/html/36DevOps工程师到底要做什么事情.html',
                        audio:
                            './软件工程之美/audio/36DevOps工程师到底要做什么事情.mp3'
                    },
                    {
                        id: 'f199wfkeqbj',
                        title: '37 | 遇到线上故障，你和高手的差距在哪里？',
                        src:
                            './软件工程之美/html/37遇到线上故障你和高手的差距在哪里.html',
                        audio:
                            './软件工程之美/audio/37遇到线上故障你和高手的差距在哪里.mp3'
                    },
                    {
                        id: 'qujau0ioc2k',
                        title:
                            '38 | 日志管理：如何借助工具快速发现和定位产品问题 ？',
                        src:
                            './软件工程之美/html/38日志管理如何借助工具快速发现和定位产品问题.html',
                        audio:
                            './软件工程之美/audio/38日志管理如何借助工具快速发现和定位产品问题.mp3'
                    },
                    {
                        id: '541rouh4orh',
                        title: '39 | 项目总结：做好项目复盘，把经验变成能力',
                        src:
                            './软件工程之美/html/39项目总结做好项目复盘把经验变成能力.html',
                        audio:
                            './软件工程之美/audio/39项目总结做好项目复盘把经验变成能力.mp3'
                    },
                    {
                        id: '7vba8nxx6yj',
                        title: '“一问一答”第4期 | 14个软件开发常见问题解决策略',
                        src:
                            './软件工程之美/html/一问一答第4期14个软件开发常见问题解决策略.html',
                        audio:
                            './软件工程之美/audio/一问一答第4期14个软件开发常见问题解决策略.mp3'
                    }
                ]
            },
            {
                id: '9d9m8lz3mdu',
                title: '经典案例解析篇',
                subList: [
                    {
                        id: 'j1vwzt5jawa',
                        title: '40 | 最佳实践：小团队如何应用软件工程？',
                        src:
                            './软件工程之美/html/40最佳实践小团队如何应用软件工程.html',
                        audio:
                            './软件工程之美/audio/40最佳实践小团队如何应用软件工程.mp3'
                    },
                    {
                        id: 'gsbh41g6rbb',
                        title: '41 | 为什么程序员的业余项目大多都死了？',
                        src:
                            './软件工程之美/html/41为什么程序员的业余项目大多都死了.html',
                        audio:
                            './软件工程之美/audio/41为什么程序员的业余项目大多都死了.mp3'
                    },
                    {
                        id: '9dk1uig6wth',
                        title: '42 | 反面案例：盘点那些失败的软件项目',
                        src:
                            './软件工程之美/html/42反面案例盘点那些失败的软件项目.html',
                        audio:
                            './软件工程之美/audio/42反面案例盘点那些失败的软件项目.mp3'
                    },
                    {
                        id: 'ii7zb98ijab',
                        title:
                            '43 | 以VS Code为例，看大型开源项目是如何应用软件工程的？',
                        src:
                            './软件工程之美/html/43以VSCode为例看大型开源项目是如何应用软件工程的.html',
                        audio:
                            './软件工程之美/audio/43以VSCode为例看大型开源项目是如何应用软件工程的.mp3'
                    },
                    {
                        id: 'rw8i44ohrmw',
                        title:
                            '44 | 微软、谷歌、阿里巴巴等大厂是怎样应用软件工程的？',
                        src:
                            './软件工程之美/html/44微软谷歌阿里巴巴等大厂是怎样应用软件工程的.html',
                        audio:
                            './软件工程之美/audio/44微软谷歌阿里巴巴等大厂是怎样应用软件工程的.mp3'
                    },
                    {
                        id: 'jcgegqrwcbf',
                        title:
                            '45 | 从软件工程的角度看微服务、云计算、人工智能这些新技术',
                        src:
                            './软件工程之美/html/45从软件工程的角度看微服务云计算人工智能这些新技术.html',
                        audio:
                            './软件工程之美/audio/45从软件工程的角度看微服务云计算人工智能这些新技术.mp3'
                    },
                    {
                        id: 'z0ryf2qzr9f',
                        title:
                            '“一问一答”第5期（内含彩蛋） | 22个软件开发常见问题解决策略',
                        src:
                            './软件工程之美/html/一问一答第5期内含彩蛋22个软件开发常见问题解决策略.html',
                        audio:
                            './软件工程之美/audio/一问一答第5期内含彩蛋22个软件开发常见问题解决策略.mp3'
                    }
                ]
            },
            {
                id: 't1r8oyiwxcy',
                title: '结束语',
                subList: [
                    {
                        id: 'izcere328a6',
                        title: '结束语 | 万事皆项目，软件工程无处不在',
                        src:
                            './软件工程之美/html/结束语万事皆项目软件工程无处不在.html',
                        audio:
                            './软件工程之美/audio/结束语万事皆项目软件工程无处不在.mp3'
                    }
                ]
            },
            {
                id: '0oecl4ei8n2',
                title: '结课测试',
                subList: [
                    {
                        id: 'gwl5gn4kr54',
                        title: '结课测试 | 这些软件工程知识，你都掌握了吗？',
                        src: '',
                        audio: ''
                    }
                ]
            }
        ]
    },
    //---手把手带你写一门编程语言
    {
        id: 'o2cigh71cpu',
        type: 'cs',
        cid: '436',
        title: '手把手带你写一门编程语言',
        subTitle: '从0到1，实现自己的编程语言',
        authorName: '宫文学',
        authorInfo: '北京原点代码CEO',
        contents: [
            {
                id: 'a76bwhm0s6x',
                title: '开篇词',
                subList: [
                    {
                        id: 'ir3f4drpcmg',
                        title: '开篇词｜让我们来写一门计算机语言吧',
                        src:
                            '手把手带你写一门编程语言/html/__406053__开篇词｜让我们来写一门计算机语言吧.html',
                        audio: ''
                    },
                    {
                        id: '2emp8v2riq1',
                        title: '课前热身｜开始学习之前我们要准备什么？',
                        src:
                            '手把手带你写一门编程语言/html/__406073__课前热身｜开始学习之前我们要准备什么？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'npf9t9vf9as',
                title: '起步篇：让一门超简单的语言跑起来',
                subList: [
                    {
                        id: 'mwpn0s5n8xt',
                        title: '01｜实现一门超简单的语言最快需要多久？',
                        src:
                            '手把手带你写一门编程语言/html/__406179__01｜实现一门超简单的语言最快需要多久？.html',
                        audio: ''
                    },
                    {
                        id: 'jxo796d4k9m',
                        title: '02｜词法分析：识别Token也可以很简单吗？',
                        src:
                            '手把手带你写一门编程语言/html/__406555__02｜词法分析：识别Token也可以很简单吗？.html',
                        audio: ''
                    },
                    {
                        id: 'otu39dw8gve',
                        title:
                            '03｜支持表达式：解析表达式和解析语句有什么不同？',
                        src:
                            '手把手带你写一门编程语言/html/__407295__03｜支持表达式：解析表达式和解析语句有什么不同？.html',
                        audio: ''
                    },
                    {
                        id: 'ttgzguylxt3',
                        title: '04｜如何让我们的语言支持变量和类型？',
                        src:
                            '手把手带你写一门编程语言/html/__407731__04｜如何让我们的语言支持变量和类型？.html',
                        audio: ''
                    },
                    {
                        id: '6xxspbyjm7l',
                        title:
                            '05｜函数实现：是时候让我们的语言支持函数和返回值了',
                        src:
                            '手把手带你写一门编程语言/html/__408912__05｜函数实现：是时候让我们的语言支持函数和返回值了.html',
                        audio: ''
                    },
                    {
                        id: '7wrkjgm6yfw',
                        title: '06｜怎么支持条件语句和循环语句？',
                        src:
                            '手把手带你写一门编程语言/html/__409811__06｜怎么支持条件语句和循环语句？.html',
                        audio: ''
                    },
                    {
                        id: 'l1olfa9491u',
                        title: '07｜怎么设计属于我们自己的虚拟机和字节码？',
                        src:
                            '手把手带你写一门编程语言/html/__410442__07｜怎么设计属于我们自己的虚拟机和字节码？.html',
                        audio: ''
                    },
                    {
                        id: '4lhy3w0msi8',
                        title:
                            '08｜基于TypeScript的虚拟机（一）：实现一个简单的栈机',
                        src:
                            '手把手带你写一门编程语言/html/__411227__08｜基于TypeScript的虚拟机（一）：实现一个简单的栈机.html',
                        audio: ''
                    },
                    {
                        id: 'm5n5js85cqc',
                        title:
                            '09｜基于TypeScript的虚拟机（二）：丰富特性，支持跳转语句',
                        src:
                            '手把手带你写一门编程语言/html/__412039__09｜基于TypeScript的虚拟机（二）：丰富特性，支持跳转语句.html',
                        audio: ''
                    },
                    {
                        id: 'vefxn2rb62v',
                        title:
                            '10｜基于C语言的虚拟机（一）：实现一个简单的栈机',
                        src:
                            '手把手带你写一门编程语言/html/__412865__10｜基于C语言的虚拟机（一）：实现一个简单的栈机.html',
                        audio: ''
                    },
                    {
                        id: '898h0st3f4j',
                        title:
                            '11｜基于C语言的虚拟机（二）：性能增长10倍的秘密',
                        src:
                            '手把手带你写一门编程语言/html/__413632__11｜基于C语言的虚拟机（二）：性能增长10倍的秘密.html',
                        audio: ''
                    },
                    {
                        id: 'xo0cumezoka',
                        title: '12｜物理机上程序运行的硬件环境是怎么样的？',
                        src:
                            '手把手带你写一门编程语言/html/__414397__12｜物理机上程序运行的硬件环境是怎么样的？.html',
                        audio: ''
                    },
                    {
                        id: 'k1yv0drutcj',
                        title: '13｜物理机上程序运行的软件环境是怎么样的？',
                        src:
                            '手把手带你写一门编程语言/html/__415077__13｜物理机上程序运行的软件环境是怎么样的？.html',
                        audio: ''
                    },
                    {
                        id: 'wv6sa8ukqbl',
                        title: '14｜汇编代码学习（一）：熟悉CPU架构和指令集',
                        src:
                            '手把手带你写一门编程语言/html/__416043__14｜汇编代码学习（一）：熟悉CPU架构和指令集.html',
                        audio: ''
                    },
                    {
                        id: 'wqbtbh9nmds',
                        title: '15｜汇编语言学习（二）：熟悉X86汇编代码',
                        src:
                            '手把手带你写一门编程语言/html/__416809__15｜汇编语言学习（二）：熟悉X86汇编代码.html',
                        audio: ''
                    },
                    {
                        id: 'y49iqawcnor',
                        title: '16｜生成本地代码第1关：先把基础搭好',
                        src:
                            '手把手带你写一门编程语言/html/__417353__16｜生成本地代码第1关：先把基础搭好.html',
                        audio: ''
                    },
                    {
                        id: 'h6eixm6cncr',
                        title:
                            '17｜生成本地代码第2关：变量存储、函数调用和栈帧维护',
                        src:
                            '手把手带你写一门编程语言/html/__418317__17｜生成本地代码第2关：变量存储、函数调用和栈帧维护.html',
                        audio: ''
                    },
                    {
                        id: '6pagdwcaho7',
                        title: '18｜生成本地代码第3关：实现完整的功能',
                        src:
                            '手把手带你写一门编程语言/html/__418808__18｜生成本地代码第3关：实现完整的功能.html',
                        audio: ''
                    },
                    {
                        id: 'i34fw33mnp7',
                        title: '19｜怎么实现一个更好的寄存器分配算法：原理篇',
                        src:
                            '手把手带你写一门编程语言/html/__420155__19｜怎么实现一个更好的寄存器分配算法：原理篇.html',
                        audio: ''
                    },
                    {
                        id: '49r951yyq2k',
                        title: '20｜怎么实现一个更好的寄存器分配算法：实现篇',
                        src:
                            '手把手带你写一门编程语言/html/__420555__20｜怎么实现一个更好的寄存器分配算法：实现篇.html',
                        audio: ''
                    },
                    {
                        id: '4hylkyxmqdk',
                        title: '21｜加深对栈的理解：实现尾递归和尾调用优化',
                        src:
                            '手把手带你写一门编程语言/html/__421602__21｜加深对栈的理解：实现尾递归和尾调用优化.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'svpsploawpn',
                title: '期中测试',
                subList: [
                    {
                        id: '9btlmx25vww',
                        title: '期中测试｜快来检验你在起步篇的学习成果吧',
                        src:
                            '手把手带你写一门编程语言/html/__423940__期中测试｜快来检验你在起步篇的学习成果吧.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'bu07kfbhtme',
                title: '用户分享',
                subList: [
                    {
                        id: 'b5n883wv93o',
                        title: '“他山之石”｜Sugar：这门课你可以试试这么学',
                        src:
                            '手把手带你写一门编程语言/html/__424229__“他山之石”｜Sugar：这门课你可以试试这么学.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'nkgjokdynsy',
                title: '不定时加餐',
                subList: [
                    {
                        id: '3nxqv385het',
                        title:
                            '“屠龙之秘”｜实现计算机语言这样的技术能用在哪里？（一）',
                        src:
                            '手把手带你写一门编程语言/html/__424365__“屠龙之秘”｜实现计算机语言这样的技术能用在哪里？（一）.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '71bg3v93kjo',
                title: '进阶篇：让我们的语言更实用',
                subList: [
                    {
                        id: 'pypiuezzowr',
                        title:
                            '22｜增强编译器前端功能第1步：再识数据流分析技术',
                        src:
                            '手把手带你写一门编程语言/html/__422442__22｜增强编译器前端功能第1步：再识数据流分析技术.html',
                        audio: ''
                    },
                    {
                        id: 'm0mvvxh7is6',
                        title: '23｜增强编译器前端功能第2步：增强类型体系',
                        src:
                            '手把手带你写一门编程语言/html/__423049__23｜增强编译器前端功能第2步：增强类型体系.html',
                        audio: ''
                    },
                    {
                        id: 'jobaw3m2rn1',
                        title: '24｜增强编译器前端功能第3步：全面的集合运算',
                        src:
                            '手把手带你写一门编程语言/html/__424592__24｜增强编译器前端功能第3步：全面的集合运算.html',
                        audio: ''
                    },
                    {
                        id: 'c9hn48fxwft',
                        title:
                            '25｜增强编译器前端功能第4步：综合运用多种语义分析技术',
                        src:
                            '手把手带你写一门编程语言/html/__425353__25｜增强编译器前端功能第4步：综合运用多种语义分析技术.html',
                        audio: ''
                    },
                    {
                        id: 'xsh39rltnp1',
                        title: '26｜增强更丰富的类型第1步：如何支持浮点数？',
                        src:
                            '手把手带你写一门编程语言/html/__426150__26｜增强更丰富的类型第1步：如何支持浮点数？.html',
                        audio: ''
                    },
                    {
                        id: 'oudg471noh0',
                        title: '27｜增加更丰富的类型第2步：如何支持字符串？',
                        src:
                            '手把手带你写一门编程语言/html/__426846__27｜增加更丰富的类型第2步：如何支持字符串？.html',
                        audio: ''
                    },
                    {
                        id: '8rc6h1zv9lh',
                        title: '28｜增加更丰富的类型第3步：支持数组',
                        src:
                            '手把手带你写一门编程语言/html/__427480__28｜增加更丰富的类型第3步：支持数组.html',
                        audio: ''
                    },
                    {
                        id: 'mg08arjjzbe',
                        title: '29｜面向对象编程第1步：先把基础搭好',
                        src:
                            '手把手带你写一门编程语言/html/__428273__29｜面向对象编程第1步：先把基础搭好.html',
                        audio: ''
                    },
                    {
                        id: '4b9xz4hb11q',
                        title: '30｜面向对象编程第2步：剖析一些技术细节',
                        src:
                            '手把手带你写一门编程语言/html/__429135__30｜面向对象编程第2步：剖析一些技术细节.html',
                        audio: ''
                    },
                    {
                        id: 'fs5jx00y61h',
                        title: '31｜面向对象编程第3步：支持继承和多态',
                        src:
                            '手把手带你写一门编程语言/html/__429917__31｜面向对象编程第3步：支持继承和多态.html',
                        audio: ''
                    },
                    {
                        id: '6zyjm4hopxb',
                        title: '32｜函数式编程第1关：实现高阶函数',
                        src:
                            '手把手带你写一门编程语言/html/__431494__32｜函数式编程第1关：实现高阶函数.html',
                        audio: ''
                    },
                    {
                        id: '3k3kfx5bvwp',
                        title: '33｜函数式编程第2关：实现闭包特性',
                        src:
                            '手把手带你写一门编程语言/html/__432102__33｜函数式编程第2关：实现闭包特性.html',
                        audio: ''
                    },
                    {
                        id: 'q5m2w6c8ogr',
                        title: '34｜内存管理第1关：Arena技术和元数据',
                        src:
                            '手把手带你写一门编程语言/html/__433981__34｜内存管理第1关：Arena技术和元数据.html',
                        audio: ''
                    },
                    {
                        id: 'v5dsz7npdvu',
                        title: '35｜内存管理第2关：实现垃圾回收',
                        src:
                            '手把手带你写一门编程语言/html/__435868__35｜内存管理第2关：实现垃圾回收.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'xfenupaalam',
                title: '优化篇：让程序的性能更高',
                subList: [
                    {
                        id: '8tyutdedk3x',
                        title: '36｜节点之海：怎么生成基于图的IR？',
                        src:
                            '手把手带你写一门编程语言/html/__436924__36｜节点之海：怎么生成基于图的IR？.html',
                        audio: ''
                    },
                    {
                        id: 'i3jc8j031yc',
                        title: '37 | 从AST到IR：体会数据流和控制流思维',
                        src:
                            '手把手带你写一门编程语言/html/__439771__37 _ 从AST到IR：体会数据流和控制流思维.html',
                        audio: ''
                    },
                    {
                        id: 'gbvw44j6et2',
                        title: '38｜中端优化第1关：实现多种本地优化',
                        src:
                            '手把手带你写一门编程语言/html/__440792__38｜中端优化第1关：实现多种本地优化.html',
                        audio: ''
                    },
                    {
                        id: 'mvifv75lwd3',
                        title: '39｜中端优化第2关：全局优化要怎么搞？',
                        src:
                            '手把手带你写一门编程语言/html/__442804__39｜中端优化第2关：全局优化要怎么搞？.html',
                        audio: ''
                    },
                    {
                        id: 'gcqwdqm9w1k',
                        title: '40｜中端优化第3关：一起来挑战过程间优化',
                        src:
                            '手把手带你写一门编程语言/html/__444361__40｜中端优化第3关：一起来挑战过程间优化.html',
                        audio: ''
                    },
                    {
                        id: 'ic6e1j8jayu',
                        title: '41｜后端优化：生成LIR和指令选择',
                        src:
                            '手把手带你写一门编程语言/html/__446048__41｜后端优化：生成LIR和指令选择.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '0rx7ew3w5ya',
                title: '展望篇：实现自主语言的征途',
                subList: [
                    {
                        id: 'nyptu6ye7xv',
                        title: '42｜到这里，我们的收获和未尽的工作有哪些？',
                        src:
                            '手把手带你写一门编程语言/html/__446848__42｜到这里，我们的收获和未尽的工作有哪些？.html',
                        audio: ''
                    },
                    {
                        id: 't3vovk2g40t',
                        title:
                            '期末考试｜实现编程语言这些核心知识点，你掌握得咋样了？',
                        src:
                            '手把手带你写一门编程语言/html/__447708__期末考试｜实现编程语言这些核心知识点，你掌握得咋样了？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'x76q6xgo3ry',
                title: '结束语',
                subList: [
                    {
                        id: 'ffhoj6v4qrw',
                        title: '结束语｜等待你大展身手的那些领域',
                        src:
                            '手把手带你写一门编程语言/html/__450960__结束语｜等待你大展身手的那些领域.html',
                        audio: ''
                    }
                ]
            }
        ]
    },
    {
        id: 'qrumjq3ggof',
        type: 'cs',
        cid: '450',
        title: '编程高手必学的内存知识',
        subTitle: '学好内存，掌握系统开发诀窍',
        authorName: '海纳',
        authorInfo: '华为编译器高级专家，原Huawei JDK团队负责人',
        contents: [
            {
                id: 'gfuxgm6kjje',
                title: '开篇词',
                subList: [
                    {
                        id: 'ntkbpalhg9d',
                        title: '开篇词｜为什么你要系统学习计算机的内存知识？',
                        src:
                            '编程高手必学的内存知识/html/__430019__开篇词｜为什么你要系统学习计算机的内存知识？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'sxk1ihixg4d',
                title: '课程导学',
                subList: [
                    {
                        id: 'yyazaqs84wb',
                        title: '导学（一）| 拆解CPU的基本结构和运行原理',
                        src:
                            '编程高手必学的内存知识/html/__430173__导学（一）_ 拆解CPU的基本结构和运行原理.html',
                        audio: ''
                    },
                    {
                        id: 'nxeqixj32g1',
                        title: '导学（二）| 汇编语言是怎么一回事？',
                        src:
                            '编程高手必学的内存知识/html/__430184__导学（二）_ 汇编语言是怎么一回事？.html',
                        audio: ''
                    },
                    {
                        id: 'u1zk5gmxinn',
                        title: '导学（三）| 一个CPU是怎么寻址的？',
                        src:
                            '编程高手必学的内存知识/html/__431373__导学（三）_ 一个CPU是怎么寻址的？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'frjlvtw0t3y',
                title: '软件篇',
                subList: [
                    {
                        id: 'w6rgbyxkwu1',
                        title: '01｜虚拟内存：为什么可用内存会远超物理内存？',
                        src:
                            '编程高手必学的内存知识/html/__430073__01｜虚拟内存：为什么可用内存会远超物理内存？.html',
                        audio: ''
                    },
                    {
                        id: 'nphjxcqoqhd',
                        title: '02｜聊聊x86体系架构中的实模式和保护模式',
                        src:
                            '编程高手必学的内存知识/html/__431400__02｜聊聊x86体系架构中的实模式和保护模式.html',
                        audio: ''
                    },
                    {
                        id: '5h7buln9p8x',
                        title: '03 | 内存布局：应用程序是如何安排数据的？',
                        src:
                            '编程高手必学的内存知识/html/__431904__03 _ 内存布局：应用程序是如何安排数据的？.html',
                        audio: ''
                    },
                    {
                        id: 'cwluwspd8ev',
                        title: '04 | 深入理解栈：从CPU和函数的视角看栈的管理',
                        src:
                            '编程高手必学的内存知识/html/__433530__04 _ 深入理解栈：从CPU和函数的视角看栈的管理.html',
                        audio: ''
                    },
                    {
                        id: 'zr13u7lwe6j',
                        title: '05 | 栈的魔法：从栈切换的角度理解进程和协程',
                        src:
                            '编程高手必学的内存知识/html/__435493__05 _ 栈的魔法：从栈切换的角度理解进程和协程.html',
                        audio: ''
                    },
                    {
                        id: 'o5ogytae5b3',
                        title: '06 | 静态链接：变量与内存地址是如何映射的？',
                        src:
                            '编程高手必学的内存知识/html/__436308__06 _ 静态链接：变量与内存地址是如何映射的？.html',
                        audio: ''
                    },
                    {
                        id: 'q7gptk6tj9e',
                        title:
                            '07 | 动态链接（上）：地址无关代码是如何生成的？',
                        src:
                            '编程高手必学的内存知识/html/__437653__07 _ 动态链接（上）：地址无关代码是如何生成的？.html',
                        audio: ''
                    },
                    {
                        id: 'l90r6pi8su0',
                        title:
                            '08 | 动态链接（下）：延迟绑定与动态链接器是什么？',
                        src:
                            '编程高手必学的内存知识/html/__440471__08 _ 动态链接（下）：延迟绑定与动态链接器是什么？.html',
                        audio: ''
                    },
                    {
                        id: '7v1t3fggnnh',
                        title: '09 | 深入理解堆：malloc和内存池是怎么回事？',
                        src:
                            '编程高手必学的内存知识/html/__440452__09 _ 深入理解堆：malloc和内存池是怎么回事？.html',
                        audio: ''
                    },
                    {
                        id: 'i2kq4kenxzj',
                        title: '10 | 页中断：fork、mmap背后的保护神',
                        src:
                            '编程高手必学的内存知识/html/__444178__10 _ 页中断：fork、mmap背后的保护神.html',
                        audio: ''
                    },
                    {
                        id: 'n4ry12w9yuv',
                        title: '11 | 即时编译：高性能JVM的核心秘密',
                        src:
                            '编程高手必学的内存知识/html/__445925__11 _ 即时编译：高性能JVM的核心秘密.html',
                        audio: ''
                    },
                    {
                        id: 'arf5chakpaa',
                        title: '12 | 内存虚拟化：云原生时代的奠基者',
                        src:
                            '编程高手必学的内存知识/html/__446677__12 _ 内存虚拟化：云原生时代的奠基者.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '6pswxjmdyq9',
                title: '硬件篇',
                subList: [
                    {
                        id: 'nwgdn34m9lw',
                        title:
                            '13 | 存储电路：计算机存储芯片的电路结构是怎样的？',
                        src:
                            '编程高手必学的内存知识/html/__450519__13 _ 存储电路：计算机存储芯片的电路结构是怎样的？.html',
                        audio: ''
                    },
                    {
                        id: '12ku2vysgvf',
                        title: '14 | CPU Cache：访存速度是如何大幅提升的？',
                        src:
                            '编程高手必学的内存知识/html/__460545__14 _ CPU Cache：访存速度是如何大幅提升的？.html',
                        audio: ''
                    },
                    {
                        id: 'm6bhn0m0p7v',
                        title: '15 | MESI协议：多核CPU是如何同步高速缓存的？',
                        src:
                            '编程高手必学的内存知识/html/__461801__15 _ MESI协议：多核CPU是如何同步高速缓存的？.html',
                        audio: ''
                    },
                    {
                        id: '5lfmo5ghrih',
                        title: '16 | 内存模型：有了MESI为什么还需要内存屏障？',
                        src:
                            '编程高手必学的内存知识/html/__462113__16 _ 内存模型：有了MESI为什么还需要内存屏障？.html',
                        audio: ''
                    },
                    {
                        id: '0ip774v7dcw',
                        title: '17 | NUMA：非均匀访存带来了哪些提升与挑战？',
                        src:
                            '编程高手必学的内存知识/html/__464090__17 _ NUMA：非均匀访存带来了哪些提升与挑战？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'c360a5oagwh',
                title: '自动内存管理篇',
                subList: [
                    {
                        id: 'ug89f93577n',
                        title: '18 | Java内存模型：Java中的volatile有什么用？',
                        src:
                            '编程高手必学的内存知识/html/__464954__18 _ Java内存模型：Java中的volatile有什么用？.html',
                        audio: ''
                    },
                    {
                        id: 'kye7swvwyva',
                        title: '19 | 垃圾回收：如何避免内存泄露？',
                        src:
                            '编程高手必学的内存知识/html/__465516__19 _ 垃圾回收：如何避免内存泄露？.html',
                        audio: ''
                    },
                    {
                        id: '23bslro0g7f',
                        title: '20 | Scavenge：基于copy的垃圾回收算法',
                        src:
                            '编程高手必学的内存知识/html/__467174__20 _ Scavenge：基于copy的垃圾回收算法.html',
                        audio: ''
                    },
                    {
                        id: 'rm80jnl9ei7',
                        title: '21 | 分代算法：基于生命周期的内存管理',
                        src:
                            '编程高手必学的内存知识/html/__468157__21 _ 分代算法：基于生命周期的内存管理.html',
                        audio: ''
                    },
                    {
                        id: 'q0q5zf1bdb8',
                        title: '22 | G1 GC：分区回收算法说的是什么？',
                        src:
                            '编程高手必学的内存知识/html/__468883__22 _ G1 GC：分区回收算法说的是什么？.html',
                        audio: ''
                    },
                    {
                        id: 'fczgfba6vwo',
                        title: '23 | Pauseless GC：挑战无暂停的垃圾回收',
                        src:
                            '编程高手必学的内存知识/html/__469971__23 _ Pauseless GC：挑战无暂停的垃圾回收.html',
                        audio: ''
                    },
                    {
                        id: '22t9jmva038',
                        title:
                            '24 | GC实例：Python和Go的内存管理机制是怎样的？',
                        src:
                            '编程高手必学的内存知识/html/__470918__24 _ GC实例：Python和Go的内存管理机制是怎样的？.html',
                        audio: ''
                    }
                ]
            },
            {
                id: '8lsimugk7ox',
                title: '加餐：不定期福利',
                subList: [
                    {
                        id: 'zw0luhg84ow',
                        title:
                            '不定期福利第一期 | 海纳：我是如何学习计算机知识的？',
                        src:
                            '编程高手必学的内存知识/html/__447556__不定期福利第一期 _ 海纳：我是如何学习计算机知识的？.html',
                        audio: ''
                    },
                    {
                        id: '0whd4enknks',
                        title: '不定期福利第二期 | 软件篇答疑',
                        src:
                            '编程高手必学的内存知识/html/__454080__不定期福利第二期 _ 软件篇答疑.html',
                        audio: ''
                    }
                ]
            },
            {
                id: 'cq41sd7nvf9',
                title: '结束语',
                subList: [
                    {
                        id: 'qg1402g51ky',
                        title: '期末测试 | 来赴一场满分之约吧！',
                        src:
                            '编程高手必学的内存知识/html/__471878__期末测试 _ 来赴一场满分之约吧！.html',
                        audio: ''
                    },
                    {
                        id: '4dcslatcl8n',
                        title: '结束语 | 自主基础软件开发的那片星辰大海',
                        src:
                            '编程高手必学的内存知识/html/__472403__结束语 _ 自主基础软件开发的那片星辰大海.html',
                        audio: ''
                    }
                ]
            }
        ]
    }
]
